[
  " ",
  "　 閱讀古書、 2、  3、  4、  5、  6、  7、  8、  9、  10、  11、  12、  13、  14、  15、  16",
  "　謙卦　艮下坤上（地山謙）",
  "謙，《序卦》：｢有大者不可以盈，故受之以謙。｣其有既大，不可至於盈滿，必在謙損，故大有之後，受之以謙也。為卦坤上艮下，地中有山也。地體卑下，山高大之物，而居地之下，謙之象也。以崇高之德，而處卑之下，謙之義也。",
  "謙，亨，君子有終。",
  "謙有亨之道也。有其德而不居，謂之謙。人以謙巽自處，何往而不亨乎。君子有終，君子志存乎謙巽，達理故樂天而不競，內充故退讓而不矜。安履乎讓，終身不易，自卑而人益尊之，自晦而德益光顯，此所謂君子有終也。在小人則有欲必競，有德必伐，雖使勉慕於謙，亦不能安行而固守，不能有終也。",
  "《彖》曰：謙亨，天道下濟而光明，地道卑而上行。",
  "濟當為際。此明謙而能亨之義。天之道，以其氣下際，故能化育萬物，其道光明。下際謂下交也。地之道，以其處卑，所以其氣上行，交於天，皆以卑降而亨也。",
  "天道虧盈而益謙，",
  "以天行而言，盈者則虧，謙者則益，日月陰陽是也。",
  "地道變盈而流謙，",
  "以地勢而言，盈滿者傾變而反陷，卑下者流注而益增也。",
  "鬼神害盈而福謙，",
  "鬼神謂造化之跡。盈滿者禍害之，謙損者福祐之，凡過而損，不足而益者，皆是也。",
  "人道惡盈而好謙。",
  "人情疾惡於盈滿，而好與於謙巽也。謙者人之至德，故聖人詳言，所以戒盈而勸謙也。",
  "謙尊而光，卑而不可踰，君子之終也。",
  "謙為卑巽也，而其道尊大而光顯。自處雖卑屈，而其德實高不可加尚，是不可踰也。君子至誠於謙，恒而不變，有終也，故尊光。",
  "《象》曰：地中有山，謙，君子以裒多益寡，稱物平施。",
  "地體卑下，山之高大而在地中，外卑下而內蘊高大之象，故為謙也。不云山在地中，而曰地中有山，言卑下之中蘊其崇高也。若言崇高蘊於卑下之中，則文理不順。諸象皆然，觀文可見。君子以裒多益寡，稱物平施，君子觀謙之象。山而在地下，是高者下之，卑者上之，見抑高舉下、損過益不及之義；以施於事，則裒取多者，增益寡者，稱物之多寡以均其施與，使得其平也。",
  "初六，謙謙君子，用涉大川，吉。",
  "初六以柔順處謙，又居一卦之下，為自處卑下之至，謙而又謙也，故曰謙謙。能如是者，君子也。自處至謙，眾所共與也，雖用涉險難，亦无患害，況居平易乎？何所不吉也？初處謙而以柔居下，得无過於謙乎？曰：柔居下，乃其常也，但見其謙之至，故為謙謙，未見其失也。",
  "《象》曰：謙謙君子，卑以自牧也。",
  "謙謙，謙之至也。謂君子以謙卑之道自牧也。自牧，自處也。《詩》云：｢自牧歸荑。｣",
  "六二，鳴謙，貞吉。",
  "二以柔順居中，是為謙德積於中。謙德充積於中，故發於外，見於聲音顏色，故曰鳴謙。居中得正，有中正之德也，故云貞吉。凡貞吉，有為貞且吉者，有為得貞則吉者，六二之貞吉，所自有也。",
  "《象》曰：鳴謙貞吉，中心得也。",
  "二之謙德，由至誠積於中，所以發於聲音，中心所自得也，非勉為之也。",
  "九三，勞謙，君子有終，吉。",
  "三以陽剛之德而居下體，為眾陰所宗，履得其位，為下之上，是上為君所任，下為眾所從，有功勞而持謙德者也，故曰勞謙。古之人有當之者，周公是也。身當天下之大任，上奉幼弱之主，謙恭自牧，夔夔如畏然，可謂有勞而能謙矣。既能勞謙，又須君子行之有終，則吉。夫樂高喜勝，人之常情。平時能謙，固已鮮矣，況有功勞可尊乎？雖使知謙之善，勉而為之，若矜負之心不忘，則不能常久，欲其有終，不可得也。唯君子安履謙順，乃其常行，故久而不變，乃所謂有終，有終則吉也。九三以剛居正，能終者也。此爻之德最盛，故象辭特重。",
  "《象》曰：勞謙君子，萬民服也。",
  "能勞謙之君子，萬民所尊服也。《繫辭》云：「勞而不伐，有功而不德，厚之至也。語以其功下人者也。德言盛，禮言恭。謙也者，致恭以存其位者也。」有勞而不自矜伐，有功而不自以為德，是其德弘厚之至也。言以其功勞而自謙，以下於人也。德言盛，禮言恭。以其德言之，則至盛，以其自處之禮言之，則至恭，此所謂謙也。夫謙也者，謂致恭以存其位者也。存，守也。致其恭巽以守其位，故高而不危，滿而不溢，是以能終吉也。夫君子履謙，乃其常行，非為保其位而為之也。而言存其位者，蓋能致恭，所以能存其位，言謙之道如此。如言為善有令名，君子豈為令名而為善也哉？亦言其令名者，為善之故也。",
  "六四，无不利，撝謙。",
  "四居上體，切近君位，六五之君又以謙柔自處，九三又有大功德，為上所任、眾所宗，而己居其上，當恭畏以奉謙德之君，卑巽以讓勞謙之臣，動作施為，无所不利於撝謙也。撝，施布之象，如人手之撝也。動息進退，必施其謙，蓋居多懼之地，又在賢臣之上故也。",
  "《象》曰：无不利，撝謙，不違則也。",
  "凡人之謙，有所宜施，不可過其宜也。如六五或用侵伐是也。唯四以處近君之地，據勞臣之上，故凡所動作，靡不利於施謙，如是然後中於法則，故曰不違則也，謂得其宜也。",
  "六五，不富以其鄰，利用侵伐，无不利。",
  "富者眾之所歸，唯財為能聚人。五以君位之尊，而執謙順以接於下，眾所歸也，故不富而能有其鄰也。鄰，近也。不富而得人之親也，為人君而持謙順，天下所歸心也。然君道不可專尚謙柔，必須威武相濟，然後能懷服天下，故利用行侵伐也。威德並著，然後盡君道之宜，而无所不利也。蓋五之謙柔，當防於過，故發此義。",
  "《象》曰：利用侵伐，征不服也。",
  "征其文德謙巽所不能服者也。文德所不能服，而不用威武，何以平治天下？非人君之中道，謙之過也。",
  "上六，鳴謙，利用行師，征邑國。",
  "六以柔處柔，順之極，又處謙之極，極乎謙者也。以極謙而反居高，未得遂其謙之志，故至發於聲音；又柔處謙之極，亦必見於聲色，故曰鳴謙。雖居无位之地，非任天下之事，然人之行己，必須剛柔相濟。上，謙之極也，至於太甚，則反為過矣。故利在以剛武自治。邑國，己之私有。行師，謂用剛武。征邑國，謂自治其私。",
  "《象》曰：鳴謙，志未得也，可用行師征邑國也。",
  "謙極而居上，欲謙之志未得，故不勝其切，至於鳴也。雖不當位，謙既過極，宜以剛武自治其私，故云利用行師征邑國也。"
]