[
  " ",
  "　 閱讀古書  2  3  4  5  6  7  8  9  10  11  12  13  14  15  16  17",
  "　豫　坤下震上",
  "豫，《序卦》：｢有大而能謙必豫，故受之以豫。｣承二卦之義而為次也，有既大而能謙，則有豫樂也。豫者，安和悅樂之義。為卦震上坤下，順動之象。動而和順，是以豫也。九四為動之主，上下群陰所共應也，坤又承之以順，是以動而上下順應，故為和豫之義。以二象言之，雷出於地上。陽始潛閉於地中，及其動而出地，奮發其聲，通暢和豫，故為豫也。",
  "豫，利建侯行師。",
  "豫，順而動也。豫之義，所利在於建侯行師。夫建侯樹屏，所以共安天下，諸侯和順則萬民悅服，兵師之興，眾心和悅，則順從而有功，故悅豫之道，利於建侯行師也。又上動而下順，諸侯從王師，眾順令之象。君萬邦，聚大眾，非和悅不能使之服從也。",
  " ",
  "《彖》曰：豫，剛應而志行，順以動，豫。",
  "剛應，謂四為群陰所應，剛得眾應也。志行，謂陽志上行，動而上下順從，其志得行也。順以動豫，震動而坤順，為動而順理，順理而動，又為動而眾順，所以豫也。",
  " ",
  "豫順以動，故天地如之，而況建侯行師乎？",
  "以豫順而動，則天地如之而弗違，況建侯行師，豈有不順乎？天地之道，萬物之理，唯至順而已。大人所以先天後天而不違者，亦順乎理而已。",
  " ",
  "天地以順動，故日月不過而四時不忒；聖人以順動，則刑罰清而民服。",
  "復詳言順動之道。天地之運，以其順動，所以日月之度不過差，四時之行不愆忒；聖人以順動，故經正而民興於善，刑罰清簡而萬民服也。",
  " ",
  "豫之時義大矣哉！",
  "既言豫順之道矣，然其旨味淵永，言盡而意有餘也，故復讚之云：｢豫之時義大矣哉！｣欲人研味其理，優柔涵泳而識之也。時義，謂豫之時義。諸卦之時與義用大者，皆讚其大矣哉，豫以下十一卦是也。豫、遯、姤、旅言時義，坎、暌、蹇言時用，頤、大過、解、革言時，各以其大者也。",
  " ",
  "《象》曰：雷出地奮，豫，先王以作樂崇德，殷薦之上帝，以配祖考。",
  "雷者，陽氣奮發，陰陽相薄，而成聲也。陽始潛閉地中，及其動，則出地奮震也。始閉鬱，及奮發則通暢和豫，故為豫也。坤順震發，和順積中，而發於聲，樂之象也。先王觀雷出地而奮，和暢發於聲之象作樂，樂以褒崇功德，其殷盛至於薦之上帝，推配之以祖考。殷，盛也。禮有殷奠，謂盛也。薦上帝，配祖考，盛之至也。",
  " ",
  "初六，鳴豫，凶。",
  "初六以陰柔居下，四豫之主也，而應之，是不中正之小人，處豫而為上所寵，其志意滿極，不勝其豫，至發於聲音，輕淺如是，必至於凶也。鳴，發於聲也。",
  " ",
  "《象》曰：初六鳴豫，志窮凶也。",
  "云初六，謂其以陰柔處下，而志意窮極，不勝其豫，至於鳴也，必驕肆而致凶矣。",
  " ",
  "六二，介于石，不終日，貞吉。",
  "逸豫之道，放則失正，故豫之諸爻，多不得正，才與時合也。唯六二一爻處中正，又无應，為自守之象。當豫之時，獨能以中正自守，可謂特立之操，是其節介如石之堅也。介于石，其介如石也。人之於豫樂，心悅之，故遲遲遂至於耽戀不能已也。二以中正自守，其介如石，其去之速，不俟終日，故貞正而吉也。處豫不可安且久也，久則溺矣。如二，可謂見幾而作者也。夫子因二之見幾，而極言知幾之道，曰：知幾其神乎，君子上交不諂，下交不瀆，其知幾乎！幾者動之微、吉之先見者也。君子見幾而作，不俟終日。《易》曰｢介於石，不終日，貞吉。｣介如石焉，寧用終日，斷可識矣。君子知微知彰，知柔知剛，萬夫之望。夫見事之幾微者，其神妙矣乎！君子上交不至於諂，下交不至於瀆者，蓋知幾也。不知幾，則至於過而不已。交於上以恭巽，故過則為諂；交於下以和易，故過則為瀆。君子見於幾微，故不至於過也。所謂幾者，始動之微也，吉凶之端可先見而未著者也。獨言吉者，見之於先，豈復至有凶也？君子明哲，見事之幾微，故能其介如石，其守既堅，則不惑而明，見幾而動，豈俟終日也？斷，別也。其判別可見矣。微與彰，柔與剛，相對者也。君子見微則知彰矣，見柔則知剛矣，知幾如是，眾所仰也，故讚之曰｢萬夫之望｣。",
  " ",
  "《象》曰：不終日，貞吉，以中正也。",
  "能不終日而貞且吉者，以有中正之德也。中正故其守堅而能辨之早、去之速。爻言六二處豫之道，為教之意深矣。",
  " ",
  "六三，盱豫，悔，遲有悔。",
  "六三陰而居陽，不中不正之人也。以不中正而處豫，動皆有悔。盱，上視也。上瞻望於四，則以不中正不為四所取，故有悔也。四，豫之主，與之切近，苟遲遲而不前，則見棄絕，亦有悔也。蓋處身不正，進退皆有悔吝。當如之何？在正身而已。君子處己有道，以禮制心，雖處豫時，不失中正，故无悔也。",
  " ",
  "《象》曰：盱豫有悔，位不當也。",
  "自處不當，失中正也，是以進退有悔。",
  " ",
  "九四，由豫，大有得，勿疑，朋盍簪。",
  "豫之所以為豫者，由九四也，為動之主，動而眾陰悅順，為豫之義。四，大臣之位，六五之君順從之，以陽剛而任上之事，豫之所由也，故云由豫。大有得，言得大行其志，以致天下之豫也。",
  "勿疑，朋盍簪：四居大臣之位，承柔弱之君，而當天下之任，危疑之地也，獨當上之倚任，而下无同德之助，所以疑也。唯當盡其至誠，勿有疑慮，則朋類自當盍聚。夫欲上下之信，唯至誠而已。苟盡其至誠，則何患乎其无助也？簪，聚也。簪之名簪，取聚髮也。或曰：卦唯一陽，安得同德之助？曰：居上位而至誠求助，理必得之。姤之九五曰｢有隕自天｣是也。四以陽剛，迫近君位，而專主乎豫，聖人宜為之戒，而不然者，豫和順之道也，由和順之道，不失為臣之正也。如此而專主於豫，乃是任天下之事而致時於豫者也，故唯戒以至誠勿疑。",
  " ",
  "《象》曰：由豫，大有得，志大行也。",
  "由己而致天下於樂豫，故為大有得，謂其志得大行也。",
  " ",
  "六五，貞疾，恒不死。",
  "六五以陰柔居君位，當豫之時，沉溺於豫，不能自立者也。權之所主，眾之所歸，皆在於四。四之陽剛得眾，非耽惑柔弱之君所能制也，乃柔弱不能自立之君，受制於專權之臣也，居得君位，貞也，受制於下，有疾苦也。六居尊位，權雖失而位未亡也，故云｢貞疾，恒不死｣，言貞而有疾，常疾而不死，如漢、魏末世之君也。人君致危亡之道非一，而以豫為多。在四不言失正，而於五乃見其強逼者，四本无失，故於四言大臣任天下之事之義，於五則言柔弱居尊，不能自立，威權去己之義，各據爻以取義，故不同也。若五不失君道，而四主於豫，乃是任得其人，安享其功，如太甲、成王也。蒙亦以陰居尊位，二以陽為蒙之主，然彼吉而此疾者，時不同也。童蒙而資之於人，宜也；耽豫而失之於人，危亡之道也。故蒙相應，則倚任者也；豫相逼，則失權者也。又上下之心專歸於四也。",
  " ",
  "《象》曰：六五貞疾，乘剛也；恒不死，中未亡也。",
  "貞而疾，由乘剛，為剛所逼也。恒不死，中之尊位未亡也。",
  " ",
  "上六，冥豫成，有渝无咎。",
  "上六陰柔，非有中正之德，以陰居上，不正也。而當豫極之時，以君子居斯時，亦當戒懼，況陰柔乎？乃耽肆於豫，昏迷不知反者也。在豫之終，故為昏冥已成也。若能有渝變，則可以无咎矣。在豫之終，有變之義。人之失，苟能自變，皆可以无咎，故冥豫雖已成，能變則善也。聖人發此義，所以勸遷善也，故更不言冥之凶，專言渝之无咎。",
  " ",
  "《象》曰：冥豫在上，何可長也？",
  "昏冥於豫，至於終極，災咎行及矣。其可長然乎？當速渝也。"
]