[
  "　 閱讀古書  2  3  4  5  6  7  8  9  10  11  12  13  14  15",
  "文字輸入：Joanna",
  "　噬嗑卦 　震下離上",
  "噬嗑，《序卦》：可觀而後有所合，故受之噬嗑。嗑者，合也。既有可觀，然後有來合之者也，嗑噬所以次觀也。噬，齧也；嗑，合也。口中有物，間之齧，而後合之也。卦上下二剛爻，而中柔外剛，中虛，人頤口之象也。中虛之中又一剛爻，為頤中有物之象。口中有物，則隔其上下，不得嗑必齧之，則得嗑，故為噬嗑。聖人以卦之象，推之於天下之事：在口，則為有物；隔而不得合。在天下，則為有強梗或讒邪，間隔於其間，故天下之事不得合也。當用刑罰，小則懲戒，大則誅戮以除去之，然後天下之治得成矣。凡天下至於一國一家，至於萬事，所以不和合者，皆由有間也，无間則合矣，以至天地之生，萬物之成，皆合而後能遂。凡未合者，皆有間也。若君臣父子親戚朋友之間，有離貳怨隙者，蓋讒邪間於其間也，除去之則和合矣。故間隔者，天下之大害也。聖人觀噬磕之象，推之於天下萬事，皆使去其間隔而合之，則无不和且治矣。噬嗑者，治天下之大用也，去天下之間，在任刑罰，故卦取用刑為義。在二體明照而威震，乃用刑之象。",
  "",
  "",
  " ",
  "噬嗑，亨，利用獄。",
  "",
  "",
  "噬嗑，亨卦，自有亨義也。天下之事所以不得亨者，以有間也。噬而嗑之，則亨通矣。利用獄，噬而嗑之之道，宜用刑獄也。天下之間，非刑獄何以去之，不云利用刑，而云利用獄者。卦有明照之象，利於察獄也。獄者，所以究察情偽，得其情則知為間之道，然後可以設防與致刑也。",
  "",
  "",
  " ",
  "彖曰：頤中有物，曰噬嗑。噬嗑而亨，",
  "",
  "",
  "頤中有物故為噬嗑。有物間於頤中則為害，噬而嗑之則其害亡，乃亨通也，故云噬嗑而亨。",
  "",
  "",
  " ",
  "剛柔分動而明，雷電合而章，",
  "",
  "",
  "以卦才言也，剛爻與柔爻相間，剛柔分而不相雜，為明辨之象，明辨察獄之本也。動而明，下震上離，其動而明也。雷電合而章，雷震而電耀，相須並見，合而章也。照與威並行，用獄之道也。能照則无所隱情，有威則莫敢不畏，上既以二象言其動而明，故復言威照並用之意。",
  "",
  "",
  " ",
  "柔得中而上行，雖不當位，利用獄也。",
  "",
  "",
  "六五以柔居中，為用柔得中之義。上行謂居尊位，雖不當位，謂以柔居五為不當，而利於用獄者，治獄之道，全剛則傷於嚴暴，過柔則失於寬縱。五為用獄之主，以柔處剛而得中，得用獄之宜也。以柔居剛為利用獄，以剛居柔為利否，曰剛柔質也，居用也，用柔非治獄之宜也。",
  "",
  "",
  " ",
  "象曰：雷電，噬嗑，先王以明罰敕法。",
  "",
  "",
  "象无倒置者，疑此文互也。雷電相須並見之物，亦有噬象。電明而雷威，先王觀雷電之象，法其明與威，以明其刑罰，飭其法令。法者，明事理而為之防者也。",
  "",
  "",
  " ",
  "初九，屨校滅趾，无咎。",
  "",
  "",
  "九居初，最下无位者也。下民之象，為受刑之人。當用刑之始，罪小而刑輕。校，木械也。其過小，故履之於足，以滅傷其趾。人有小過，校而滅其趾，則當懲懼不敢進於惡矣，故得无咎。《繫辭》云：小懲而大誡，此小人之福也。言懲之於小與初，故得无咎也。初與上无位，為受刑之人。餘四爻皆為用刑之人，初居最下无位者也。上處尊位之上，過於尊位亦无位者也。王弼以為：无陰陽之位。陰陽係於奇偶，豈容无也。然諸卦，初上不言當位。不當位者，蓋初終之義，為大臨之初九，則以位為正，若需上六云不當位。乾上九云无位，爵位之位，非陰陽之位也。",
  "",
  "",
  " ",
  "象曰：屨校滅趾，不行也。",
  "",
  "",
  "屨校而滅傷其趾，則知懲誡而不敢長其惡，故云不行也。古人制刑，有小罪則校其趾，蓋取禁止其行，使不進於惡也。",
  "",
  "",
  " ",
  "六二，噬膚，滅鼻，无咎。",
  "",
  "",
  "二應五之位，用刑者也。四爻皆取噬為義。二居中得正，是用刑得其中正也。用刑得其中正，則罪惡者易服，故取噬膚為象。噬齧人之肌膚，為易入也。滅，沒也。深入至沒其鼻也。二以中正之道，其刑易服，然乘初剛，是用刑于剛強之人。刑剛強之人，必須深痛故至滅鼻而无咎也。中正之道，易以服人，與嚴刑以待，則強義不相妨。",
  "",
  "",
  " ",
  "象曰：噬膚滅鼻，乘剛也。",
  "",
  "",
  "深至滅鼻者，乘剛故也。乘剛，乃用刑於剛強之人，不得不深嚴也，深嚴則得宜，乃所謂中也。",
  "",
  "",
  " ",
  "六三，噬腊肉，遇毒。小吝，无咎。",
  "",
  "",
  "三居下之上，用刑者也。六居三處不當位，自處不得其當而刑于人，則不服而怨懟，悖犯之如噬齧乾腊堅韌之物，而遇毒惡之味，反傷于口也。用刑而人不服，反致怨傷，是可鄙吝也。然當噬嗑之時，大要噬間而嗑之，雖其身處位不當，而強梗難服，至於遇毒，然用刑非為不當也，故雖可吝，而亦小噬而嗑之，非有咎也。",
  "",
  "",
  " ",
  "象曰：遇毒，位不當也。",
  "",
  "",
  "六三以陰居陽，處位不當，自處不當故所刑者難服，而反毒之也。",
  "",
  "",
  " ",
  "九四，噬乾胏*，得金矢，利艱貞，吉。",
  "",
  "",
  "九四居近君之位，當嗑噬之任者也。四已過中，是其間愈大，而用刑愈深也，故云：噬乾胏。胏，肉之有聯骨者，乾肉而兼骨，至堅難噬者也。噬至堅而得金矢，金取剛，矢取直。九四陽德剛直，為得剛直之道，雖用剛直之道，利在克艱其事，而貞固其守則吉也。九四剛而明，體陽而居柔，剛明則傷於果，故戒以知難，居柔則守不固，故戒以堅貞。剛而不貞者有矣，凡失剛者，皆不貞也，在噬嗑四最為善。",
  "",
  "",
  "*註：胏：ㄗˇ骨頭上的肉",
  "",
  "",
  " ",
  "象曰：利艱貞吉，未光也。",
  "",
  "",
  "凡言未光，其道未光大也。戒於利艱貞，蓋其所不足也，不得中正故也。",
  "",
  "",
  " ",
  "六五，噬乾肉，得黃金，貞厲，无咎。",
  "",
  "",
  "五在卦愈上而為噬乾肉，反易於四之乾胏者。五居尊位，乘在上之勢，以刑於下，其勢易也，在卦將極矣。其為間甚大，非易嗑也，故為噬乾肉也。得黃金，黃中色，金剛物。五居中為得中道，處剛而四輔以剛，得黃金也。五无應，而四居大臣之位，得其助也。貞厲无咎，六五雖處中剛，然實柔體，故戒以必正固而懷危厲，則得无咎也。以柔居尊，而當嗑噬之時，豈可不貞固而懷危懼哉。",
  "",
  "",
  " ",
  "象曰：貞厲无咎，得當也。",
  "",
  "",
  "所以能无咎者，以所為得其當也。所謂當居中，用剛而能守正慮危也。",
  "",
  "",
  " ",
  "上九，何校滅耳，凶。",
  "",
  "",
  "上過乎尊位，无位者也，故為受刑者，居卦之終，是其間大噬之極也。《繫辭》所謂惡積而不可揜罪，大而不可解者也，故何校而滅其耳，凶可知矣。何，負也，謂在頸也。",
  "",
  "",
  " ",
  "象曰：何校滅耳，聰不明也。",
  "",
  "",
  "人之聾暗不悟，積其罪惡以至於極，古人制法罪之大者，何之以校，為其无所聞，知積成其惡，故以校而滅傷其耳，誡聰之不明也。",
  "",
  "",
  " "
]