[
  "　 閱讀古書  2  3  4  5  6  7  8  9  10  11  12  13  14  15",
  "文字輸入：Joanna",
  "　无妄卦 　震下乾上（天雷無妄）",
  "",
  "",
  "无妄，《序卦》：復則不妄矣，故受之以无妄。復者反於道也，既復於道則合正理而无妄，故復之後，受之以无妄也。為卦乾上震下，震動也，動以天為无妄，動以人欲則妄矣，无妄之義大矣哉。",
  " ",
  "",
  "无妄，元亨，利貞。其匪正，有眚，不利有攸往。",
  "",
  "",
  "无妄者至誠也，至誠者天之道也。天之化育萬物，生生不窮，各正其性命，乃无妄也。人能合无妄之道，則所謂與天地合其德也。无妄有大亨之理，君子行无妄之道，則可以致大亨矣。无妄，天之道也，卦言人由无妄之道也。利貞，法无妄之道，利在貞正，失貞正則妄也。雖无邪心，茍不合正理，則妄也，乃邪心也，故有匪正則為過眚。既已无妄，不宜有往，往則妄也。",
  " ",
  "",
  "彖曰：无妄，剛自外來而為主於內。",
  "",
  "",
  "謂初九也。坤初爻變而為震，剛自外而來也。震以初爻為主，成卦由之，故初為无妄之主，動以天為无妄。動而以天，動為主也。以剛變柔，為以正去妄之象，又剛正為主於內，无妄之義也。九居初正也。",
  " ",
  "",
  "動而健，剛中而應，大亨以正，天之命也。",
  "",
  "",
  "下動而上健，是其動剛健也。剛健，无妄之體也。剛中而應五，以剛居中正。二復以中正相應，是順理而不妄也，故其道大亨通而貞正，乃天之命也。天命，謂天道也，所謂无妄也。",
  " ",
  "",
  "其匪正有眚，不利有攸往。无妄之往，何之矣。天命不祐，行矣哉。",
  "",
  "",
  "所謂无妄，正而已。小失於正，則為有過，乃妄也。所謂匪正，蓋由有往，若无妄而不往，何由有匪正乎。无妄者，理之正也，更有往將何之矣，乃入於妄也。往則悖於天理，天道所不祐，可行乎哉？",
  " ",
  "",
  "象曰：天下雷行，物與无妄，先王以茂對時育萬物。",
  "",
  "",
  "雷行於天下，陰陽交和相薄而成聲，於是驚蟄藏振，萌芽發生，萬物其所賦與，洪纖高下，各正其性命，无有差妄。物與，无妄也。先王觀天下，雷行發生，賦與之象，而以茂對天時，養育萬物，使各得其宜，如天與之无妄也。茂，盛也。茂對之為言，猶盛行永言之比。對時，謂順合天時。天道生萬物，各得其性命而不妄。王者體天之道，養育人民，以至昆蟲草木，使各得其宜，乃對時育物之道也。",
  " ",
  "",
  "初九，无妄往，吉。",
  "",
  "",
  "九以陽剛為主於內，无妄之象，以剛實變柔而居內，中誠不妄者也，以无妄而往，何所不吉。卦辭言不利有攸往，謂既无妄，不可復有往也。過則妄矣。爻言往吉，謂以无妄之道而行則吉也。",
  " ",
  "",
  "象曰：无妄之往，得志也。",
  "",
  "",
  "以无妄而往，无不得其志也。蓋誠之於物，无不能動，以之修身則身正，以之治事則事得，其理以之臨人則人感而化，无所往而不得其志也。",
  " ",
  "",
  "六二，不耕穫，不菑畬，則利有攸往。",
  "",
  "",
  "凡理之所然者非妄也。人所欲為者，乃妄也，故以耕穫菑畬譬之。六二居中得正，又應五之中正，居動體而柔順。為動能順乎中正，乃无妄者也，故極言无妄之義，耕農之始穫其成終也。田一歲曰菑，三歲曰畬。不耕而穫，不菑而畬，謂不首造其事，因其事理所當然也。首造其事，則是人心所作為，乃妄也。因事之當然，則是順理應物，非妄也。穫與畬是也。蓋耕則必有獲，菑則必有畬，是事理之固然，非心意之所造作也。或曰聖人制作，以利天下者，皆造端也，豈非妄乎？曰：聖人隨時制作，合乎風氣之宜，未嘗先時而開之也，若不待時，則一聖人足以盡為矣，豈待累聖繼作也。時乃事之端，聖人隨時而為也。",
  " ",
  "",
  "象曰：不耕穫，未富也。",
  "",
  "",
  "未者，非必之辭。臨卦曰：未順命是也。不耕而穫，不菑而畬，因其事之當然，既耕則必有穫，既菑則必成畬，非必以穫畬之富而為也。其始耕菑，乃設心在於求穫畬，是以其富也。心有欲而為者則妄也。",
  "",
  "",
  "",
  " ",
  "",
  "六三，无妄之災，或繫之牛，行人之得，邑人之災。",
  "",
  "",
  "三以陰柔而不中正，是為妄者也。又志應於上，欲也，亦妄也。在无妄之道，為災害也。人之妄動由有欲也，妄動而得，亦必有失，雖使得其所利，其動而妄，失已大矣，況復凶悔隨之乎。知者見妄之得，則知其失，必與稱也，故聖人因六三有妄之象，而發明其理，云无妄之災。或繫之牛，行人之得，邑人之災，言如三之為妄，乃无妄之災害也。設如有得，其失隨至，如或繫之牛。或謂：設，或也。或繫得牛，行人得之以為有得。邑人失牛，乃是災也。借使邑人繫得馬，則行人失馬，乃是災也。言有得，則有失，不足以為得也。行人邑人，但言有得則有失，非以為彼己也，妄得之福，災亦隨之。妄得之得，失亦稱之，固不足以為得也，人能知此，則不為妄動矣。",
  "",
  "",
  "",
  " ",
  "",
  "象曰：行人得牛，邑人災也。",
  "",
  "",
  "行人得牛，乃邑人之災也。有得則有失，何足以為得乎。",
  "",
  "",
  "",
  " ",
  "",
  "九四，可貞，无咎。",
  "",
  "",
  "四剛陽而居乾體，復无應與，无妄者也。剛而无私，豈有妄乎。可貞固守此，自无咎也。九居陰得為正乎？曰：以陽居乾體，若復處剛，則為過矣。過則妄也，居四无尚剛之志也。可貞與利貞不同。可貞，謂其所處，可貞固守之。利貞，謂利於貞也。",
  "",
  "",
  "",
  " ",
  "",
  "象曰：可貞无咎，固有之也。",
  "",
  "",
  "貞固守之則无咎也。",
  "",
  "",
  "",
  " ",
  "",
  "九五，无妄之疾，勿藥，有喜。",
  "",
  "",
  "九以中正當尊位，下復以中正順應之，可謂无妄之至者也。其道无以加矣。疾為之病者也。以九五之无妄，如其有疾，勿以藥治，則有喜也。人之有疾，則以藥石攻去其邪，以養其正。若氣體平和，本无疾病，而攻治之，則反害其正矣，故勿藥則有喜也。有喜謂疾自亡也。无妄之所謂疾者，謂若治之，而不治，率之而不從，化之而不革，以妄而為无妄之疾。舜之有苗，周公之管蔡，孔子之叔孫，武叔是也。既已无妄而有疾之者，則當自如。无妄之疾，不足患也。若遂自攻治，乃是渝其无妄，而遷於妄也。五既處无妄之極，故惟戒在動，動則妄矣。",
  "",
  "",
  "",
  " ",
  "",
  "象曰：无妄之藥，不可試也。",
  "",
  "",
  "人之有妄，理必修改，既无妄矣，復藥以治之，是反為妄也。其可用乎，故云不可試也。試，暫用也，猶曰少嘗之也。",
  "",
  "",
  "",
  " ",
  "",
  "上九，无妄行，有眚，无攸利。",
  "",
  "",
  "上九居卦之終，无妄之極者也。極而復行，過於理也，過於理則妄也。故上九而行，則有過眚而无所利矣。",
  "",
  "",
  "",
  " ",
  "",
  "象曰：无妄之行，窮之災也。",
  "",
  "",
  "无妄既極，而復加進，乃為妄矣。是窮極而為災害也。",
  "",
  "",
  "",
  " ",
  "",
  "",
  " ",
  ""
]