[
  "　 閱讀古書  2  3  4  5  6  7  8  9  10  11  12  13  14  15",
  "文字輸入：Joanna",
  "　晉卦 　坤下離上",
  "晉，《序卦》：「物不可以終壯，故受之以晉，晉者進也。」物无壯而終止之理，既盛壯則必進，晉所以繼大壯也。為卦離在坤上，明出地上也。日出於地，升而益明，故為晉。晉進而光明盛大之意也。凡物漸盛為進，故《彖》云：「晉，進也。」卦有有德者，有无德者，隨其宜也。乾坤之外，云元亨者，固有也。云利貞者，所不足而可以有功也。有不同者，革漸是也。隨卦可見晉之盛，而无德者无用有也。晉之明盛，故更不言亨。順乎大明，无用戒正也。",
  "晉，康侯用錫馬蕃庶，晝日三接。",
  "晉為進盛之時，大明在上，而下體順附。諸侯承王之象也，故為康侯。康侯，治安之侯也。上之大明而能同德，以順附治安之侯也，故受其寵，數錫之馬眾多也。車馬重賜也。蕃庶，眾多也，不唯錫與之厚，又見親禮晝日之中，至於三接，言寵遇之至也。晉進盛之時，上明下順，君臣相得。在上而言則進於明盛，在臣而言則進升高顯，受其光寵也。",
  "彖曰：晉，進也。明出地上，順而麗乎大明，柔進而上行，是以康侯用錫馬蕃庶，晝日三接也。",
  "晉，進也。明，進而盛也。明出於地，益進而盛，故為晉，所以不謂之進者。進為前進，不能包明盛之義。明出地上，離在坤上也。坤麗於離，以順麗於大明，順德之臣上附於大明之君也。柔進而上行，凡卦離在上者，柔居君位多云「柔進而上行」：噬嗑、睽、鼎是也。六五以柔居君位，明而順麗，為待下寵遇親密之義，是以為康侯用錫馬蕃庶。晝日三接也。大明之君，安天下者也。諸侯能附天子之明德，是康民安國之侯也，故謂之康侯，是以享寵錫，而見親禮，晝日之間三接見於天子也。不曰公卿，而曰侯，天子治於上者也，諸侯治於下者也。在下而順附於大明之君，諸侯之象也。",
  "象曰：明出地上，晉，君子以自昭明德。",
  "昭，明之也。傳曰：昭德塞違，昭其度也。君子觀明出地上，而益明盛之象，而以自昭其明德，去蔽致知，昭明德於己也。明明德於天下，昭明德於外也；明明德在己，故云自昭。",
  "初六，晉如摧如，貞吉。罔孚裕，无咎。",
  "初居晉之下，進之始也。晉如，升進也。摧如，抑退也。於始進而言，遂其進不遂其進，唯得正則吉也。罔孚者，在下而始進，豈遽能深見信於上。茍上未見信，則當安中自守，雍容寬裕，无急於求上之信也。茍欲信之心切，非汲汲以失其守，則悻悻以傷於義矣，皆有咎也。故裕，則无咎。君子處進退之道也。",
  "象曰：晉如摧如，獨行正也；裕无咎，未受命也。",
  "无進无抑，唯獨行正道也。寬裕則无咎者，始欲進而未當位故也。君子之於進退，或遲或速，唯義所當，未嘗不裕也。聖人恐後之人不達寬裕之義，居位者廢職失守以為裕，故特云初六，裕則无咎者，始進未受命當職任故也。若有官守不信於上而失職，一日不可居也。然事非一槩，久速唯時，亦容有為之兆者。",
  "六二，晉如愁如，貞吉。受茲介福，于其王母。",
  "六二在下，上无應援，以中正柔和之德，非強於進者也，故於進為可憂愁，謂其進之難也。然守其貞正，則當得吉，故云晉如愁如，貞吉。王母，祖母也，謂陰之至尊者，指六五也。二以中正之道自守，雖上无應援不能自進，然其中正之德久而必彰，上之人自當求之。蓋六五大明之君，與之同德，必當求之，加之寵祿，受介福於王母也。介，大也。",
  "象曰：受茲介福，以中正也。",
  "受茲介福，以中正之道也。人能守中正之道，久而必亨，況大明在上而同德，必受大福也。",
  "六三，眾允，悔亡。",
  "以六居三，不得中正，宜有悔咎。而三在順體之上，順之極者也。三陰皆順上者是也。是三之順上與眾同志，眾所允從，其悔所以亡也。有順上向明之志，而眾允從之，何所不利。或曰：不由中正，而與眾同得，為善乎？曰：眾所允者，必至當也。況順上之大明，豈有不善也，是以悔亡，蓋亡其不中正之失矣。古人曰：謀從眾，則合天心。",
  "象曰：眾允之，志上行也。",
  "上行上順，麗於大明也。上從大明之君，眾志之所同也。",
  "九四，晉如鼫鼠，貞厲。",
  "以九居四，非其位也。非其位而居之，貪據其位者也。貪處高位，既非所安，而又與上同德，順麗於上，三陰皆在己下，勢必上進，故其心畏忌之。貪而畏人者，鼫鼠也。故云｢晉如鼫鼠｣，貪於非據而存畏忌之心。貞固守此，其危可知，言貞厲者，開有改之道也。",
  "象曰：鼫鼠貞厲，位不當也。",
  "賢者以正德宜在高位，不正而處高位，則為非據。貪而懼失，則畏人。固處其地，危可知也。",
  "六五，悔亡，失得勿恤。往，吉，无不利。",
  "六以柔居尊位，本當有悔，以大明而下皆順附，故其悔得亡也。下既同德順附，當推誠委任，盡眾人之才，通天下之志，勿復自任其明、恤其失得，如此而往，則吉而无不利也。六五，大明之主。不患其不能明照，患其用明之過，至於察察，失委任之道，故戒以失得勿恤也。夫私意偏任不察則有蔽，盡天下之公，豈當復用私察也。",
  "象曰：失得勿恤，往有慶也。",
  "以大明之德，得下之附，推誠委任，則可以成天下之大功，往而有福慶也。",
  "上九，晉其角，維用伐邑。厲吉，无咎，貞吝。",
  "角剛而居上之物。上九以剛居卦之極，故取角為象，以陽居上剛之極也。在晉之上，進之極也。剛極則有強猛之過，進極則有躁急之失。以剛而極於進，失中之甚也。无所用而可維獨用於伐邑，則雖厲而吉，且无咎也。伐四方者，治外也；伐其居邑者，治內也。言伐邑，謂內自治也。人之自治，剛極則守道愈固，進極則遷善愈速。如上九者，以之自治，則雖傷於厲而吉，且貞无咎也。嚴厲非安和之道，而於自治則有功也。復云：貞吝以盡其義。極於剛進，雖自治有功，然非中和之德，故於貞正之道為可吝也。不失中正為貞。",
  "象曰：維用伐邑，道未光也。",
  "維用伐邑，既得吉而无咎。復云：貞吝者，貞道未光大也。以正理言之，猶可吝也。夫道既光大，則无不中正，大安有過也。今以過剛自治，雖有功矣，然其道未光大，故亦可吝。聖人言盡善之道。",
  " "
]