[
  "　 閱讀古書,  2,  3,  4,  5,  6,  7,  8,  9,  10,  11,  12,  13,  14,  15,  16,  17",
  "文字輸入：Joanna",
  "　明夷卦 　離下坤上",
  "明夷，《序卦》：晉者，進也。進必有所傷，故受之以明夷。夷者，傷也。夫進之不已，必有所傷，理自然也。明夷所以次晉也。為卦坤上離下，明入地中也，反晉成明夷，故義與晉正相反。晉者，明盛之卦。明君在上，群賢並進之時也。明夷昏暗之卦，暗君在上，明者見傷之時也。日入於地中，明傷而昏暗也，故為明夷。",
  "明夷，利艱貞。",
  "君子當明夷之時，利在知艱難，而不失其貞正也。在昏暗艱難之時，而能不失其正，所以為君子也。",
  "彖曰：明入地中，明夷。內文明而外柔順，以蒙大難，文王以之。",
  "明入於地，其明滅也，故為明夷。內卦離，離者文明之象。外卦坤，坤者柔順之象。為人內有文明之德，而外能柔順也，昔者文王如是，故曰文王以之。當紂之昏暗，乃明夷之時，而文王內有文明之德，外柔順以事紂，蒙犯大難而內不失其明聖，而外足以遠禍患，此文王所用之道也，故曰文王以之。",
  "利艱貞，晦其明也。內難而能正其志，箕子以之。",
  "明夷之時，利於處艱厄而不失其貞正，謂能晦藏其明也。不晦其明則被禍患，不守其正則非賢明。箕子當紂之時，身處其國內，切近其難，故云：內難。然箕子能晦藏其明，而自守其正志，箕子所用之道也。故曰箕子以之。",
  "象曰：明入地中，明夷。君子以莅眾，用晦而明。",
  "明所以照，君子无所不照。然用明之過則傷於察，太察則盡事而无含弘之慶，故君子觀明入地中之象，於莅眾也，不極其明察而用晦，然後能容物和眾，眾親而安，是用晦乃所以為明也。若自任其明，无所不察，則已不勝其忿疾，而无寬厚含容之德。人情睽，疑而不安，失莅眾之道，適所以為不明也。古之聖人，設前旈*屏樹者，不欲明之盡乎隱也。",
  "註* 旈：ㄌ一ㄡˊ旗子下邊懸垂的飾物",
  "初九，明夷于飛，垂其翼，君子于行，三日不食。有攸往，主人有言。",
  "初九明體而居明夷之初，見傷之始也。九陽明上升者也，故取飛象。昏暗在上，傷陽之明使不得上進，是于飛而傷其翼也。翼見傷故垂，大凡小人之害君子，害其所以行者，君子于行三日不食，君子明照見事之微，雖始有見傷之端，未顯也，君子則能見之矣，故行去避之。君子于行，謂去其祿位而退藏也。三日不食，謂困窮之極也。事未顯而處甚艱，非見幾之明不能也。夫知幾者，君子之獨見，非眾人所能識也，故明夷之始，其見傷未顯而去之，則世俗孰不疑怪，故有所往適則主人有言也。然君子不以世俗之見怪而遲疑其行也。若俟眾人盡識，則傷已及而不能去矣。此薛方所以為明，而揚雄所以不獲其去也。或曰傷至於垂翼，傷已明矣，何得眾人猶未識也？曰：初陽之始也。云垂其翼，謂傷其所以飛爾，其事則未顯也，君子見幾故亟去之。世俗之人未能見，故異而非之。如穆生之去楚申公。白公且非之，況世俗之人乎。但譏其責小禮，而不知穆生之去，避胥靡之禍也。當其言曰，不去楚人將鉗我於市。雖二儒者，亦以為過甚之言也。又如袁閎於黨事未起之前，名德之士方鋒起，而獨潛身土室，故人以為狂生，卒免黨錮之禍，所往，而人有言，胡足怪也。",
  "象曰：君子于行，義不食也。",
  "君子遯藏而困窮，義當然也。唯義之當然，故安處而无悶，雖不食可也。",
  "六二，明夷，夷于左股，用拯馬壯吉。",
  "六二以至明之才，得中正而體順，順時自處，處之至善也。雖君子自處之善，然當陰闇小人傷明之時，亦不免為其所傷，但君子自處有道，故不能深相傷害，終能違避之爾。足者，所以行也。股在脛足之上，於行之用為不甚切，左又非便用者。手足之用，以右為便，唯蹶張*用左，蓋右立為本也。夷于左股，謂傷害其行而不甚切也。雖然亦必自免有道，拯用壯健之馬，則獲免之速而吉也。君子為陰闇所傷，其自處有道，故其傷不甚，自拯有道故其傷不甚，自拯有道故獲免之疾，用拯之道不壯則被傷深矣，故云馬壯則吉也。二以明居陰闇之下，所謂吉者，得免傷害而已，非謂可以有為於斯時也",
  "註* 蹶ㄐㄩㄝˊ張：用腳踏來發射強弩",
  "象曰：六二之吉，順以則也。",
  "六二之得吉者，以其順處而有法則也，則謂中正之道能順而得中正，所以處明傷之時，而能保其吉也。",
  "九三，明夷于南狩，得其大首，不可疾貞。",
  "九三離之上，明之極也。又處剛而進，上六坤之上，暗之極也。至明居下而為下之上，至暗在上而處窮極之地，正相敵應將以明去暗者也。斯義也，其湯武之事乎。南在前而明方也，狩畋而去害之事也。南狩，謂前進而除害也，當克獲其大首。大首，謂暗之魁首，上六也。三與上正相應，為至明克至暗之相，不可疾貞，謂誅其元惡。舊染污俗未能遽，革必有其漸，革之遽則駭懼而不安。故酒誥*云：「惟殷之廸*，諸臣惟工乃湎*于酒，勿庸殺之，姑惟教之。」至於既久，尚曰：餘風未殄*，是漸漬之俗，不可以遽革也。故曰：不可疾貞。正之不可急也。上六雖非君位，以其居上而暗之極，故為暗之主，謂之大首。",
  "註* 酒誥：成王平定三監之亂之後，封康侯於衛，周公作《康誥》、《酒誥》，及誥，ㄍㄠˋ君王諭令臣下的專用文體。",
  "註* 殷：懇切  註* 廸：同迪：開導遵循",
  "註* 湎：ㄇㄧㄢˇ沈溺",
  "註* 殄：ㄊㄧㄢˇ斷絕;竭盡",
  "象曰：南狩之志，乃得大也。",
  "夫以下之明除上之暗，其志在去害而已。如商周之湯武，豈有意於利天下乎。得其大首，是能去害而大得其志矣。志茍不然，乃悖亂之事也。",
  "六四，入于左腹，獲明夷之心，于出門庭。",
  "六四以陰居陰，而在陰柔之體，處近君之位，是陰邪小人居高位，以柔邪順於君者也。六五明夷之君位，傷明之主也。四以柔邪順從之，以固其交。夫小人之事君，未有由顯明以道合者也，必以隱僻之道，自結於上。右當用，故為明顯之所。左不當用，故為隱僻之所。人之手足，皆以右為用。世謂僻所，為僻左，是左者隱僻之所也。四由隱僻之道，深入其君，故云入于左腹，入腹謂其交深也。其交之深，故得其心。凡姦邪之見，信於其君，皆由奪其心也。不奪其心，能无悟乎。于出門庭，既信之心而後行之於外也。邪臣之事暗君，必先蠱其心，而後能行於外。",
  "象曰：入于左腹，獲心意也。",
  "入于左腹，謂以僻邪之道入於君，而得其心意也。得其心，所以終不悟也。",
  "六五，箕子之明夷，利貞。",
  "五為君位，乃常也，然易之取義，變動隨時。上六處坤之上，而明夷之極，陰暗傷明之極者也。五切進之，聖人因以五為切近至暗之人，以見處之之義，故不專以君位言。上六陰暗傷民之極，故以為明夷之主。五切近傷明之主，若顯其明則見傷害必矣，故當如箕子之自晦藏，則可以免於難。箕子，商之舊臣，而同姓之親，可謂切近於紂矣，若不自晦其明，被禍可必也，故佯狂為奴，以免於害。雖晦藏其明而內守，守其正所謂內難而能正其志，所以謂之仁與明也。若箕子，可謂貞矣。以五陰柔，故為之戒，云利貞，謂宜如箕子之貞固也。若以君道言義，亦如是。人君有當含晦之時，亦外晦其明而內正其志也。",
  "象曰：箕子之貞，明不可息也。",
  "箕子晦藏不失其貞固，雖遭患難其明自存，不可滅息也。若逼禍患，遂失其所守，則是亡其明，乃滅息也。古之人，如揚雄者是也。",
  "上六，不明晦，初登于天，後入于地。",
  "上居卦之終，為明夷之主，又為明夷之極上至高之地，明在至高本當遠照，明既夷傷，故不明而反昏晦也。本居於高明當及遠，初登天也，乃夷傷其明而昏暗，後入于地也。上明夷之終，又坤陰之終，明傷之極者也。",
  "象曰：初登于天，照四國也；後入于地，失則也。",
  "初登于天，居高而明，則當照及四方也，乃被傷而昏暗，是後入于地，失明之道也。失，則失其道也。",
  " "
]