[
  "　閱讀古書  2  3  4  5  6  7  8  9  10  11  12  13  14  15  16  17  18",
  "文字輸入：Joanna",
  " 　 解卦 　坎下震上",
  "解，《序卦》：蹇者難也。物不可以終難，故受之以解。物无終難之理，難極則必散。解者，散也，所以次蹇也。為卦，震上坎下。震動也，坎險也。動於險外，出乎險也，故為患難解散之象。又震為雷，坎為雨，雷雨之作蓋陰陽交感和暢而緩散，故為解。解者，天下患難解散之時也。",
  "解，利西南，无所往，其來復吉。有攸往，夙吉。",
  "西南坤方，坤之體廣大平易。當天下之難方解，人始離艱苦，不可復以煩苛嚴急治之，當濟以寬大簡易，乃其宜也，如是則人心懷而安之，故利於西南也。湯除桀之虐，而以寬治，武王誅紂之暴而反商，政皆從寬易也。「无所往，其來復，吉有攸往，夙吉」：无所往，謂天下之難已解散，无所為也。有攸往，謂尚有所當解之事也。夫天下國家必紀剛，法度廢亂而後禍患生，聖人既解其難而安平無事矣，是无所往也，則當修復治道，正紀剛明法度，進復先代明王之治，是來復也，反正理也，天下之吉也。其發語辭，自古聖王救難定亂，其始未暇遽為也，既安定則為可久，可繼之治。自漢以下，亂既除，則不復有為。姑隨時維持而已，故不能成善治，蓋不知來復之義也。有攸往，夙吉，謂尚有所當解之事，則早為之乃吉也。當解而未盡者，不早去則將復盛，事之復生者，不早為則將漸大，故夙則吉也。",
  "彖曰：解，險以動，動而免乎險，解。",
  "坎險震動，險以動也。不險則非難，不動則不能出難。動而出於險外，是免乎險難也，故為解。",
  "解，利西南，往得眾也； ",
  "解難之道，利在廣大平易，以寬易而往濟，解則得眾心之歸也。",
  "其來復吉，乃得中也； ",
  "不云无所往，省文爾。救亂除難，一時之事，未能成治道也，必待解難；无所往然後來復先王之治，乃得中道謂合宜也。",
  "有攸往夙吉，往有功也。",
  "有所為則夙吉也。早則往而有功，緩則惡滋而害深矣。",
  "天地解而雷雨作，雷雨作而百果草木皆甲坼，解之時大矣哉。",
  "既明處解之道，復言天地之解，以見解時之大。天地之氣，開散交感而和暢則成雷雨，雷雨作而萬物皆生，發甲拆天地之功，由解而成，故贊解之時大矣哉。王者法天道，行寬宥，施恩惠，養育兆民至於昆蟲草木，乃順解之時，與天地合德也。",
  "象曰：雷雨作，解。君子以赦過宥罪。",
  "天地解散而成雷雨，故雷雨作而為解也，與明兩而作離語不同。赦釋之，宥寬之過失，則赦之可也。罪惡而赦之，非義也，故寬之而已。君子觀雷雨作解之象，體其發育則施恩仁，體其解散則行寬釋也。",
  "初六，无咎。",
  "六居解初患難既解之時，以柔居剛，以陰應陽，柔而能剛之義。既无患難而自處，得剛柔之宜，患難既解，安寧无事，唯自處得宜，則為无咎矣。方解之初，宜安靜以休息之。爻之辭寡，所以示意。",
  "象曰：剛柔之際，義无咎也。",
  "初四相應是剛柔相際接也。剛柔相際為得其宜，難既解而處之，剛柔得宜，其義无咎也。",
  "九二，田獲三狐，得黃矢，貞吉。",
  "九二以陽剛得中之才。上應六五之君，用於時者也。天下小人常眾，剛明之君在上，則明足以照之，威足以懼之，剛足以斷之，故小人不敢用其情，然尤常存警戒，慮其有間而害正也。六五以陰柔居尊位，其明易蔽，其威易犯，其斷不果而易惑，小人一近之則移其心矣，況難方解而治之初，其變尚易，二既當用，必須能去小人，則可以正君心，而行其剛中之道。田者去害之事，狐者邪媚之獸。三狐，指卦之三陰，時之小人也。獲謂能變化除去之，如田之獲狐也。獲之則得中正之道，乃貞正而吉也。黃中色，矢直物，黃矢謂中直也。羣邪不去，君心一入，則中直之道无由行矣。桓敬之不去武，三思是也。",
  "象曰：九二貞吉，得中道也。",
  "所謂貞吉者，得其中道也。除去邪惡使其中直之道得行，乃正而吉也。",
  "六三，負且乘，致寇至，貞吝。",
  "六三陰柔居下之上，處非其位，猶小人宜在下以負荷，而且乘車非其據也，必至寇奪之至，雖使所為得正，亦可鄙吝也。小人而竊盛位，雖勉為正事，而氣質卑下，本非在上之物，終可吝也。若能正大，則如何？曰：大正非陰柔所能也，若能之，則是化為君子矣。三陰柔小人宜在下，而反處下之上，猶小人宜負而反乘，當至寇奪也。難解之時，而小人竊位，復致宼矣。",
  "象曰：負且乘，亦可醜也，自我致戎，又誰咎也。",
  "負荷之人而且乘載，為可醜惡也，處非其據，德不稱其器，則寇戎之致，乃已招取，將誰咎乎。聖人又於《繫辭》明其致寇之道，謂作易者其知盜乎。盜者乘釁而至，茍无釁隙則盜安能犯。負者小人之事，乘者君子之器。以小人而乘君子之器，非其所能安也，故盜乘釁而奪之。小人而居君子之位，非其所能堪也，故滿假而陵慢其上，侵暴其下，盜則乘其過而伐之矣。伐者，聲其罪也。盜橫暴而至者也。貨財而輕慢其藏，是教誨乎盜使取之也。女子而夭治其容，是教誨淫者使暴之也。小人而乘君子之器，是招盜使奪之也，皆自取之，之謂也。",
  "九四，解而拇，朋至斯孚。",
  "九四以陽剛之才居上位，承六五之君，大臣也。而下與初六之陰為應，拇在下而微者，謂初也。居上位而親小人，則賢人正士遠退矣，斥去小人則君子之黨進而誠相得也。四能解去初六之陰柔，則陽剛君子之朋來至，而誠合矣，不解去小人，則己之誠未至，安能得人之孚也。初六其應，故謂遠之為解。",
  "象曰：解而拇，未當位也。",
  "四雖陽剛，然居陰，於正疑不足，若復親比小人，則其失正必矣，故戒必解其拇，然後能來君子，以其處未當位也。解者，本合而離之也，必解拇而後朋孚，蓋君子之交而小人容於其間，是與君子之誠未至也。",
  "六五，君子維有解，吉，有孚于小人。",
  "六五居尊位，居為解之主人，君之解也。以君子通言之，君子所親比者，必君子也。所解去者，必小人也。故君子維有解則吉也。小人去則君子進矣，吉孰大焉。有孚者世云見驗也，可驗之於小人。小人之黨去則是君子能有解也，小人去則君子自進，正道自行，天下足治也。",
  "象曰：君子有解，小人退也。",
  "君子之所解者，謂退去小人也。小人去則君子之道行，是以吉也。",
  "上六，公用射隼于高墉之上，獲之，无不利。",
  "上六尊高之地，而非君位，故曰公，但據解終而言也。隼鶩害之物，象為害之小人。墉墻內外之限也。害若在內，則是未解之時也，若出墉外，則是无咎矣，復何所解，故在墉上離乎內而未去也。云高，見防限之嚴而未去者，上解之極也。解極之時而獨有未解者，乃害之堅強者也。上居解極，解道已至，器已成也，故能射而獲之。既獲之，則天下之患解已盡矣，何所不利。夫子於繫辭復申其義曰：隼者禽也，弓矢者器也，射之者人也。君子藏器於身，待時而動，何不利之有。動而不括，是以出而有獲，語成器而動者也。鶩害之物在墉上，茍无其器與不待時而發，則安能獲之，所以解之之道器也。事之當解與已解之之道，至者時也，如是而動，故无括結，發而不利矣。括結謂阻礙，聖人於此發明藏器，待時之義。夫行一身至於天下之事，茍无其器與不以時而動，小則括塞，大則喪敗。自古喜有為而无成功，或顛覆者，皆由是也。",
  "象曰：公用射隼，以解悖也。",
  "至解終而未解者，悖亂之大者也。射之所以解之也，解則天下平矣。",
  " "
]