[
  "　閱讀古書  2  3  4  5  6  7  8  9  10  11  12  13  14  15  16  17  18",
  "文字輸入：Joanna",
  " ",
  "　 損卦　兌下艮上",
  "損，《序卦》：解者，緩也。緩必有所失，故受之以損。縱緩則必有所失，失則損也，損所以繼解也。為卦艮上兌下，山體高，澤體深，下深則上益高，為損下益上之義。又澤在山下，其氣上通，潤及草木百物，是損下而益上也。又下為兌說，三爻皆上應，是說以奉上，亦損下益上之義。又下兌之成兌，由六三之變也。上艮之成艮，自上九之變也。三本剛而成柔，上本柔而成剛，亦損下益上之義。損上而益於下，則為益；取下且益於上，則為損。在人上者，施其澤以及下，則益也；取其下以自厚，則損也。譬諸壘土，損於上以培厚其基本，則上下安固矣，豈非益乎。取於下以增上之高，則危墬至矣，豈非損乎。故損者，損下益上之義，益則反是。",
  "損，有孚，元吉，无咎，可貞，利有攸往。",
  "損，減損也。凡損抑其過以就義理，皆損之道也。損之道必有孚誠，謂至誠順於理也。損而順理則大善而吉，所損无過差而貞固常行，而利有所往也。人之所損，或過、或不及、或不常，皆不合正理，非有孚也。非有孚則无吉而有咎，非可貞之道，不可行也。",
  "曷*之用？二簋可用享。",
  "損者，損過而就中，損浮末而就本實也，聖人以寧儉為禮之本，故為損。發明其義以享祀言之，享祀之禮，其文最繁，然以誠敬為本，多儀傋物，所以將飾其誠敬之心，飾過其誠則為偽矣。損飾所以存誠也，故云「曷之用？二簋可用享」。二簋之約可用享祀，言在乎誠而已，誠為本也，天下之害无不由末之勝也。峻宇雕墻本於宮室，酒池肉林本於飲食，淫酷殘忍本於刑罰，窮兵黷武本於征討，凡人欲之過者，皆本於奉養，其流之遠則為害矣。先王制其本者，天理也。後人流於末者，人欲也。損之義，損人欲以復天理而已。",
  "註*曷：ㄏㄜˊ，何也",
  "彖曰：損，損下益上，其道上行。",
  "損之所以為損者，以損於下而益於上也。取下以益上，故云其道上行，夫損上而益下，則為益；損下而益上，則為損。損基本以為高者，豈可謂之益乎。",
  "損而有孚，元吉。无咎，可貞，利有攸往。",
  "謂損而以至誠則有此元吉。以下四者，損道之盡善也。",
  "曷之用，二簋可用享，二簋應有時，損剛益柔有時。",
  "夫子特釋「曷之用二簋可用享」，卦辭簡直，謂當損去浮飾。曰何所用哉？二簋可以享也。厚本損末之謂也。夫子恐後人不達，遂以為文飾當盡去，故詳言之。有本必有末，有實必有文，天下萬事无不然者。无本不立，无文不行。父子主思，必有嚴順之體。君臣主敬，必有承接之儀。禮讓存乎內，待威儀而後行。尊卑有其序，非物采則无別，文之與實，相須而不可缺也。及夫文之勝，末之流遠，本喪實乃當損之時也。故云：曷所用哉，二簋足以薦其誠矣。謂當務實而損飾也。夫子恐人之泥言也，故復明之曰：二簋之質，用之當有時，非其所用而用之，不可也。謂文飾未過而損之，與損之至於過甚則非也。損剛益柔有時，剛為過，柔為不足，損益皆損剛益柔也，必順時而行，不當時而損益之，則非也。",
  "損益盈虛，與時偕行。",
  "或損或益，或盈或虛，唯隨時而已。過者損之，不足者益之；虧者盈之；實者虛之。與時偕行也。",
  "象曰：山下有澤，損，君子以懲忿窒欲。",
  "山下有澤氣通上潤，與深下以增高，皆損下之象。君子觀損之象，以損於己，在修己之道，所當損者唯忿與欲，故以懲戒其忿怒，窒塞其意欲也。",
  "初九，已事遄往，无咎，酌損之。",
  "損之義，損剛益柔，損下益上也。初以陽剛應於四，四以陰柔居上位，賴初之益者，下之益上，當損已而不自以為功，所益於上者，事既已則速去之，不居其功乃无咎也。若享其成功之美，非損己益上也。於為下之道為有咎矣。四之陰柔，賴初者也，故聽於初。初當酌度其宜，而損己以益之，過與不及皆不可也。",
  "象曰：已事遄往，尚合志也。",
  "尚上也，時之所崇用為尚。初之所尚者，與上合志也。四賴於初，初益於四，與上合志也。",
  "九二，利貞，征凶。弗損，益之。",
  "二以剛中當損剛之時，居柔而說體，上應六五陰柔之君，以柔說應上，則失其剛中之德，故戒所利在貞正也。征，行也，離乎中而失其貞正而凶矣。守其中乃貞也，弗損益之，不自損其剛貞，則能益其上，乃益之也。若失其剛貞而用柔說，適足以損之而已，非損己而益上也。世之愚者，有雖无邪心而唯知竭力順上，為忠者蓋不知弗損益之之義也。",
  "象曰：九二利貞，中以為志也。",
  "九居二非正也，處說非剛也，而得中為善，若守其中德何有不善，豈有中而不正者，豈有中而有過者，二所謂利貞謂以中為志也。志存乎中則自正矣，大率中重於正，中則正矣。正不必中也，能守中則有益於上矣。",
  "六三，三人行，則損一人，一人行，則得其友。",
  "損者損有餘也，益者益不足也。三人謂下三陽，上三陰。三陽同行，則損九三以益上；三陰同行，則損上六以為三。三人同行則損一人也。上以柔易剛而謂之損，但言其減一耳，上與三雖本相應，由二爻升降而一卦皆成，兩相與也。初二二陽。四五二陰，同德相比，三與上應，皆兩相與，則其志專皆為得其友也。三雖與四相比，然異體而應上，非同行者也。三人則損一人，一人則得其友，蓋天下无不二者。一與二相對待，生生之本也，三則餘而當損矣。此損益之大義也。夫子又於繫辭盡其義曰：天地絪緼，萬物化醇。男女搆精，萬物化生。易曰：三人行，則損一人，一人行，則得其友。言至一也。絪緼，交密之狀。天地之氣相交而密則生，萬物之密醇醇謂醲厚，醲厚猶精一也。男女精氣交構，則化生萬物。唯精醇專一，所以能生也。一陰一陽豈可二也。故三則當損，言專致乎一也。天地之間，當損益之明且大者，莫過此也。",
  "象曰：一人行，三則疑也。",
  "一人行而得一人，乃得友也。若三人行則疑所與矣，理當損去一人，損其餘也。",
  "六四，損其疾，使遄有喜，无咎。",
  "四以陰柔居上，與初之剛陽相應，在損時而應剛，能自損以從剛陽也。損不善以從善也。初之益四，損其柔而益之以剛，損其不善也，故曰損其疾。疾謂疾病，不善也。損於不善，唯使之遄速，則有喜而无咎。人之損過，唯患不速，速則不至於深過，為可喜也。",
  "象曰：損其疾，亦可喜也。",
  "損其所疾，固可喜也。云亦，發語辭。",
  "六五，或益之，十朋之龜，弗克違，元吉。",
  "六五於損時，以中順居尊位。虛其中以應乎二之剛陽，是人君能虛中自損，以順從在下之賢也。能如是，天下孰不損己自盡以益之，故或有益之之事，則十朋助之矣。十眾辭，龜者決是非吉凶之物。眾人之公論，必合正理，雖龜策不能違也，如此可謂大善之吉矣。古人曰：謀從眾，則合天心。",
  "象曰：六五元吉，自上祐也。",
  "所以得元吉者，以其能盡眾人之見，合天地之理，故自上天降之福祐也。",
  "上九，弗損，益之，无咎，貞吉，利有攸往，得臣无家。",
  "凡損之義有三：損己從人也，自損以益於人也，行損道以損於人也。損己從人，徒於義也。自損益人，及於物也。行損道以損於人，行其義也。各因其時取大者言之。四五二爻，取損己從人。下體三爻，取自損以益人。損時之用，行損道以損天下之當損者也。上九則取不行其損為義。九居損之終極，而當變者也，以剛陽居上，若用剛以損削於下，非為上之道，其咎大矣。若不行其損，變而以剛陽之道益於下，則无咎而得其正且吉也，如是則宜有所往，往則有益矣。在上能不損其下而益之，天下孰不服從。服從之眾，无有內外也，故曰得臣。无家得臣，謂得人心歸服。无家，謂无有遠近內外之限也。",
  "象曰：弗損，益之，大得志也。",
  "居上不損下而反益之，是君子大得行其志也。君子之志，唯在益於人而已。 ",
  " "
]