[
  "　閱讀古書  2  3  4  5  6  7  8  9  10  11  12  13  14  15  16  17",
  "文字輸入：Joanna",
  " ",
  "  　 夬卦 　乾下兌上",
  "夬，《序卦》：益而不已必決，故受之以夬。夬者，決也。益之極必決而後止，理无常益，益而不巳，巳乃決也，夬所以次益也。為卦兌上乾下，以二體言之，澤水之聚也，乃上於至高之處，有潰決之象。以爻言之，五陽在下，長而將極；一陰在上，消而將盡。眾陽上進，決去一陰，所以為夬也。夬者，剛決之義，眾陽進而決去一陰，君子道長，小人消衰，將盡之之時也。",
  "夬，揚于王庭，孚號有厲。",
  "小人方盛之時，君子之道未勝，安能顯，然以正道決去之，故含晦俟時，漸圖消之之道。今既小人衰微，君子道盛，當顯行之於公朝，使人明知善惡，故云揚于王庭。孚，信之在中，誠意也。號者，命眾之辭。君子之道雖長盛，而不敢忘戒備，故至誠以命眾，使知尚有危道，雖以此之甚盛，決彼之甚衰，若易而无備，則有不虞之悔，是尚有危理，必有戒懼之心，則无患也。聖人設戒之意深矣。",
  "告自邑，不利即戎，利有攸往。",
  "君子之治小人，以其不善也，必以己之善道勝革之，故聖人誅亂必先修己，舜之敷文德是也。邑，私邑。告自邑，先自治也。以眾陽之盛決於一陰，力固有餘，然不可極其剛至於太過，太過乃如《蒙》上九之為寇也。戎，兵者，強武之事。不利即戎，謂不宜尚壯武也。即，從也。從戎，尚武也。利有攸往，陽雖盛，未極乎上，陰雖微，猶有未去，是小人尚有存者，君子之道有未至也，故宜進而往也。不尚剛武，而其道益進，乃夬之善也。",
  "彖曰：夬，決也，剛決柔也。健而說，決而和。",
  "夬為決義，五陽決上之一陰也。健而說，決而和，以二體言卦才也。下健而上說，是健而能說，決而能和，夬之至善也。兌說為和。",
  "揚于王庭，柔乘五剛也；",
  "柔雖消矣，然居五剛之上，猶為乘陵之象。陰而乘陽，非理之甚，君子勢既足以去之，當顯揚其罪於王朝大庭，使眾知善惡也。",
  "孚號有厲，其危乃光也；",
  "盡誠信以命其眾，而知有危懼，則君子之道乃无虞而光大也。",
  "告自邑，不利即戎，所尚乃窮也；",
  "當先自治，不宜專尚剛武，即戎則所尚乃至窮極矣。夬之時，所謂尚剛武也。",
  "利有攸往，剛長乃終也。",
  "陽剛雖盛，長猶未終，尚有一陰更當決去，則君子之道，純一而无害之者矣，乃剛長之終也。",
  "象曰：澤上于天，夬。君子以施祿及下，居德則忌。",
  "澤，水之聚也，而上于天至高之處，故為夬象。君子觀澤決於上，而注溉於下之象，則以施祿及下，謂施其祿澤以及於下也。觀其決潰之象，則以居德則忌。居德，謂安處其德則約也。忌，防也；謂約立防禁，有防禁則无潰散也。王弼作明忌亦通，不云澤在天上，云澤上于天。上于天則意不安，而有決潰之勢。云在天上，乃安辭也。",
  "初九，壯于前趾，往不勝，為咎。",
  "九陽爻而乾體，剛健在上之物，乃在下而居決時，壯于前進者也。前趾，謂進行，人之決於行也。行而宜，則其決為是，往而不宜，則決之過也。故往而不勝，則為咎也。夬之時而往，往決也，故以勝負言。九居初而壯於進，躁於動者也，故有不勝之戒。陰雖將盡，而已之躁動，自宜有不勝之咎，不計彼也。",
  "象曰：不勝而往，咎也。",
  "人之行，必度其事可為然後決之，則无過矣。理不能勝而且往，其咎可知。凡行而有咎者，皆決之過也。",
  "九二，惕號，莫夜有戎，勿恤。",
  "夬者陽決陰，君子決小人之時，不可忘戒備也。陽長將極之時，而二處中，居柔不為過剛，能知戒備，處夬之至善也。內懷競惕而外嚴誡號，雖莫夜有兵，亦可勿恤矣。",
  "象曰：有戎勿恤，得中道也。",
  "莫夜有兵戎，可懼之甚也，然可勿恤者，以自處之善也。既得中道又知惕懼，且有戒備，何事之足恤也。九居二雖得中，然非正，其為至善何也？曰：陽決陰，君子決小人而得中，豈有不正也。知時識勢，學易之大方也。",
  "九三，壯于頄，有凶。君子夬夬，獨行遇雨，若濡有慍，无咎。",
  "爻辭差錯，定安胡公移其文曰：「壯于頄，有凶。獨行遇雨，若濡有慍，君子夬夬，无咎。」亦未安也。當云：「壯于頄，有凶。獨行遇雨，君子夬夬，若濡有慍，无咎。」夬決，尚剛健之時，三居下體之上，又處健體之極，剛果於決者也。頄，顴骨也，在上而未極於上者也。三居下體之上，雖在上而未為最上，上有君而自任其剛決，壯于頄者也，有凶之道者也。獨行遇雨，三與上六為正應，方群陽共決一陰之時，己若以私應之，故不與眾同而獨行，則與上六陰陽和合，故云遇雨。易中言雨者，皆謂陰陽和也。君子道長，決去小人之時，而己獨與之和，其非可知，唯君子處斯時則能。夬夬，謂夬其夬，果決其斷也。雖其私與當遠決之，若見濡污有慍惡之色，如此則无過咎也。三健體而處正，非必有是失也，因此義以為教耳。爻文所以交錯者，由有遇雨字，又有濡字，故誤以為連也 。",
  "象曰：君子夬夬，終无咎也。",
  "牽梏於私好，由夬決也。君子義之與比，決於當決，故終不至有咎也。",
  "九四，臀无膚，其行次且，牽羊悔亡，聞言不信。",
  "臀无膚，居不安也。行次且，進不前也；次且，進難之狀。九四以陽居陰，剛決不足，欲止則眾陽並進於下，勢不得安，猶臀傷而居不能安也。欲行則居柔，失其剛壯，不能強進，故其行次且也。牽羊悔亡，羊者，群行之物；牽者，挽拽之義。言若能自強，而牽挽以從群行，則可以亡其悔。然既處柔，必不能也，雖使聞是言，亦必不能信用也。夫過而能改，聞善而能用，克己以從義，唯剛明者能之。在它卦九居四，其失未至如此之甚，在夬而居柔，其害大矣。",
  "象曰：其行次且，位不當也，聞言不信，聰不明也。",
  "九處陰位，不當也。以陽居柔，失其剛決，故不能強進。其行次且，剛然後能明。處柔則遷失其正性，豈復有明也。故聞言而不能信者，蓋其聰聽之不明也。",
  "九五，莧陸夬夬，中行无咎。",
  "五雖剛陽中正居尊位，然切進於上六。上六說體而卦獨一陰，陽之所比也。五為決陰之主，而反比之，其咎大矣，故必決其決，如莧陸，然則於其中行之德，為无咎也。中行，中道也。莧陸，今所謂馬齒莧是也，曝之難乾，感陰氣之多者也，而脆易折。五若如莧陸，雖感於陰而決斷之，易則於中行无過咎矣。不然，則失其中正也。感陰多之物，莧陸為易斷，故取為象。",
  "象曰：中行无咎，中未光也。",
  "卦辭言夬，夬則於中行為无咎矣。象復盡其義云，中未光也。夫人心正意誠，乃能極中正之道，而充實光輝。五心有所比，以義之不可而決之，雖行於外，不失中正之義，可以无咎，然於中道未得為光大也，蓋人心一有所欲，則離道矣。夫子於此示人之意深矣。",
  "上六，无號，終有凶。",
  "陽長將極，陰消將盡，獨一陰處窮之地，是眾君子得時，決去危極之小人也，其勢必須消盡，故云无用。號咷畏懼，終必有凶也。",
  "象曰：无號之凶，終不可長也。",
  "陽剛君子之道，進而益盛。小人之道，既已窮極，自然消亡，豈復能長久乎。雖號咷，无以為也，故云終不可長也。先儒以卦中有孚號惕，號欲以无號為无。號，作去聲，謂无用更加號令非也。一卦中適有兩去聲字，一平聲何害，而讀易者率皆疑之。或曰：聖人之於天下，雖大惡未嘗必絕之也。今直使之无號，謂必有凶，可乎？曰：夬者小人之道消亡之時也，決去小人之道，豈必盡誅之乎。使之變革，乃小人之道亡也，道亡乃其凶也。",
  " ",
  " "
]