[
  " ",
  "　 閱讀古書  2  3  4  5  6  7  8  9  10  11  12  13",
  "文字輸入：鬼鶴",
  "　需　乾下坎上（水天需）",
  "需，《序卦》：蒙者蒙也，物之穉也，物穉不可不養也，故受之以需。需者，飲食之道也。夫物之幼穉，必待養而成，養物之所需者，飲食也，故曰需者，飲食之道也。雲上於天，有蒸潤之象，飲食所以潤益於物，故需為飲食之道，所以次蒙也。卦之大意須待之義，序卦取所須之大者耳。乾健之性必進者也，乃處坎險之下。險為之阻，故須待而後進也。",
  "需：有孚，光亨，貞吉，利涉大川。",
  "需者，須待也。以二體言之，乾之剛健上進而遇險未能進也，故為需待之義。以卦才言之，五居君位，為需之主，有剛健中正之徳而誠信充實於中。中實有孚也，有孚則光明，而能亨通、得貞正而吉也。以此而需，何所不濟？雖險无難矣，故利涉大川也。凡貞吉有既正且吉者，有得正則吉者，當辯也。",
  "彖曰：需須也，險在前也，剛健而不陷其義，不困窮矣。",
  "需之義，須也。以險在於前，未可遽進，故需待而行也。以乾之剛健而能需待不輕動，故不陷於險，其義不至於困窮也。剛健之人其動必躁，乃能需待而動，處之至善者也。故夫子贊之云：｢其義不困窮矣｣。",
  "需有孚，光亨，貞吉，位乎天位以正中也。",
  "五以剛實居中，為孚之象；而得其所需，亦為有孚之義；以乾剛而至誠，故其徳光明而能亨通、得貞正而吉也。所以能然者，以居天位而得正中也。居天位指五以正中兼二言，故云正中。",
  "利涉大川，往有功也。",
  "既有孚而貞正，雖涉險阻，往則有功也。需道之至善也，以乾剛而能需，何所不利？",
  "象曰：雲上於天，需，君子以飲食宴樂。",
  "雲氣蒸而上升於天，必待陰陽和洽，然後成雨。雲上，上於天未成雨也，故為須待之義。陰陽之氣交感而未成雨澤，猶若子畜其才徳，而未施於用也。君子觀雲上於天，需而為雨之象，懷其道徳，安以待時。飲食以養其氣體，宴樂以和其心志，所謂居易以俟命也。",
  "初九：需于郊，利用恒，无咎。",
  "需者以遇險，故需而後進，初最逺於險，故為需于郊。郊，曠逺之地也。處於曠逺，利在安守其常，則无咎也。不能安常則躁動犯難，豈能需於逺而无過也？",
  "象曰：需于郊，不犯難行也。利用恒，无咎，未失常也。",
  "處曠逺者，不犯冒險難而行也。陽之為物，剛健上進者也，初能需待於曠逺之地，不犯險難而進，復宜安處不失其常，則可以无咎矣。雖不進，而志動者不能安其常也。君子之需時也，安靜自守，志雖有須而恬然，若將終身焉，乃能用常也。",
  "九二：需于沙，小有言，終吉。",
  "坎為水，水近則有沙。二去險漸近，故為需于沙。漸近於險難，雖未至於患害，已小有言矣。凡患難之辭，大小有殊，小者至於有言，言語之傷至小者也。二以剛陽之才而居柔守中，寛裕自處，需之善也。雖去險漸近而未至於險，故小有言語之傷，而无大害，終得其吉也。",
  "象曰：需于沙，衍在中也。雖小有言，以吉終也。",
  "衍，寛綽也。二雖近險，而以寛裕居中，故雖小有言語及之，終得其吉，善處者也。",
  "九三：需于泥，致冦至。",
  "泥逼於水也，既進逼於險，當致冦難之至也。三剛而不中，又居健體之上，有進動之象，故致冦也。苟非敬慎，則致喪敗矣。",
  "象曰：需于泥，災在外也。自我致冦，敬慎不敗也。",
  "三切逼上體之險難，故云災在外也。災，患難之通稱，對眚而言，則分也。三之致冦，由已進而廹之，故云｢自我冦｣。自已致，若能敬愼量宜而進，則无喪敗也。需之時，須而後進也，其義在相時而動，非戒其不得進也。直使敬慎毋失其宜耳。",
  "六四：需于血，出自穴。",
  "四以陰柔之質處於險，而下當三陽之進，傷於險難者也，故云｢需于血｣。既傷于險難，則不能安處，必失其居，故云｢出自穴｣。穴，物之所安也。順以從時，不競於險難，所以不至於凶也。以柔居陰，非能競者也，若陽居之，則必凶矣。蓋无中正之徳，徒以剛競於險，適足以致凶耳。",
  "象曰：需于血，順以聽也。",
  "四以陰柔居于險難之中，不能固處，故退出自穴。蓋陰柔不能與時競，不能處則退，是順從以聽於時，所以不至於凶也。",
  "九五：需于酒食，貞吉。",
  "五以陽剛居中得正，位乎天，位克盡其道矣。以此而需，何需不獲？故宴安酒食以俟之，所須必得也。既得貞正，而所需必遂，可謂吉矣。",
  "象曰：酒食，貞吉，以中正也。",
  "需于酒食而貞且吉者，以五得中正而盡其道也。",
  "上六：入于穴，有不速之客三人來，敬之，終吉。",
  "需以險在前，需時而後進，上六居險之終，終則變矣。在需之極，久而得矣。陰止於六，乃安其處，故為入于穴，穴所安也。安而既止，後者必至。不速之客三人，謂下之三陽，乾之三陽非在下之物，需時而進者也。需既極矣，故皆上進，不速不促之而自來也。上六既需得其安處，羣剛之來，苟不起忌疾忿競之心，至誠盡敬以待之，雖甚剛暴，豈有侵陵之理？故終吉也。或疑以陰居三陽之上，得為安乎？曰：三陽乾體，志在上進，六陰位，非所止之正，故无爭奪之意，敬之則吉也。",
  "象曰：不速之客來，敬之，終吉。雖不當位，未大失也。",
  "不當位，謂以陰而在上也。爻以六居陰，為所安象，復盡其義，明陰宜在下而居上，為不當位也。然能敬慎以自處，則陽不能陵，終得其吉。雖不當位，而未至於大失也。",
  " "
]