[
  "　閱讀古書 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17",
  "文字輸入：Joanna",
  "　震下震上",
  "震，《序卦》：｢主器者莫若長子，故受之以震。｣鼎者器也，震為長男，故取主器之義，而繼鼎之後，長子傳國家、繼位號者也，故為主器之主。《序卦》取其一義之大者，為相繼之義。震之為卦，一陽生於二陰之下。動而上者也，故為震。震，動也，不曰動者，震有動而奮發，震驚之義。乾坤之交，一索而成。震生物之長也，故為長男。其象則為雷，其義則為動；雷有震奮之象，動為驚懼之義。",
  "震，亨",
  "陽生於下而上進，有亨之義；又震為動，為恐懼，為有主。震而奮發，動而進，懼而修，由主而保大；皆可以致亨，故震有亨。",
  "震來虩虩*，笑言啞啞。",
  "當震動之來則恐懼不敢自寧，旋顧周慮，虩虩然也。虩虩，顧慮不安之貌，蠅虎謂之虩者，以其周環顧慮不自寧也。處震如是，則能保其安裕，故笑言啞啞。啞啞，笑言和適之貌。",
  "註*：虩，音｢細｣，虩虩，形容恐懼的樣子。",
  "震驚百里，不喪匕鬯*。",
  "言震動之大而處之之道。動之大者，莫若雷。震為雷，故以雷言雷之震動，驚及百里之遠，人無不懼而自失，雷聲所及百里也。唯宗廟祭祀執匕鬯者，則不至於喪失。人之致其誠敬，莫如祭祀。匕以載鼎實，升之於爼；鬯以灌地而降神，方其酌裸以求神薦牲，而祈享盡其誠敬之心。則雖雷震之威，不能使之懼而失守，故臨大震，懼能安而不自失者，唯誠敬而已。此處震之道也。卦才无取故，但言處震之道。",
  "註*：匕，音｢比｣，古時的湯匙。鬯，音｢暢｣。祭祀用之香酒，以鬱金香合黍釀造而成之酒。",
  "《彖》曰：震，亨。",
  "震來虩虩，恐致福也；笑言啞啞，後有則也。",
  "震自有亨之義，非由卦才震來而能恐懼自修自慎，則可反至福吉也。笑言啞啞，言自若也，由能恐懼而後自處有法則也。有則則安而不懼矣，處震之道也。",
  "震驚百里，驚遠而懼邇也。",
  "雷之震及於百里，遠者驚，邇者懼，言其威遠大矣。",
  "出可以守宗廟社稷，以為祭主也。",
  "《彖》文脫｢不喪匕鬯｣一句，《卦辭》云｢不喪匕鬯｣，本為誠敬之至，威懼不能使之自失。《彖》以長子宜如是，因承上文，用長子之義通解之，謂其誠敬不喪匕鬯，則君出而可以守宗廟社稷以為祭主也。長子如是，而後可以守世祀、承國家也。",
  "《象》曰：洊雷*，震，君子以恐懼修省。",
  "洊，重襲也。上下皆震，故為洊雷。雷重仍則威益盛，君子觀洊雷威震之象，以恐懼自修，飭循省也。君子畏天之威，則修正其身，思省其過咎而改之，不唯雷震，凡遇驚懼之事皆當如是。",
  "註*：洊，音｢薦｣，再次，屢次，接連，重覆的意思。",
  "初九，震來虩虩，後笑言啞啞，吉。",
  "初九，成震之主，致震者也。在卦之下，處震之初也。知震之來，當震之始，若能以為恐懼而周旋顧慮，虩虩然不敢寧止，則終必保其安吉，故後笑言啞啞也。",
  "《象》曰：震來虩虩，恐致福也，笑言啞啞，後有則也。",
  "震來而能恐懼，周顧則无患矣，是能因恐懼，而反致福也。因恐懼而自修省，不敢違於法度。是由震而後有法則，故能保其安吉，而笑言啞啞也。",
  "六二，震來厲，億喪貝*，躋於九陵**，勿逐，七日得。",
  "六二居中得正，善處震者也，而乘初九之剛。九，震之主，震剛動而上奮，孰能禦之，厲猛也，危也。彼來既猛，則己處危矣。億，度也；貝，所有之資也；躋，升也；九陵，陵之高也；逐，往追也。以震來之厲，度不能當，而必喪其所有，則升至高以避之也。九言其重，岡陵之重，高之至也。九重之多也，如九天、九地也。｢勿逐，七日得｣：二之所貴者中正也，遇震懼之來，雖量勢巽避，當守其中正，无自失也。億之必喪也，故遠避之以自守，過則復其常矣，是勿逐而自得也。逐，即物也，以己即物，失其守矣，故戒勿逐，避遠自守。處震之大方也，如二者，當危懼而善處者也。卦位有六七，乃更始，事既終，時既易也，不失其守，雖一時不能禦其來，然時過事已則復其常，故云七日得。",
  "註*：億，猜測，即臆測。貝，所擁有的財物。億喪貝：猜測將喪失自己所擁有的財物。",
  "註**：躋，音｢基｣，登高，《說文》：登也。躋於九陵，登高到高處以避難。",
  "《象》曰：震來厲，乘剛也。",
  "當震而乘剛，是以彼厲而己危。震剛之來，其可禦乎。",
  "六三，震蘇蘇，震行无眚*。",
  "蘇蘇，神氣緩散自失之狀。三以陰居陽，不正處，不正於平時且不能安，況處震乎。故其震懼而蘇蘇然，若因震懼而能行，去不正而就正，則可以无過。眚，過也。三行則至四正也，動以就正為善故。二勿逐則自得，三能行則无眚。以不正而處震懼，有眚可知。",
  "註*：眚，音省ㄕㄥˇ，古同｢省｣。《說文》：目病生翳也。又《廣韻》：過也，災也。眚，引伸爲過錯，錯誤。",
  "《象》曰：震蘇蘇，位不當也。",
  "其恐懼自失，蘇蘇然，由其所處不當故也。不中不正，其能安乎。",
  "九四，震遂泥。",
  "九四居震動之時，不中不正，處柔失剛健之道。居四无中正之德，陷溺於重陰之間，不能自震奮者也，故云｢遂泥｣。泥，滯溺也，以不正之陽而上下重陰，安能免於泥乎，遂无反之意。處震懼莫能守也，欲震動則莫能奮也，震道亡矣，豈復能光亨也。",
  "《象》曰：震遂泥，未光也。",
  "陽者剛物，震者動義，以剛處動，本有光亨之道，乃失其剛正而陷於重陰，以致遂泥，豈能光也。云未光，見陽剛本能震也，以失德故泥耳。",
  "六五，震往來厲，億无喪，有事。",
  "六五雖以陰居陽，不當位為不正，然以柔居剛又得中，乃有中德者也。不失中則不違於正矣，所以中為貴也。諸卦二五雖不當位，多以中為美。三四雖當位，或以不中為過，中常重於正也。蓋中則不違於正，正不必中也，天下之理莫善於中。於六二、六五可見，五之動，上往則柔不可居動之極，下來則犯剛，是往來皆危也。當君位，為動之主，隨宜應變，在中而已，故當億度无喪失其所有之事而已。所有之事謂中德，苟不失中，雖有危，不至於凶也。億度謂圖慮，求不失中也。五所以危，由非剛陽而无助，若以剛陽有助為動之主，則能亨矣。往來皆危，時則甚難，但期於不失中，則可自守，以柔主動，固不能致亨濟也。",
  "《象》曰：震往來厲，危行也。其事在中，大无喪也。",
  "往來皆厲，行則有危也。動皆有危，唯在无喪其事而已。其事謂中也，能不失其中，則可自守也。大无喪，以无喪為大也。",
  "上六，震索索，視矍矍*，征凶。震不于其躬，于其鄰，无咎。婚媾有言。",
  "索索，消索不存之狀，謂其志氣如是。六以陰柔居震動之極，其驚懼之甚，志氣殫索也。矍矍，不安定貌。志氣索索，則視瞻徊徨，以陰柔不中正之質，而處震動之極，故征則凶也。震之及身，乃于其躬也，不于其躬，謂未及身也。鄰者，近於身者也，能震懼於未及身之前，則不至於極矣，故得无咎。茍未至於極，尚有可改之道，震終當變柔，不固守，故有畏鄰戒而能變之義。聖人於震終，示人知懼而能改之義，為勸深矣。婚媾，所親也，謂同動者。有言，有怨咎之言也。六居震之上，始為眾動之首，今乃畏鄰戒而不敢進，與諸處震者異矣，故婚媾有言也。",
  "註*：矍，音ㄐㄩㄝˊ《說文》：｢隹欲逸走也。從又。持之矍矍也。隼欲逸走而未能。《徐曰》左右驚顧也。一曰視遽貌。｣",
  "《象》曰：震索索，中未得也。雖凶无咎，畏鄰戒也。",
  "所以恐懼自失如此，以未得於中道也，謂過中也。使之得中，則不至於索索矣。極而復征，則凶也。若能見鄰戒而知懼，變於未極之前，則无咎也。上六動之極，震極則有變義也。",
  " "
]