[
  "　 閱讀古書  2  3  4  5  6  7  8  9  10  11  12  13  14  15  16  17",
  "文字輸入：Joanna",
  "　艮下巽上",
  "漸，《序卦》：「艮者，止也。物不可以終止，故受之以漸。漸者，進也。」止必有進，屈伸消息之理也。 止之所生，亦進也，所反亦進也，漸所以次卦也。進以序為漸，今人以緩進為漸，進以序不越次，所以緩也。為卦上巽下艮，山上有木，木之高，而因山其高，有因也。其高有因，乃其進有序也，所以為漸也。",
  "漸。女歸吉，利貞。",
  "以卦才兼漸義而言也。乾坤之變為巽艮，巽艮重而為漸。 在漸體而言中，二爻交也。由二爻之交，然後男女各得正位。初終二爻雖不當位，亦陽上陰下，得尊卑之正。男女各得其正，亦得位也。與歸妹正，相對女之歸，能如是之正，則吉也。天下之事，進必以漸者，莫如女歸。臣之進於朝，人之進於事，固當有序，不以其序，則陵節犯義，凶咎隨之。然以義之輕重，廉恥之道，女之從人，最為大也。故以女歸為義。 且男女萬事之先也，諸卦多有利貞，而所施，或不同，有涉不正之疑，而為之戒者，有其事必貞，乃得其宜者。有言，所以利者，以其有貞也。所謂涉不正之疑，而為之戒者，損之九二是也。 處陰居說，故戒以宜貞也。有其事必貞，乃得宜者，大畜是也，所畜利於貞也。有言，所以利者，以其有貞者，漸是也。言女歸之，所以吉，利於如此。貞，正也。蓋其固有，非設戒也。漸之義，宜能亨，而不云亨者。蓋亨者，通達之義，非漸進之義也。",
  "《彖》曰：漸之進也，女歸吉也。",
  "如漸之義而進，乃女歸之吉也。謂正而有漸也。女歸為大耳，他進亦然。",
  "進得位，往有功也。",
  "漸進之時，而陰陽各得正位，進而有功也。四復由上進而得正位。三離下，而為上，遂得正位，亦為進而得位之義。",
  "進以正，可以正邦也。",
  "以正道而進，可以正邦國至於天下也。凡進於事，進於德，進於位，莫不皆當以正也。",
  "其位剛得中也。",
  "上云「進得位，往有功也」，統言陰陽得位是以進而有功。 復云「其位剛得中也」，所謂位者，五以剛陽中正得尊位也。諸爻之得正，亦可謂之得位矣。然未若五之得尊位，故特言之。",
  "止而巽，動不窮也。",
  "內艮止，外巽順。止為安靜之象，巽為和順之義。人之進也，若以欲心之動，則躁而不得其漸，固有困窮在漸之義。內止靜，而外巽順，故其進動，不有困窮也。",
  "《象》曰：山上有木，漸，君子以居賢德善俗。",
  "山上有木，其高有因，漸之義也。君子觀漸之象，以居賢善之德，化美於風俗。人之進於賢德，必有其漸習，而後能安，非可陵節而遽至也。在已且然，教化之於人，不以漸其能入乎﹖移風易俗，非一朝一夕所能成。故善俗必以漸也。",
  "初六，鴻漸于干，小子厲。有言，无咎。",
  "漸諸爻皆取鴻象，鴻之為物，至有時而群有序，不失其時序，乃為漸也。干，水湄。水鳥止於水之湄，水至近也。其進可謂漸矣。行而以時，乃所謂漸。漸進不失，漸得其宜矣。六居初，至下也。陰之才，至弱也。而上无應援，以此而進，常情之所憂也。 君子則深識遠照，知義理之所安，時事之所宜，處之不疑，小人、幼子，唯能見已然之事，從眾人之知，非能燭理也。故危懼而有言，蓋不知在下，所以有進也。用柔所以不躁也，无應所以能漸也。 於義自无咎也。若漸之初而用剛急進，則失漸之義，不能進，而有咎必矣。",
  "《象》曰：小子之厲，義无咎也。",
  "雖小子以為危厲，在義理實无咎也。",
  "六二，鴻漸于磐，飲食衎衎*，吉。",
  "二居中得正，上應於五，進之安裕者也。但居漸，故進不速。磐，石之安平者，江河之濱所有，象進之安，自干之磐，又漸進也。二與九五之君，以中正之道相應，其進之安固，平易莫加焉。故其飲食和樂，衎衎然，吉可知也。",
  "註*衎：音ㄎㄢˋ和樂，愉快。",
  "《象》曰：飲食衎衎，不素飽也。",
  "爻辭，以其進之安平，故取飲食和樂為言。夫子，恐後人之未喻，又釋之：云「中正君子遇中正之主，漸進于上，將行其道，以及天下。」所謂飲食衎衎，謂其得志和樂，不謂空飽飲食而已。素，空也。",
  "六三，鴻漸于陸，夫征不復，婦孕不育，凶。利禦寇。",
  "平高曰陸，平原也。三在下卦之上，進至於陸也。陽，上進者也。居漸之時，志將漸進，而上无應援，當守正以俟時。安處平地，則得漸之道，若不能自守，欲有所牽志，有所就，則失漸之道。四陰在上而密比陽，所說也。三陽在下，而相親，陰所從也。二爻相比無應，相比則相親而易合，无應則无適而相求，故為之戒。夫，陽也。夫謂三，三若不守正，而與四合，是知征而不知復。征，行也。復，反也。不復，謂不反顧義理。婦謂四，若以不正而合，則雖孕，而不育，蓋非其道也，如是則凶也。三之所利，在於禦寇。非理而至者寇也。守正以閑邪，所謂禦寇也。不能禦寇則自失而凶矣。",
  "《象》曰：夫征不復，離群醜也。婦孕不育，失其道也。利用禦寇，順相保也。",
  "夫征不復，則失漸之正，從欲而失正，離叛其羣類，為可醜也。卦之諸爻，皆无不善，若獨失正，是離其群類。婦孕，不由其道，所以不育也。所利在禦寇，謂以順道相保，君子之與小人比也，自守以正，豈唯君子自完其己而已乎。亦使小人得不陷於非義，是以順道相保，禦止其惡，故曰禦寇。",
  "六四，鴻漸於木，或得其桷*，无咎。",
  "當漸之時，四以陰柔進據剛陽之上，陽剛而上進，豈能安處陰柔之下，故四之處非安地，如鴻之進于木也。木漸高矣，而有不安之象。鴻趾連，不能握枝，故不木棲。桷，橫平之柯。唯平柯之上，乃能安處。謂四之處本危，或能自得安寧之道，則无咎也。如鴻之於木，本不安，或得平柯而處之則安也。四居正而巽順，宜无咎者也。必以得失言者，因得失以明其義也。",
  "註* 桷：音ㄐㄩㄝˊ，細木為桷。",
  "《象》曰：或得其桷，順以桷巽也。",
  "桷者，平安之處。求安之道，唯順與巽，若其義順正，其處卑巽，何處而不安。如四之順正，而巽，乃得桷也",
  "九五 鴻漸于陵，婦三歲不孕。終莫之勝，吉。",
  " 陵，高阜也。鴻之所止，最高處也。象君之位，雖得尊位，然漸之時，其道之行，固亦非遽。與二為正應，而中正之德同，乃隔於三、四，三比二，四比五，皆隔其交者也，未能即合，故三歲不孕。然中正之道，有必亨之理。不正，豈能隔害之，故終莫之能勝，但其合有漸耳，終得其吉也。以不正而敵中正，一時之為耳，久其能勝乎。",
  "《象》曰：終莫之勝，吉，得所願也。",
  "君臣以中正相交，其道當行，雖有間，其間者，終啟豈能勝哉。徐必得其所願，乃漸吉也。",
  "上九，鴻漸于陸，其羽可用為儀，吉。",
  "安定胡公以陸為逵。逵，雲路也，謂虛空之中。《爾雅》：「九達謂之逵。」逵，通達无阻蔽之義也。上九在至高之位，又益上進，是出乎位之外，在他時則為過矣。於漸之時，居巽之極，必有其序。如鴻之離所止，而飛于雲空。在人則超逸乎常事之外者也。進至於是，而不失其漸，賢達之高致也。故可用為儀法，而吉也。羽鴻之所用，進也。以其進之用，況上九，進之道也。",
  "《象》曰：其羽可用為儀，吉，不可亂也。",
  "君子之進，自下而上，由微而著。跬*步造次，莫不有序，不失其序，則无所不得其吉，故九雖窮高，而不失其吉。可用為儀法者，以其有序而不可亂也。",
  "註*跬：ㄎㄨㄟˇ，半步",
  " "
]