[
  "　 閱讀古書  2  3  4  5  6  7  8  9  10  11  12  13  14  15  16  17  18  19",
  "文字輸入：Joanna",
  " 　豐卦　離下震上",
  "豐，《序卦》：得其所歸者必大，故受之以豐。物所歸聚，必成其大，故歸妹之後，受之以豐也。豐盛，大之義。為卦震上離下，震動也，離明也。以明而動，動而能明，皆致豐之道。明足以照，動足以亨，然後能致豐大也。",
  "豐，亨，王假*之。勿憂，宜日中。",
  "豐為盛大，其義自「亨，極天下之光大者，為王者能致之」。假，至也。天位之尊，四海之富，羣生之眾，王道之大極。豐之道，其唯王者乎！豐之時，人民之繁庶，事物之殷盛，治之豈易周，為可憂慮，宜如日中之盛明，廣照无所不及，然後无憂也。",
  "註*假：音ㄍㄜˊ來到",
  "彖曰：豐，大也。明以動，故豐。",
  "豐者，盛大之義。離明而震動，明動相資，而成豐大也",
  "王假之，尚大也；",
  "王者，有四海之廣，兆民之眾，極天下之大也。故豐大之道，唯王者能致之，所有既大，其保之治之之道亦當大也，故王者之所尚，至大也。",
  "勿憂，宜日中，宜照天下也。",
  "所有既廣，所治既眾，當憂慮其不能周及。移如日中之盛明，普照天下，无所不至，則可勿憂矣。如是，然後能保其豐大。保有豐大，豈小才小知之所能也。",
  "日中則昃，月盈則食，天地盈虛，與時消息，而況于人乎？況于鬼神乎？",
  "既言豐盛之至，復言其難常，以為誡也。日中盛極，則當昃昳*；月既盈滿，則有虧缺。天地之盈虛，尚與時消息，況人與鬼神乎！盈虛謂盛衰，消息謂進退，天地之運，亦隨時進退也。鬼神，謂造化之迹，於萬物盛衰，可見其消息也。於豐盛之時，而為此誡，欲其守中，不至過盛。處豐之道，豈易也哉！",
  "註*：昃，ㄗㄜˋ太陽西斜；昳，ㄉㄧㄝˊ，日過午偏斜。",
  "《象》曰：雷電皆至，豐，君子以折獄致刑。",
  "雷電皆至，明震並行也。二體相合，故云皆至。明動相資，成豐之象。離明也，照察之象。震動也，威斷之象。折獄者，必照其情實，唯明克允致刑者，以威於姦惡，唯斷乃成。故君子，觀雷電明動之象，以折獄致刑也。噬嗑言：先王飭法。豐言：君子折獄。以明在上，而麗於威震，王者之事，故為制刑立法，以明在下，而麗於威震，君子之用，故為折獄致刑。旅：明在上，而云君子者。旅，取慎用刑，與不留獄，君子皆當然也。",
  "初九，遇其配主，雖旬，无咎，往有尚。",
  "雷電皆至，成豐之象；明動相資，致豐之道。非明，无以照；非動，无以行。相須，猶形影；相資，猶表裏。初九明之初，九四動之初，宜相須以成其用，故雖旬而相應。位則相應，用則相資，故初謂四為配主，己所配也。配雖匹稱，然就之者也。如配天，以配君子。故初於四云配者，四於初云夷也。雖旬无咎：旬，均也，天下之相應者常非均敵，如陰之應陽，柔之從剛，下之附上，敵安肯相從？唯豐之初四，其用則相資，其應則相成，故雖均是陽剛，相從而无過咎也。蓋非明，則動无所之；非動，則明无所用。相資而成用，同舟則胡越一心，共難則仇怨協力，事勢使然也。往而相從，則能成其豐，故云有尚，有可嘉尚也。在他卦則不相下，而離隙矣。",
  "《象》曰：雖旬无咎，過旬災也。",
  "聖人因時而處，宜隨事而順理。夫勢均，而不相下者，常理也。然有雖敵而相資者，則相求也，初四是也。所以雖旬而无咎也，與人同而力均者，在乎降己以相求，協力以從事。若懷先己之私，有加上之意，則患當至矣。故曰：過旬，災也。均而先已是過旬也，一求勝，則不能同矣。",
  "六二，豐其蔀*，日中見斗。往得疑疾，有孚發若，吉。",
  "明動相資，乃能成豐。二為明之主，又得中正，可謂明者也。而五在正應之地，陰柔不正，非能動者。二五雖皆陰，而在明動相資之時，居相應之地。五，才不足，既其應之，才不足資，則獨明不能成豐，既不能成豐，則喪其明功，故為豐其蔀。日中見斗：二，至明之才，以所應不足與而不能成其豐，喪其明功。无明功，則為昏暗，故云見斗。斗昏見者也。蔀，周匝之義。用障蔽之物，掩晦於明者也。斗屬陰，而主運乎象。五，以陰柔而當君位。日中盛明之時，乃見斗，猶豐大之時，乃遇柔弱之主。斗以昏見，言見斗則是明喪而暗矣。二，雖至明中正之才，所遇乃柔暗不正之君；既不能下求於己，若往求之，則反得疑猜忌疾，暗主如是也。然則如之何而可？夫君子之事上也，不得其心，則盡其至誠，以感發其志意而已。茍誠意能動，則雖昏蒙，可開也；雖柔弱，可輔也；雖不正，可正也。古人之事庸君常主，而克行其道者，己之誠意上達，而君見信之篤耳。管仲之相桓公、孔明之輔後主是也。若能以誠信，發其志意，則得行其道，乃為吉也。",
  "註*蔀：音ㄅㄨˋ，覆蓋於棚架上以遮蔽陽光的草席",
  "《象》曰：有孚發若，信以發志也。",
  "有孚發若謂：以己之孚信，感發上之心志也。茍能發，則其吉可知。雖柔暗，有可發之道也。",
  "九三，豐其沛，日中見沬*。折其右肱*，无咎。",
  "沛字，古本有作斾字者。王弼以為幡幔，則是斾也。幡幔圍蔽於內者。豐其沛，其暗更甚於蔀也。三，明體而反暗於四者，所應陰暗故也。三居明體之上，陽剛得正，本能明者也。豐之道，必明動相資而成。三應於上，上陰柔又无位，而處震之終，既終則止矣，不能動者也。他卦至終則吉，震至終則止矣。三无上之應，則不能成豐。沬星之微小，无名數者，見沬暗之甚也。豐之時，而遇上六；日中而見沬者也。右肱，人之所用，乃折矣，其无能為。可知賢智之才，遇明君則能有為於天下。上无可賴之主，則不能有為，如人之折其右肱也。人之為有所失，則有所歸咎。曰由是故，致是若欲動，而无右肱；欲為而上，无所賴則不能而已，更復何言，无所歸咎也。",
  "註*沬：音ㄇㄟˋ同「昧」，微暗",
  "註*肱：音ㄍㄨㄥ，胳膊由肘到肩的部分",
  "《象》曰：豐其沛，不可大事也；折其右肱，終不可用也。",
  "三應於上，上應而无位，陰柔无勢力，而處既終，其可共濟大事乎！既无所賴，如右肱之折，終不可用矣。",
  "九四，豐其蔀，日中見斗，遇其夷主，吉。",
  "四雖陽剛，為動之主，又得大臣之位，然以不中正，遇陰暗柔弱之主，豈能致豐大也，故為豐其蔀。蔀，周圍掩蔽之物。周圍則不大，掩蔽則不明。日中見斗：當盛明之時，反昏暗也。夷主，其等夷也，相應故謂之主。初四皆陽，而居初，是其德同，又居相應之地，故為夷主。居大臣之位，而得在下之賢，同德相輔，其助豈小也哉！故吉也。如四之才，得在下之賢，為之助，則能致豐大乎！曰在下者上有當位為之與，在上者下有賢才為之助，豈无益乎，故吉也。然至天下之豐，有君而後能也。五陰柔居尊，而震體无虛中巽順下賢之象，下雖多賢，亦將何為。蓋非陽剛中正，不能致天下之豐也。",
  "《象》曰：豐其蔀，位不當也",
  "位不當，謂以不中正，居高位，所以闇*而不能致豐。",
  "註*闇：同暗。",
  "日中見斗，幽不明也",
  "謂幽暗不能光明，君陰柔而臣不中正故也。",
  "遇其夷主，吉行也。",
  "陽剛相遇，吉之行也。下就於初，故云行。下求則為吉也。",
  "六五，來章，有慶譽，吉。",
  "五以陰柔之才，為豐之主，固不能成其豐大。若能來致在下章美之才而用之，則有福慶，至得美譽，所謂吉也。六二文明中正，章美之才也，為五者誠能致之，在位而委任之，可以致豐大之慶，名譽之美，故吉也。章美之才，主二而言，然初與三四，皆陽剛之才，五能用賢，則彙征矣。二雖陰，有文明中正之德，大賢之在下者也。五與二，雖陰陽正應，在明動相資之時，有相為用之義。五若能來章，則有慶譽而吉也。然六五无虛已下賢之義，聖人設此義以為教耳。",
  "《象》曰：六五之吉，有慶也。",
  "其所謂吉者，可以有慶福及于天下也。人君雖柔暗，若能用賢才，則可以為天下之福，唯患不能耳。",
  "上六，豐其屋，蔀其家，闚*其戶，闃其无人，三歲不覿*，凶。",
  "六，以陰柔之質而居豐之極，處動之終，其滿假躁動甚矣。處豐大之時，宜乎謙屈。而處極高，致豐大之功，在乎剛健，而體陰柔。當豐大之任，在乎得時而不當位，如上六者，處无一當，其凶可知。豐其屋，處太高也。蔀其家，居不明也。以陰柔居豐大，而在无位之地，乃高亢昏暗，自絕於人，人誰與之。故闚其戶，閴其无人也，至於三歲之久，而不知變，其凶宜矣。不覿，謂尚不見人，蓋不變也。六，居卦終，有變之義，而不能遷，是其才不能也。",
  "註*闚；音義同「窺」",
  "註*闃；音ㄑㄩˋ。靜也",
  "註*覿：音ㄉㄧˊ見也。",
  "《象》曰：豐其屋，天際翔也；闚其戶，闃其无人，自藏也。",
  "六處豐大之極，在上而自高，若飛翔於天際，謂其高大之甚。闚其戶，而无人者，雖居豐大之極，而實无位之地，以其昏暗自高大，故皆棄絕之。自藏蔽，而弗與親也。",
  " "
]