[
  " ",
  "　閱讀古書  2  3  4  5  6  7  8  9  10  11  12 13",
  "文字輸入：Joanna",
  "　渙卦 　坎下巽上",
  "渙，《序卦》：兌者說也，說而後散之，故受之以渙。說則舒散也。人之氣，憂則結聚，說則舒散，故說有散義，渙所以繼兌也。為卦，巽上坎下，風行於水上，水遇風則渙散，所以為渙也。",
  "渙，亨。王假有廟，利涉大川，利貞。",
  "渙，離散也。人之離散，由乎中。人心離，則散矣。治乎散，亦本於中。能收合人心，則散可聚也。故卦之義，皆主於中。利貞，合渙散之道，在乎正固也。",
  "彖曰：渙亨，剛來而不窮，柔得位乎外而上同。",
  "渙之能亨者，以卦才如是也。渙之成渙，由九來居二，六上居四也。剛陽之來，則不窮極於下，而處得其中。柔之往，則得正位於外，而上同於五之中。巽順於五，乃上同也。四五君臣之位，當渙而比，其義相通，同五，乃從中也。當渙之時，而守其中，則不至於離散，故能亨也。",
  "王假有廟，王乃在中也。",
  "王假有廟之義，在萃卦詳矣。天下離散之時，王者收合人心，至於有廟，乃在其中也。在中，謂求得其中，攝其心之謂也。中者，心之象。剛來而不窮，柔得位而上，同卦才之義，皆主於中也。王者拯渙之道，在得其中而已。孟子曰：「得其民有道，得其心，斯得民矣。」享帝立廟，民心所歸從也。歸人心之道，无大於此，故云，至于有廟，拯渙之道，極於此也。",
  "利涉大川，乘木有功也。",
  "治渙之道，當濟於險難。而卦，有乘木濟川之象。上巽木也，下坎水，大川也。利涉險，以濟渙也。木在水上，乘木之象。乘木，所以涉川也。涉，則有濟渙之功。卦有是義，有是象也。",
  "象曰：風行水上，渙，先王以享于帝，立廟。",
  "風行水上，有渙散之象。先王觀是象，救天下之渙散，至于享帝立廟也。收合人心，无如宗廟祭祀之報出于其心，故享帝立廟，人心之所歸也。繫人心，合離散之道，无大於此。",
  "初六，用拯馬壯，吉。",
  "六居卦之初，渙之始也。始渙而拯之，又得馬壯，所以吉也。六爻獨初，不云渙者。離散之勢，辨之宜早，方始而拯之，則不至於渙也，為教深矣。馬，人之所託也。託於壯馬，故能拯渙。馬，謂二也。二有剛中之才。初陰柔順，兩皆无應，无應則親比相求，初之柔順而託於剛中之才，以拯其渙。如得壯馬，以致遠，必有濟矣。故吉也。渙，拯於始，為力則易，時之順也。",
  "象曰：初六之吉，順也。",
  "初之所以吉者，以其能順從剛中之才也。始渙，而用拯，能順乎時也。",
  "九二，渙奔其机，悔亡。",
  "諸爻皆云渙，謂渙之時也。在渙離之時，而處險中，其有悔可知，若能奔就所安，則得悔亡也。机者，俯憑以為安者也。俯，就下也。奔急，往也。二與初雖非正應，而當渙離之時，兩皆无與，以陰陽相比相求，則相賴者也。故二目初為机，初謂二為馬，二急就於初以為安，則能亡其悔矣。初雖坎體，而不在險中也。或疑初之柔微，何足賴？蓋渙之時，合力為勝。先儒皆以五為机，非也。方渙離之時，二陽豈能同也。若能同，則成濟。渙之功當大，豈止悔亡而已。机，謂俯就也。",
  "象曰：渙奔其机，得願也。",
  "渙散之時，以合為安。二居險中，急就於初，求安也。賴之如机，而亡其悔，乃得所願也。",
  "六三，渙，其躬无悔。",
  "三在渙之時獨有應與，无渙散之悔也。然以陰柔之質，不中正之才，上居无位之地，豈能拯時之渙而及人也？止於其身，可以无悔而已。上加渙字，在渙之時，躬无渙之悔也。",
  "象曰：渙其躬，志在外也。",
  "志應於上，在外也。與上相應，故其身得免於渙，而无悔。悔亡者，本有而得亡。无悔者，本无也。",
  "六四，渙其群，元吉，渙有丘，匪夷所思。",
  "渙四五二爻義相須，故通言之，彖故曰：上同也。四巽順而居大臣之位，五剛中而正居君位，君臣合力，剛柔相濟，以拯天下之渙者也。方渙散之時，用剛則不能使其懷附，用柔則不足為之依歸。四以巽順之正道，輔剛中正之君，君臣同功，所以能濟渙也。天下渙散，而能使之群聚，可謂大善之吉也。渙有丘，匪夷所思，贊美之辭也。丘，聚之大也。方渙散，而能致其大聚，其功甚大，其事甚難，其用至妙。夷，平常也。非平常之見所能思及也，非大賢智，孰能如是。 ",
  "象曰：渙其群，元吉，光大也。",
  "稱元吉者，謂其功德光大也。元吉光大，不在五，而在四者，二爻之義通言也。於四，言其施用。於五，言其成功，君臣之分也。",
  "九五，渙汗其大號，渙王居，无咎。",
  "五與四，君臣合德，以剛中正。巽順之道，治渙得其道矣。唯在浹洽*於人心，則順從也。當使號令，洽於人心。如人身之汗，浹於四體，則信服而從矣。如是，則可以濟天下之渙，居王位為稱，而无咎。大號，大政令也，謂新民之大命，救渙之大政。再云渙者，上謂渙之時，下謂處渙如是則无咎也。在四已言元吉，五唯言稱其位也。渙之四五通言者。渙以離散為害，拯之使合也。非君臣同功合力，其能濟乎？爻義相須，時之宜也。",
  "註*浹:ㄐ一ㄚˊ濕透。洽:浸潤。浹洽:和諧；融洽",
  "象曰：王居无咎，正位也。",
  "王居，謂正位人君之尊位也。能如五之為，則居尊位為稱而无咎也。",
  "上九，渙其血，去逖出，无咎。",
  "渙之諸爻皆无繫應，亦渙離之相，惟上應於三，三居險限之極。上若下從於彼，則不能出於渙也。險，有傷害畏懼之象。故云血惕。然九以陽剛處渙之外，有出渙之象，又居巽之極，為能巽順於事理，故云：若能使其血去，其惕出，則无咎也。其者所有也。渙之時，以能合為功，獨九居渙之極，有繫而臨險，故以能出渙遠為善也。",
  "象曰：渙其血，遠害也。",
  "若如象文，為渙，其血乃與屯其膏同也。義則不然，蓋血字下，脫去字，血去惕出，謂能遠害，則无咎也。"
]