[
  "　 閱讀古書  2  3  4  5  6  7  8  9  10  11  12  13",
  "文字輸入：Joanna",
  "　未濟　坎下離上",
  "未濟，《序卦》：物不可窮也，故受之以未濟終焉。既濟矣，物之窮也。物窮而不變，則无不已之理。易者，變易而不窮也。故既濟之後，受以未濟而終焉。未濟，則未窮也。未窮，則有生生之義。為卦離上坎下，火在水上，不相為用，故為未濟。",
  "未濟，亨。小狐汔*濟，濡其尾，无攸利。",
  "未濟之時，有亨之理。而卦才，復有致亨之道，唯在慎處。狐能度水，濡尾則不能濟。其老者多疑畏，故履冰而聽，懼其陷也。小者則未能畏慎，故勇於濟，汔當為仡，壯勇之狀。書曰：仡仡勇。夫小狐，果於濟則濡其尾，而不能濟也。未濟之時，求濟之道，當至慎則能亨；若如小狐之果，則不能濟也。既不能濟，无所利矣。",
  "註*汔:ㄑ一ˋ接近，幾乎",
  "彖曰：未濟亨，柔得中也； ",
  "以卦才言也。所以能亨者，以柔得中也。五以柔居尊位，居剛而應剛，得柔之中也，剛柔得中，處未濟之時，可以亨也。",
  "小狐汔濟，未出中也； ",
  "據二而言也。二以剛陽居險中，將濟者也。又上應於五，險非可安之地。五有當從之理，故果於濟如小狐也，既果於濟，故有濡尾之患，未能出於險中也。",
  "濡其尾，无攸利，不續終也， ",
  "其進銳者，其退速。始雖勇，於濟不能繼續，而終之无所往而利也。",
  "雖不當位，剛柔應也。",
  "雖陰陽不當位，然剛柔皆相應，當未濟而有與，若能重慎，則有可濟之理。二以汔濟，故濡尾也。卦之諸爻，皆不得位，故為未濟。雜卦云；未既，男之窮也。謂三陽皆失位也。斯義也，間之成都隱者。",
  "象曰：火在水上，未濟，君子以慎辨物居方。",
  "水火不交，不相濟為用，故為未濟。火在水上，非其處也。君子觀其處不當之象，以慎處於事物，辨其所當，各居其方，謂止於其所也。",
  "初六，濡其尾，吝。",
  "六以陰柔在下，處險而應四，處險則不安其居，有應則志行於上，然已既陰柔，而四非中正之才，不能援之以濟也。獸之濟水，必揭其尾，濡則不能濟。濡其尾，言不能濟也。不度其才力而進，終不能濟，可羞吝也。",
  "象曰：濡其尾，亦不知極也。",
  "不度其才力，而進至於濡尾，是不知之極也。",
  "九二，曳其輪，貞吉。",
  "在他卦，九居二為居柔得中，无過剛之義也。於未濟，聖人深取卦象以為戒，明事上恭順之道。未濟者，君道艱難之時也。五以柔處君位，而二乃剛陽之才，而居相應之地，當用者也。剛有陵柔之義，水有勝火之象，方艱難之時，所賴者才臣耳。尤當盡恭順之道，故戒曳其輪，則得正而吉也。倒曳其輪，殺其勢，緩其進，戒用剛之過也。剛過則好犯上，而順不足。唐之郭子儀、李晟，當艱危未濟之時，能極其恭順，所以為得正，而能保其終吉也。於六五則言，其貞吉光輝，盡君道之善。於九二則戒其恭順，盡臣道之正，盡上下之道也。",
  "象曰：九二貞吉，中以行正也。",
  "九二得正而吉者，以曳輪而得中道，乃正也。",
  "六三，未濟，征凶，利涉大川。",
  "未濟，征凶，謂居險，无出險之用而行則凶也。必出險，而後可征。三以陰柔不中正之才而居險，不足以濟，未有可濟之道。出險之用而征，所以凶也。然未濟有可濟之道，險終有出險之理。上有剛陽之應，若能涉險而往從之，則濟矣。故利涉大川也。然三之陰柔，豈能出險而往，非時不可，才不能也。",
  "象曰：未濟征凶，位不當也。",
  "三征則凶者，以位不當也。謂陰柔不中正，无濟險之才也。若能涉險以從應則利矣。",
  "九四，貞吉，悔亡，震用伐鬼方，三年有賞于大國。",
  "九四陽剛，居大臣之位。上有虛中明順之主，又已出於險，未濟已過中矣，有可濟之道也。濟天下之艱難，非剛健之才不能也。九雖陽而居四，故戒以貞固則吉而悔亡，不貞則不能濟，有悔者也。震，動之極也。古人之用力之甚者，伐鬼方也，故以為義。力勤而遠伐，至于三年，然後成功，而行大國之賞，必如是乃能濟也。濟天下之道，當貞固如是。四居柔，故設此戒。",
  "象曰：貞吉悔亡，志行也。",
  "如四之才，與時合而加以貞固，則能行其志，吉而悔亡，鬼方之伐，貞之至也。",
  "六五，貞吉无悔，君子之光，有孚，吉。",
  "五文明之主，居剛而應剛，其處得中，虛其心而陽為之輔。雖以柔居尊，處之至正至善，无不足也。既得貞正，故吉而无悔。貞其固，有非戒也。以此而濟，无不濟也。五文明之主，故稱其光。君子德輝之盛而功實，稱之有孚也。上云吉，以貞也。柔而能貞德之，吉也。下云吉，以功也，既光而有孚，時可濟也。",
  "象曰：君子之光，其暉吉也。",
  "光盛則有暉。暉，光之散也。君子積充而光盛，至于有暉善之至也，故重云吉。",
  "上九，有孚于飲酒，无咎。濡其首，有孚，失是。",
  "九以剛在上，剛之極也。居明之上，明之極也。剛極而能明，則不為躁而為決。明能燭理，剛能斷義，居未濟之極。非得濟之位，无可濟之理，則當樂天順命而已。若否終，則有傾時之變也。未濟則无極，而自濟之理，故止為未濟之極。至誠安於義命而自樂，則可无咎，飲酒自樂也。不樂其處，則忿躁損穫，入於凶咎矣。若從樂而耽肆，過禮至濡其首，亦非能安其處也。有孚，自信于中也。失，是失其宜也。如是則於有孚為失也。人之處患難，知其无可奈何而放意不反省，豈安於義命者哉。",
  "象曰：飲酒濡首，亦不知節也。",
  "飲酒至於濡首，不知節之甚也。所以至如是，不能安義命也。能安，則不失其常矣。",
  " ",
  "伊川易傳卷四"
]