{
  "children": [
    {
      "type": "卦",
      "name": "泰",
      "down": "乾",
      "up": "坤",
      "lines": [
        {
          "type": "句",
          "value": "泰，小往大來，吉，亨。",
          "children": [
            {
              "type": "注",
              "text": "小謂陰，大謂陽。往，往之於外也；來，來居於內也。陽氣下降，陰氣上交也。陰陽和暢則萬物生，遂天地之泰也。以人事言之，大則君上，小則臣下，君推誠以任下，臣盡誠以事君，上下之志通，朝廷之泰也。陽爲君子，陰爲小人，君子來處於內，小人往處於外，是君子得位，小人在下，天下之泰也。泰之道，吉而且亨也，不云元吉、元亨者，時有污隆，治有小大，雖泰，豈一槩哉？言吉、亨則可包矣。"
            }
          ]
        }
      ]
    },
    {
      "type": "彖",
      "lines": [
        {
          "type": "句",
          "value": "彖曰：泰，小往大來，吉亨。則是天地交，而萬物通也。上下交，而其志同也。",
          "children": [
            {
              "type": "注",
              "text": "小往大來，陰往而陽來也。則是天地陰陽之氣相交，而萬物得遂其通泰也。在人則上下之情交通，而其志意同也。"
            }
          ]
        },
        {
          "type": "句",
          "value": "內陽而外陰，內健而外順，內君子而外小人，君子道長，小人道消也。",
          "children": [
            {
              "type": "注",
              "text": "陽來居內，陰往居外，陽進而陰退也。乾健在內，坤順在外，爲內健而外順，君子之道也。君子在內，小人在外，是君子道長，小人道消，所以爲泰也。既取陰陽交和，又取君子道長，陰陽交和乃君子之道長也。"
            }
          ]
        }
      ]
    },
    {
      "type": "大象",
      "lines": [
        {
          "type": "句",
          "value": "象曰：天地交泰，后以財成天地之道。輔相天地之宜，以左右民。 ",
          "children": [
            {
              "type": "注",
              "text": "天地交而陰陽和，則萬物茂遂，所以泰也。人君當體天地通泰之象，而以財成天地之道，輔相天地之宜，以左右生民也。財成謂體天地交泰之道，而財制成其施爲之方也。輔相天地之宜，天地通泰則萬物茂遂，人君體之而爲法制。使民用天時，因地利，輔助化育之，功成其豊美之利也。如春氣發生，萬物則爲播植之法；秋氣成實，萬物則爲收斂之法。乃輔相天地之宜，以左右輔助於民也。民之生，必賴君上爲之法制，以教率輔翼之，乃得遂其生養，是左右之也。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 1,
      "lines": [
        {
          "type": "句",
          "value": "初九：拔茅茹，以其彚。征吉。",
          "children": [
            {
              "type": "注",
              "text": "初以陽爻居下，是有剛明之才而在下者也。時之否，則君子退而窮處，時既泰，則志在上進也。君子之進，必與其朋類相牽援，如茅之根然，拔其一則牽連而起矣。茹根之相牽連者，故以爲象彚類也。賢者以其類進，同志以行其道，是以吉也。君子之進必以其類，不唯志在相先，樂於與善，實乃相賴以濟。故君子小人未有能獨立，不賴朋類之助者也。自古君子得位，則天下之賢萃於朝廷，同志恊力以成天下之泰。小人在位，則不肖者並進，然後其黨勝而天下否矣。蓋各從其類也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 1,
      "lines": [
        {
          "type": "句",
          "value": "象曰：拔茅征吉，志在外也。",
          "children": [
            {
              "type": "注",
              "text": "時將泰，則群賢皆欲上進。三陽之志欲進同也，故取茅茹彚征之象。志在外，上進也。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 2,
      "lines": [
        {
          "type": "句",
          "value": "九二：包荒，用馮河，不遐遺。朋亡，得尚于中行。",
          "children": [
            {
              "type": "注",
              "text": "二以陽剛得中，上應於五，五以柔順得中，下應於二，君臣同德。是以剛中之才為上所專任，故二雖居臣位，主治泰者也。所謂上下交而其志同也。故治泰之道，主二而言。「包荒，用馮河，不遐遺，朋亡」，四者處泰之道也。人情安肆，則政舒緩而法度廢弛，庶事无節，治之之道，必有包含荒穢之量，則其施為寛裕詳密，弊革事理，而人安之。若无含弘之度，有忿疾之心，則无深遠之慮，有暴擾之患。深弊未去，而近患已生矣，故在包荒也。用馮河，泰寧之世，人情習於久安。安於守常，惰於因循，憚於更變，非有馮河之勇，不能有為於斯時也。馮河謂其剛果足以濟深越險也。自古泰治之世，必漸至於衰替，蓋由狃習安逸因循而然。自非剛斷之君，英烈之輔，不能挺特奮發以革其弊也。故曰用馮河。或疑上云包荒則是包含寛容，此云用馮河則是奮發改革，似相反也，不知以含容之量，施剛果之用，乃聖賢之爲也。不遐遺，泰寧之時，人心狃於泰，則苟安逸而已，惡能復深思遠慮及於遐遠之事哉？治夫泰者，當周及庶事，雖遐遠不可遺，若事之微隱，賢才之在僻陋，皆遐遠者也，時泰則固遺之矣。朋亡，夫時之既泰，則人習於安，其情肆而失節，將約而正之，非絶去其朋與之私，則不能也，故云朋亡。自古立法制事，牽於人情，卒不能行者多矣。若夫禁奢侈則害於近戚，限田産則妨於貴家，如此之類，既不能斷以大公而必行，則是牽於朋比也。治泰不能朋亡，則為之難矣。治泰之道，有此四者，則能合於九二之德，故曰得尚于中行，言能配合中行之義也。尚，配也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 2,
      "lines": [
        {
          "type": "句",
          "value": "象曰：包荒，得尚于中行，以光大也。",
          "children": [
            {
              "type": "注",
              "text": "象舉包荒一句，而通解四者之義。言如此，則能配合中行之德，而其道光明顯大也。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 3,
      "lines": [
        {
          "type": "句",
          "value": "九三：无平不陂，无往不復，艱貞无咎，勿恤其孚，于食有福。",
          "children": [
            {
              "type": "注",
              "text": "三居泰之中，在諸陽之上，泰之盛也。物理如循環，在下者必升，居上者必降。泰久而必否，故於泰之盛，與陽之將進，而為之戒曰：无常安平而不險陂者，謂无常泰也。无常往而不返者，謂陰當復也。平者陂，往者復，則為否矣。當知天理之必然，方泰之時，不敢安逸，常艱危其思慮，正固其施為，如是則可以无咎。處泰之道，既能艱貞，則可常保其泰，不勞憂恤，得其所求也。不失所期為孚。如是，則於其祿食有福益也。祿食，謂福祉。善處泰者，其福可長也。蓋德善日積，則福祿日臻，德踰於祿，則雖盛而非滿。自古隆盛，未有不失道而喪敗者也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 3,
      "lines": [
        {
          "type": "句",
          "value": "象曰：无往不復，天地際也。",
          "children": [
            {
              "type": "注",
              "text": "无往不復，言天地之交際也。陽降于下必復於上，陰升于上必復于下，屈伸往來之常理也。因天地交際之道，明否泰不常之理，以為戒也。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 4,
      "lines": [
        {
          "type": "句",
          "value": "六四：翩翩，不富以其鄰，不戒以孚。",
          "children": [
            {
              "type": "注",
              "text": "六四處泰之過中，以陰在上，志在下復，上二陰亦志在趨下。翩翩，疾飛之貌，四翩翩就下，與其鄰同也。鄰，其類也，謂五與上。夫人富而其類從者，爲利也，不富而從者，其志同也。三陰皆在下之物，居上乃失其實，其志皆欲下行，故不富而相從，不待戒告而誠意相合也。夫陰陽之升降，乃時運之否、泰，或交或散，理之常也。泰既過中，則將變矣。聖人於三，尚云艱貞則有福，蓋三爲將中，知戒則可保，四已過中矣，理必變也。故專言始終反復之道，五，泰之主，則復言處泰之義。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 4,
      "lines": [
        {
          "type": "句",
          "value": "象曰：翩翩不富，皆失實也。不戒以孚，中心願也。",
          "children": [
            {
              "type": "注",
              "text": "翩翩下往之疾，不待富而鄰從者，以三陰在上，皆失其實故也。陰本在下之物，今乃居上，是失實也。不待告戒而誠意相與者，蓋其中心所願故也。理當然者，天也，衆所同者時也。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 5,
      "lines": [
        {
          "type": "句",
          "value": "六五：帝乙歸妹，以祉元吉。",
          "children": [
            {
              "type": "注",
              "text": "史謂湯為天乙，厥後有帝祖乙，亦賢王也。後又有帝乙。多士曰：自成湯至于帝乙，罔不明德恤祀。稱帝乙者，未知誰是。以爻義觀之，帝乙制王姬下嫁之禮法者也。自古帝女雖皆下嫁，至帝乙然後制爲禮法，使降其尊貴，以順從其夫也。六五以陰柔居君位，下應於九二剛明之賢，五能倚任其賢臣而順從之，如帝乙之歸妹然。降其尊而順從於陽，則以之受祉，且元吉也。元吉，大吉而盡善者也。謂成治泰之功也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 5,
      "lines": [
        {
          "type": "句",
          "value": "象曰：以祉元吉，中以行願也。",
          "children": [
            {
              "type": "注",
              "text": "所以能獲祉福且元吉者，由其以中道合而行其志願也。有中德，所以能任剛中之賢。所聽從者，皆其志願也。非其所欲，能從之乎？"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 6,
      "lines": [
        {
          "type": "句",
          "value": "上六：城復于隍，勿用師，自邑告命，貞吝。",
          "children": [
            {
              "type": "注",
              "text": "掘隍土積累以成城，如治道積累以成泰。及泰之終，將反於否，如城土頽圮，復反于隍也。上，泰之終，六以小人處之，行將否矣。勿用師，君之所以能用其衆者，上下之情通而心從也。今泰之將終，失泰之道，上下之情不通矣，民心離散不從其上，豈可用也？用之則亂。衆既不可用，方自其親近而告命之，雖使所告命者得其正，亦可羞吝。邑，所居，謂親近，大率告命必自近始。凡貞凶貞吝有二義，有貞固守此則凶吝者，有雖得正亦凶吝者，此不云貞凶而云貞吝者，將否而方告命，爲可羞吝，否不由於告命也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 6,
      "lines": [
        {
          "type": "句",
          "value": "象曰：城復于隍，其命亂也。",
          "children": [
            {
              "type": "注",
              "text": "城復于隍矣，雖其命之亂不可止也。"
            }
          ]
        }
      ]
    }
  ]
}