{
  "children": [
    {
      "type": "卦",
      "name": "大有",
      "down": "　",
      "up": "乾",
      "lines": [
        {
          "type": "句",
          "value": "大有，元亨。",
          "children": [
            {
              "type": "注",
              "text": "卦之才可以元亨也。凡卦德，有卦名自有其義者，如比吉、謙亨是也；有因其卦義便為訓戒者，如師貞丈人吉、同人于野亨是也；有以其卦才而言者，大有元亨是也。由剛健文明，應天時行，故能元亨也。"
            }
          ]
        }
      ]
    },
    {
      "type": "彖",
      "lines": [
        {
          "type": "句",
          "value": "彖曰：大有，柔得尊位，人中而上下應之，曰大有。",
          "children": [
            {
              "type": "注",
              "text": "言卦之所以為大有也。五以陰居君位，柔得尊位也，處中得大中之道也。爲諸陽所宗，上下應之也，夫居尊執柔，固衆之所歸也。而又有虛中文明大中之德，故上下同志應之，所以爲大有也。"
            }
          ]
        },
        {
          "type": "句",
          "value": "其德剛健而文明，應乎天而時行，是以元亨。",
          "children": [
            {
              "type": "注",
              "text": "卦之德，內剛健而外文明。六五之君應於乾之九二，五之性柔順而明，能順應乎二。二，乾之主也。是應乎乾也。順應乾行，順乎天時也，故曰應乎天而時行。其德如此，是以元亨也。王弼云：不大通，何由得大有乎？大有則必元亨矣，此不識卦義。離乾成大有之義，非大有之義便有元亨，由其才故得元亨。大有而不善者，與不能亨者有矣。諸卦具元亨利貞，則彖皆釋為大亨，恐疑與乾坤同也；不兼利貞則釋為元亨，盡元義也。元有大善之義。有元亨者四卦，大有、蠱、升、鼎也。唯升之彖誤隨他卦作大亨。曰：諸卦之元與乾不同，何也？曰：元之在乾爲元始之義，爲首出庶物之義；他卦則不能有此義，為善為大而已。曰：元之為大，可矣，為善，何也？曰：元者，物之先也，物之先豈有不善者乎？事成而後有敗，敗非先成者也；興而後有衰，衰固後於興也；得而後有失，非得則何以有失也。至於善惡治亂是非，天下之事莫不皆然，必善為先。故文言曰：元者，善之長也。"
            }
          ]
        }
      ]
    },
    {
      "type": "大象",
      "lines": [
        {
          "type": "句",
          "value": "象曰：火在天上，大有，君子以遏惡揚善，順天休命。",
          "children": [
            {
              "type": "注",
              "text": "火髙在天上，照見萬物之衆多，故為大有。大有繁庶之義，君子觀大有之象，以遏絶衆惡、揚明善類，以奉順天休美之命。萬物衆多則有善惡之殊，君子亨，大有之盛，當代天工治養庶類，治衆之道，在遏惡揚善而已。惡懲善勸，所以順天命而安羣生也。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 1,
      "lines": [
        {
          "type": "句",
          "value": "初九，无交害，匪咎，艱則无咎。",
          "children": [
            {
              "type": "注",
              "text": "九居大有之初，未至於盛，處甲无應與，未有驕盈之失，故无交害，末涉於害也。大凡富有鮮不有害，以子貢之賢，未能盡免，況其下者乎？匪咎，艱則无咎，言富有本匪有咎也，人因富有自為咎耳。若能享富有而知難處，則自无咎也。處富有而不能思艱兢畏，則驕侈之心生矣，所以有咎也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 1,
      "lines": [
        {
          "type": "句",
          "value": "象曰：大有初九，无交害也。",
          "children": [
            {
              "type": "注",
              "text": "在大有之初，克念艱難，則驕溢之心无由生矣，所以不交涉於害也。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 2,
      "lines": [
        {
          "type": "句",
          "value": "九二，大車以載，有攸往，无咎。",
          "children": [
            {
              "type": "注",
              "text": "九以陽剛居二，為六五之君所倚任。剛健則才勝，居柔則謙順，得中則无過，其才如此，所以能勝大有之任。如大車之材強壯，能勝載重物也。可以任重行遠，故有攸往而无咎也。大有豐盛之時，有而未極，故以二之才，可往而无咎。至於盛極，則不可以往矣。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 2,
      "lines": [
        {
          "type": "句",
          "value": "象曰：大車以載，積中不敗也。",
          "children": [
            {
              "type": "注",
              "text": "壯大之車，重積載於其中而不損。敗猶九二材力之強，能勝大有之任也。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 3,
      "lines": [
        {
          "type": "句",
          "value": "九三，公用亨于天子，小人弗克。",
          "children": [
            {
              "type": "注",
              "text": "三居下體之上，在下而居之上，諸侯人君之象也。公侯上承天子，天子居天下之尊，率土之濱，莫非王臣，在下者伺敢專其有。凡土地之富，人民之眾，皆王者之有也，此理之正也。故三當大有之時，居諸侯之位，有其富盛，必有亨通乎天子，謂以其有爲天子之有也，乃人臣之常義也。若小人處之，則專其富有以爲私，不知公以奉上之道，故曰小人弗克也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 3,
      "lines": [
        {
          "type": "句",
          "value": "象曰：公用亨于天子，小人害也。",
          "children": [
            {
              "type": "注",
              "text": "公當用亨於天子，若小人處之，則為害也。自古諸侯能守臣節忠順奉上者，則蕃養其衆以為王之屏翰，豐殖其財以待上之徵賦。若小人處之，則不知為臣奉上之道，以其為己之私，民衆財豐則反擅其富強益為不順。是小人大有則為害，又大有為小人之害也。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 4,
      "lines": [
        {
          "type": "句",
          "value": "九四，匪其彭，无咎。",
          "children": [
            {
              "type": "注",
              "text": "九四居大有之時，已過中矣，是大有之盛者也，過盛則凶咎所由生也，故處之之道，匪其彭則得无咎，謂能謙損，不處其太盛則得无咎也。四近君之高位，苟處太盛則致凶咎。彭，盛多之貌。《詩•載驅》云「汶水湯湯，行人彭彭」，行人盛多之狀。《雅•大明》云「駟騵彭彭」，言武王戎馬之盛也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 4,
      "lines": [
        {
          "type": "句",
          "value": "象曰：匪其彭，无咎，明辨晳也。",
          "children": [
            {
              "type": "注",
              "text": "能不處其盛而得无咎者，蓋有明辨之智也。晳，明智也。賢智之人，明辨物理，當其方盛則知咎之將至，故能損抑不敢至於滿極也。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 5,
      "lines": [
        {
          "type": "句",
          "value": "六五，厥孚交如，威如，吉。",
          "children": [
            {
              "type": "注",
              "text": "六五當大有之時居君位，虛中爲孚信之象。人君執柔守中，而以孚信接於下，則下亦盡其信誠以事於上。上下孚信相交也。以柔居尊位，當大有之時，人心安易，若專尚柔順，則陵慢生矣，故必威如則吉。威如，有威嚴之謂也。既以柔和孚信接於下，衆志說從，又有威嚴使之有畏，善處有者也，吉可知矣。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 5,
      "lines": [
        {
          "type": "句",
          "value": "象曰：厥孚交如，信以發志也。威如之吉，易而无備也。",
          "children": [
            {
              "type": "注",
              "text": "下之志，從乎上者也。上以孚信接於下，則下亦以誠信事其上，故厥孚交如。由上有孚信以發其下，孚信之志，下之從上，猶響之應聲也。威如之所以吉者，謂若无威嚴則下易慢而无戒備也，謂无恭畏備上之道。備，謂備上之求責也。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 6,
      "lines": [
        {
          "type": "句",
          "value": "上九，自天祐之，吉，无不利。",
          "children": [
            {
              "type": "注",
              "text": "上九在卦之終，居五位之地，是大有之極，而不居其有者也。處離之上，明之極也。唯至明所以不居其有，不至於過極也。有極而不處，則无盈滿之災，能順乎理者也。五之孚信而履其上，為蹈履誠信之義。五有文明之德，上能降志以應之，爲尚賢崇善之義。其處如此，合道之至也，自當享其福慶，自天佑之。行順乎天而獲天祐，故所往皆吉，无所不利也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 6,
      "lines": [
        {
          "type": "句",
          "value": "象曰：大有上吉，自天祐也。",
          "children": [
            {
              "type": "注",
              "text": "大有之上，有極當變，由其所爲順天合道，故天祐助之，所以吉也。君子滿而不溢，乃天祐也。繫辭復申之云：天之所助者，順也；人之所助者，信也。履信思乎順，又以尚賢也，是以自天祐之，吉无不利也。履信，謂履五，五虛中，信也；思順，謂謙退不居；尚賢，謂志從於五。大有之世不可以盈豐，而復處盈焉，非所宜也。六爻之中，皆樂據權位，唯初、上不處其位，故初九无咎，上九无不利。上九在上，履信思順，故在上而得吉，蓋自天祐也。"
            }
          ]
        }
      ]
    }
  ]
}