{
  "children": [
    {
      "type": "卦",
      "name": "頤",
      "down": "震",
      "up": "艮",
      "lines": [
        {
          "type": "卦名",
          "value": "　頤　震下艮上",
          "children": [
            {
              "type": "注",
              "text": "頤，《序卦》：「物畜然後可養，故受之以頤。」夫物既畜聚，則必有以養之，无養則不能存息，頤所以次大畜也。卦上艮下震，上下二陽爻中含四陰，上止而下動，外實而中虛，人頤頷之象也。頤，養也。人口之所以飲食養人之身，故名為頤。聖人設卦推養之義，大至於天地養育萬物，聖人養賢以及萬民，與人之養生養形養德養人，皆頤養之道也。動息節宣以養生也，飲食衣服以養形也，威儀行義以養德也，推己及人以養人也。"
            }
          ]
        },
        {
          "type": "句",
          "value": "頤，貞吉，觀頤，自求口實。",
          "children": [
            {
              "type": "注",
              "text": "頤之道以正則吉也。人之養身養德養人、養於人，皆以正道則吉也。天地造化養育萬物，各得其宜者，亦正而已矣。觀頤自求口實，觀人之所頤與其自求口實之道，則善惡吉凶可見矣。"
            }
          ]
        }
      ]
    },
    {
      "type": "彖",
      "lines": [
        {
          "type": "句",
          "value": "《彖》曰：頤，貞吉，養正則吉也。觀頤，觀其所養也；自求口實，觀其自養也。",
          "children": [
            {
              "type": "注",
              "text": "貞吉，所養者正則吉也。所養謂所養之人與養之之道。自求口實謂其自求養身之道，皆以正則吉也。"
            }
          ]
        },
        {
          "type": "句",
          "value": "天地養萬物，聖人養賢以及萬民，頤之時大矣哉。",
          "children": [
            {
              "type": "注",
              "text": "聖人極言頤之道而贊其大，天地之道則養育萬物，養育萬物之道正而已矣。聖人則養賢才與之共天位，使之食天祿，俾施澤於天下，養賢以及萬民也。養賢所以養萬民也。夫天地之中，品物之眾，非養則不生，聖人裁成天地之道，輔相天地之宜以養天下，至於鳥獸草木，皆有養之之政，其道配天地，故夫子推頤之道，贊天地與聖人之功，曰頤之時大矣哉。或云義，或云用，或止云時，以其大者也。萬物之生與養，時為大，故云時。"
            }
          ]
        }
      ]
    },
    {
      "type": "大象",
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：山下有雷，頤，君子以慎言語，節飲食。",
          "children": [
            {
              "type": "注",
              "text": "以二體言之，山下有雷，雷震於山下，山之生物皆動，其根荄發其萌芽，為養之象。以上下之義言之，艮止而震動，上止下動，頤頷之象。以卦形言之，上下二陽中含四陰，外實中虛，頤口之象。口所以養身也，故君子觀其象以養其身，慎言語以養其德，節飲食以養其體，不唯就口取養義。事之至近而所繫至大者，莫過於言語飲食也。在身為言語，於天下則凡命令政教出於身者皆是，慎之則必當而无失。在身為飲食於天下，則凡貨資財用養於人者，皆是節之則適宜而无傷，推養之道，養德養天下莫不然也。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 1,
      "lines": [
        {
          "type": "句",
          "value": "初九，舍爾靈龜，觀我朵頤，凶。",
          "children": [
            {
              "type": "注",
              "text": "蒙之初六，蒙者也，爻乃主發蒙而言。頤之初九亦假外而言爾，謂初也，舍爾之靈龜，乃觀我而朵頤，我對爾而設，初之所以朵頤者，四也。然非四謂之也。假設之辭爾。九陽體剛明，其才智足以養正者也。龜能咽息不食，靈龜喻其明智而可以不求養於外也。才雖如是，然以陽居動體而在頤之時，求頤人所欲也。上應於四，不能自守，志在上行，說所欲而朵頤者也。心既動，則其自失必矣。迷欲而失己，以陽而從陰，則何所不至，是以凶也。朵頤為朵動其頤頷，又人見食而欲之，則動頤垂涎，故以為象。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 1,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：觀我朵頤，亦不足貴也。",
          "children": [
            {
              "type": "注",
              "text": "九動體，朵頤謂其說陰而志動，既為欲所動，則雖有剛健明智之才，終必自失，故其才亦不足貴也。人之貴乎剛者，為其能立而不屈於欲也。貴乎明者，為其能照而不失於正也。既惑所欲而失其正，何剛明之有為可賤也。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 2,
      "lines": [
        {
          "type": "句",
          "value": "六二，顛頤，拂經于丘，頤，征凶。",
          "children": [
            {
              "type": "注",
              "text": "女不能自處，必從男。陰不能獨立，必從陽。二陰柔不能自養，待養於人者也。天子養天下諸侯，養一國臣，食君上之祿，民賴司牧之養，皆以上養下，理之正也。二既不能自養，必求養於剛陽，若反下求於初，則為顛倒，故云顛頤。顛則拂違經常，不可行也。若求養於丘，則往必有凶。丘在外而高之物，謂上九也。卦止二陽，既不可顛頤于初，若求頤於上九，往則有凶。在頤之時，相應則相養者也。上非其應而往求養，非道妄動，是以凶也。顛頤則拂經不獲其養爾，妄求於上，往則得凶也。今有人，才不足以自養，見在上者勢力足以養人，非其族類，妄往求之，取辱得凶必矣。六二中正，在他卦多吉，而凶何也？曰：時然也。陰柔既不足以自養，初上二爻皆非其與，故往求則悖理而得凶也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 2,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：六二征凶，行失類也。",
          "children": [
            {
              "type": "注",
              "text": "征而從上則凶者，非其類故也。往求而失其類，得凶宜矣。行，往也。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 3,
      "lines": [
        {
          "type": "句",
          "value": "六三，拂頤，貞凶。十年勿用，无攸利。",
          "children": [
            {
              "type": "注",
              "text": "頤之道，唯正則吉。三以陰柔之質而處不中正，又在動之極，是柔邪不正而動者也。其養如此，拂違於頤之正道，是以凶也。得頤之正，則所養皆吉，求養、養人則合於義，自養則成其德。三乃拂違正道，故戒以十年勿用。十，數之終，謂終不可用，无所往而利也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 3,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：十年勿用，道大悖也。",
          "children": [
            {
              "type": "注",
              "text": "所以戒終不可用，以其所由之道大悖義理也。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 4,
      "lines": [
        {
          "type": "句",
          "value": "六四，顛頤，吉，虎視眈眈，其欲逐逐，无咎。",
          "children": [
            {
              "type": "注",
              "text": "四在人上，大臣之位。六以陰居之，陰柔不足以自養，況養天下乎。初九以剛陽居下，在下之賢也。與四為應，四又柔順而正，是能順於初，賴初之養也。以上養下，則為順，今反求下之養，顛倒也，故曰顛頤。然己不勝其任，求在下之賢而順從之，以濟其事，則天下得其養而已。无曠敗之咎，故為吉也。夫居上位者，必有才德威望，為下民所尊畏，則事行而眾心服從，若或下易其上，則政出而人違，刑施而怨起，輊於陵犯亂之由也。六四雖能順從剛陽，不廢厥職，然質本陰柔，賴人以濟，人之所輕，故必養其威嚴，耽耽然如虎視，則能重其體貌，下不敢易。又從於人者必有常，若間或无繼，則其政敗矣。其欲謂所須用者，必逐逐相繼而不乏，則其事可濟。若取於人而无繼，則困窮矣。既有威嚴，又所施不窮，故能无咎也。二顛頤則拂經，四則吉，何也？曰：二在上而反求養於下，下非其所應類，故為拂經。四則居上位，以貴下賤，使在下之賢由己以行其道，上下之志相應而施於民，何吉如之。自三以下，養口體者也。四以上，養德義者也。以君而資養於臣，以上位而賴養於下，皆養德也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 4,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：顛頤之吉，上施光也。",
          "children": [
            {
              "type": "注",
              "text": "顛倒求養而所以吉者，蓋得到剛陽之應，以濟其事，致己居上之德，施光明被于天下，吉孰大焉。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 5,
      "lines": [
        {
          "type": "句",
          "value": "六五，拂經，居貞吉，不可涉大川。",
          "children": [
            {
              "type": "注",
              "text": "六五，頤之時，居君位，養天下者也。然其陰柔之質，才不足以養天下，上有剛陽之賢，故順從之，賴其養己以濟天下。君者養人者也，反賴人之養，是違拂於經常。既以己之不足而順從於賢師傅。上師傅之位也，必居守貞固，篤於委信，則能輔翼其身，澤及天下，故吉也。陰柔之質，无貞剛之性，故戒以能居貞則吉。以陰柔之才，雖倚賴剛賢，能持循於平時，不可處艱難變故之際，故云不可涉大川也。以成王之才，不至甚柔弱也。當管蔡之亂，幾不保於周公，況其下者乎。故書曰：王亦未敢誚公，賴二公得終信，故艱險之際，非剛明之主，不可恃也，不得已而濟艱險者，則有矣。發此義者，所以深戒於為君也。於上九則據為臣，致身盡忠之道言，故不同也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 5,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：居貞之吉，順以從上也。",
          "children": [
            {
              "type": "注",
              "text": "居貞之吉者，謂能堅固順從於上九之賢，以養天下也。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 6,
      "lines": [
        {
          "type": "句",
          "value": "上九，由頤，厲吉，利涉大川。",
          "children": [
            {
              "type": "注",
              "text": "上九以剛陽之德居師傅之任，六五之君柔順而從於己，賴己之養，是當天下之任，天下由之以養也。以人臣而當是任，必常懷危厲則吉也。如伊尹周公，何嘗不憂勤競畏，故得終吉。夫以君之才不足而倚賴於己身，當天下大任，宜竭其才力，濟天下之艱危，成天下之治安，故曰利涉大川。得君如此之專，受任如此之重，茍不濟天下艱危，何足稱委遇而謂之賢乎。當盡誠竭力而不顧慮，然惕厲則不可忘也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 6,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：由頤厲吉，大有慶也。",
          "children": [
            {
              "type": "注",
              "text": "若上九之當大任如是，能競畏如是，天下被其德澤，時大有福慶也。"
            }
          ]
        }
      ]
    }
  ]
}