{
  "children": [
    {
      "type": "卦",
      "name": "坎",
      "down": "坎",
      "up": "坎",
      "lines": [
        {
          "type": "句",
          "value": "習坎，有孚，維心亨，行有尚。",
          "children": [
            {
              "type": "注",
              "text": "陽實在中，為中有孚信。維心亨，維其心誠一，故能亨通。至誠可以通金石，蹈水火，何險難之不可亨也。行有尚，謂以誠一而行，則能出險，有可嘉尚，謂有功也。不行則常在險中矣。"
            }
          ]
        }
      ]
    },
    {
      "type": "彖",
      "lines": [
        {
          "type": "句",
          "value": "彖曰：習坎，重險也。"
        },
        {
          "type": "句",
          "value": "水流而不盈，行險而不失其信。",
          "children": [
            {
              "type": "注",
              "text": "習坎者，謂重險也。上下皆坎，兩險相重也。初六云：坎窞，是坎中之坎，重險也。水流而不盈，陽動於險中而未出於險，乃水性之流行而未盈於坎，既盈則出乎坎矣。行險而不失其信，陽剛中實，居險之中，行險而不失其信者也。坎中實，水就下，皆為信義，有孚也。"
            }
          ]
        },
        {
          "type": "句",
          "value": "維心亨，乃以剛中也。",
          "children": [
            {
              "type": "注",
              "text": "維心可以亨通者，乃以其剛中也。中實為有孚之象，至誠之道，何所不通。以剛中之道而行，則可以濟險難而亨通也。"
            }
          ]
        },
        {
          "type": "句",
          "value": "行有尚，往有功也。",
          "children": [
            {
              "type": "注",
              "text": "以其剛中之才而往則有功，故可嘉尚。若止而不行，則常在險中矣。坎以能行為功。"
            }
          ]
        },
        {
          "type": "句",
          "value": "天險不可升也，地險山川丘陵也，王公設險以守其國，險之時用大矣哉。",
          "children": [
            {
              "type": "注",
              "text": "高不可升者，天之險也。山川丘陵，地之險也。王公君人者，觀坎之象知險之不可陵也，故設為城郭溝池之險，以守其國，保其民人，是有用險之時，其用甚大，故贊其大矣哉。山河城池，設險之大端也，若夫尊卑之辨，貴賤之分，明等威異物采，凡所以杜絕陵僭限隔上下者，皆體險之用也。"
            }
          ]
        }
      ]
    },
    {
      "type": "大象",
      "lines": [
        {
          "type": "句",
          "value": "象曰：水洊至，習坎。君子以常德行，習教事。",
          "children": [
            {
              "type": "注",
              "text": "坎為水，水流仍洊而至，兩坎相習，水流仍洊之象也。水自涓滴至于尋丈，至于江海，洊習而不驟者也，其因勢就下，信而有常，故君子觀坎水之象，取其有常，則常久其德，行人之德行，不常則偽也。故當如水之有常，取其洊習相受，則以習熟其教令之事，夫發政行教，必使民熟於聞聽，然後能從，故三令五申之，若驟告未喻，遽責其從，雖嚴刑以驅之，不能也。故當如水之洊習。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 1,
      "lines": [
        {
          "type": "句",
          "value": "初六，習坎，入于坎窞，凶。",
          "children": [
            {
              "type": "注",
              "text": "初以陰柔居坎險之下，柔弱无援而處不得當，非能出乎險也。唯益陷於深險耳。窞，坎中之陷處，已在習坎中，更入坎窞，其凶可知。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 1,
      "lines": [
        {
          "type": "句",
          "value": "象曰：習坎入坎，失道凶也。",
          "children": [
            {
              "type": "注",
              "text": "由習坎而更入坎窞，失道也，是以凶。能出於險乃不失道也。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 2,
      "lines": [
        {
          "type": "句",
          "value": "九二，坎，有險，求小得。",
          "children": [
            {
              "type": "注",
              "text": "二當坎險之時，陷上下二陰之中，乃至險之地，是有險也。然其剛中之才，雖未能出乎險中，亦可小自濟，不至如初，益陷入于深險，是所求小得也。君子處險難而自能保者，剛中而已。剛則才足自衛，中則動不失宜。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 2,
      "lines": [
        {
          "type": "句",
          "value": "象曰：求小得，未出中也。",
          "children": [
            {
              "type": "注",
              "text": "方為二陰所陷，在險之地，以剛中之才，不至陷于深險，是所求小得。然未能出坎中之險也。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 3,
      "lines": [
        {
          "type": "句",
          "value": "六三，來之坎坎，險且枕，入于坎窞，勿用。",
          "children": [
            {
              "type": "注",
              "text": "六三在坎陷之時，以陰柔而居不中正，其處不善，進退與居皆不可者也。來下則入于險之中，之上則重險也。退來與進之皆險，故云來之坎坎。既進退皆險，而居亦險。枕謂支倚。居險而支倚以處，不安之甚也。所處如此，唯益入於深險耳。故云：入于坎窞。如三所處之道，不可用也，故戒勿用。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 3,
      "lines": [
        {
          "type": "句",
          "value": "象曰：來之坎坎，終无功也。",
          "children": [
            {
              "type": "注",
              "text": "進退皆險，處又不安，若用此道，當益入于險，終豈能有功乎。以陰柔處不中正，雖平易之地，尚致悔咎，況處險乎。險者，人之所欲出也，必得其道乃能去之，求去而失其道，益困窮耳。故聖人戒，如三所處不可用也。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 4,
      "lines": [
        {
          "type": "句",
          "value": "六四，樽酒，簋貳，用缶，納約自牖，終无咎。",
          "children": [
            {
              "type": "注",
              "text": "六四陰柔而下无助，非能濟天下之險者。以其在高位，故言為臣。處險之大臣，當險難之時，唯至誠見信於君，其交固而不可間，又能開明君心，則可保无咎矣。夫欲上之篤信，唯當盡其質實而已。多儀而尚飾，莫如燕享之禮，故以燕享喻之，言當不尚浮飾，唯以質實所用。一樽之酒，二簋之食，復以瓦缶為器，質之至也。其質實如此，又須納約自牖。納約謂進結於君之道。牖開通之義。室之暗也，故設牖所以通明。自牖，言自通明之處，以況君心所明處。詩云：天之牖民，如壎如篪。毛公訓牖為道，亦開通之謂。人臣以忠信善道結於君心，必自其所明處，乃能入也。人心有所蔽，有所通。所蔽者暗處也，所通者明處也，當就其明處而告之，求信則易也。故云：納約自牖，能如是則雖艱險之時，終得无咎也。且如君心，蔽於荒樂，唯其蔽也。故爾雖力詆其荒樂之非，如其不省，何必於所不蔽之事，推而及之則能悟其心矣。自古能諫其君者，未有不因其所明者也。故訐直強勁者，率多取忤而溫厚明辯者，其說多行且如漢祖愛戚姬將易太子，是其所蔽也，群臣爭之者眾矣，嫡庶之義，長幼之序，非不明也，如其蔽而不察，何四老者高祖素知其賢而重之，此其不蔽之明心也，故因其所明而及其事則悟之如反手，且四老人之力孰與，張良群公卿及天下之士，其言之切，孰與周昌叔孫通，然而不從彼而從此者ˊ，由攻其蔽與，就其明之畢耳。又如趙王，太后愛其少子，長安君不肯使質於齊，此其蔽於私愛也。大臣諫之雖強，既曰蔽矣，其能聽乎，愛其子而欲使之長久富貴者，其心之所明也，故左師觸龍因其明而導之以長久之計，故其聽也如響，非惟告於君者，如此為教者亦然。夫教必就人之所長，所長者心之所明也，從其心之所明而入，然後推及其餘。孟子所謂成德達才是也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 4,
      "lines": [
        {
          "type": "句",
          "value": "象曰：樽酒簋貳，剛柔際也。",
          "children": [
            {
              "type": "注",
              "text": "象只舉首句，如此比多矣。樽酒簋貳，質實之至，剛柔相際，接之道能如此，則可終保无咎。君臣之交能固而常者，在誠實而已，剛柔指四與五，謂君臣之交際也。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 5,
      "lines": [
        {
          "type": "句",
          "value": "九五，坎不盈，祗既平，无咎。",
          "children": [
            {
              "type": "注",
              "text": "九五在坎之中，是不盈也。盈則平而出矣。祗宜音柢，抵也。復卦云：元祗悔，必抵於已平則无咎，既曰不盈，則時未平而尚在險中，未得无咎也，以九五剛中之才居尊位，宜可以濟於險，然下无助也。二陷於險中，未能出餘，皆陰柔无濟險之才，人君雖才，安能獨濟天下之險，居君位而不能致天下，出於險則為有咎，比祗既平乃得无咎。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 5,
      "lines": [
        {
          "type": "句",
          "value": "象曰：坎不盈，中未大也。",
          "children": [
            {
              "type": "注",
              "text": "九五剛中之才而得尊位，當濟天下之險難，而坎尚不盈，乃未能平乎險難，是其剛中之道未光大也。險難之時，非君臣協力，其能濟乎，五之道未大，以无臣也。人君之道不能濟天下之險難，則為未大，不稱其位也。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 6,
      "lines": [
        {
          "type": "句",
          "value": "上六，繫用黴纆，寘于叢棘，三歲不得，凶。",
          "children": [
            {
              "type": "注",
              "text": "上六以陰柔而居險之極，具陷之深者也，以其陷之深，取牢獄為喻，如繫縛之以徽纆，因寘于叢棘之中，陰柔而陷之深，其不能出矣。故云至于三歲之久，不得免也，其凶可知。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 6,
      "lines": [
        {
          "type": "句",
          "value": "象曰：上六失道，凶三歲也。",
          "children": [
            {
              "type": "注",
              "text": "以陰柔而自處極險之地，是其失道也，故其凶至於三歲也。三歲之久而不得免焉，終凶之辭也。言久有曰十，有曰三，隨其事也。陷于獄至于三歲，久之極也。他卦以年數言者，亦各以其事也。如三歲不興，十年乃字是也。"
            }
          ]
        }
      ]
    }
  ]
}