{
  "children": [
    {
      "type": "卦",
      "name": "咸",
      "down": "艮",
      "up": "兌",
      "lines": [
        {
          "type": "卦名",
          "value": "　咸　艮下兌上",
          "children": [
            {
              "type": "注",
              "text": "咸，《序卦》：｢有天地然後有萬物，有萬物然後有男女，有男女然後有夫婦，有夫婦然後有父子，有父子然後有君臣，有君臣然後有上下，有上下然後禮義有所錯。｣天地萬物之本，夫婦人倫之始，所以上經首乾坤，下經首咸，繼以恒也。天地二物，故二卦分為天地之道。男女交合而成夫婦，故咸與恒皆二體合為夫婦之義。咸，感也，以說為主；恒，常也，以正為本。而說之道自有正也，正之道固有說焉，巽而動，剛柔皆應，說也。咸之為卦，兌上艮下，少女少男也。男女相感之深，莫如少者，故二少為咸也。艮體篤實，止為誠愨之義。男志篤實以下交，女心說而上應，男感之先也。男先以誠感，則女說而應也。"
            }
          ]
        },
        {
          "type": "句",
          "value": "咸，亨，利貞，取女吉。",
          "children": [
            {
              "type": "注",
              "text": "咸，感也。不曰感者，咸有皆義，男女交相感也。物之相感，莫如男女，而少復甚焉。凡君臣上下，以至萬物，皆有相感之道。物之相感，則有亨通之理。君臣能相感，則君臣之道通；上下能相感，則上下之志通；以至父子、夫婦、親戚、朋友，皆情意相感，則和順而亨通。事物皆然，故咸有亨之理也。利貞，相感之道利在於正也。不以正，則入於惡矣，如夫婦之以淫姣，君臣之以媚說，上下之以邪僻，皆相感之不以正也。取女吉，以卦才言也。卦有柔上剛下，二氣感應，相與止而說，男下女之義。以此義取女，則得正而吉也。"
            }
          ]
        }
      ]
    },
    {
      "type": "彖",
      "lines": [
        {
          "type": "句",
          "value": "《彖》曰：咸，感也。"
        },
        {
          "type": "句",
          "value": "柔上而剛下，二氣感應，以相與止而說，男下女，是以亨利貞，取女吉也。",
          "children": [
            {
              "type": "注",
              "text": "咸之義感也，在卦則柔爻上而剛爻下，柔上變剛而成兌，剛下變柔而成艮，陰陽相交，為男女交感之義。又兌女在上，艮男居下，亦柔上剛下也。陰陽二氣，相感相應而和合，是相與也。止而說，止於說，為堅愨之意。艮止於下，篤誠相下也；兌說於上，和說相應也。以男下女，和之至也。相感之道如此，是以能亨通而得正，取女如是則吉也。卦才如此，大率感道利於正也。"
            }
          ]
        },
        {
          "type": "句",
          "value": "天地感而萬物化生，聖人感人心而天下和平。觀其所感，而天地萬物之情可見矣。",
          "children": [
            {
              "type": "注",
              "text": "既言男女相感之義，復推極感道，以盡天地之理、聖人之用。天地二氣交感而化生萬物，聖人至誠以感億兆之心而天下和平。天下之心所以和平，由聖人感之也。觀天地交感化生萬物之理，與聖人感人心致和平之道，則天地萬物之情可見矣。感通之理，知道者默而觀之可也。"
            }
          ]
        }
      ]
    },
    {
      "type": "大象",
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：山下有澤，咸，君子以虛受人。",
          "children": [
            {
              "type": "注",
              "text": "澤性潤下，土性受潤，澤在山上而其漸潤通徹，是二物之氣相感通也。君子觀山澤通氣之象，而虛其中以受於人。夫人中虛則能受，實則不能入矣。虛中者，无我也。中无私主，則无感不通。以量而容之，擇合而受之，非聖人有感必通之道也。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 1,
      "lines": [
        {
          "type": "句",
          "value": "初六，咸其拇。",
          "children": [
            {
              "type": "注",
              "text": "初六在下卦之下，與四相感。以微處初，其感未深，豈能動於人？故如人拇之動，未足以進也。拇，足大指。人之相感，有淺深輕重之異，識其時勢，則所處不失其宜矣。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 1,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：咸其拇，志在外也。",
          "children": [
            {
              "type": "注",
              "text": "初志之動，感於四也，故曰在外。志雖動而感未深，如拇之動，未足以進也。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 2,
      "lines": [
        {
          "type": "句",
          "value": "六二，咸其腓，凶，居吉。",
          "children": [
            {
              "type": "注",
              "text": "二以陰居下，與五為應，故設咸腓之戒。腓，足肚，行則先動，足乃舉之，非如腓之自動也。二若不守道，待上之求，而如腓自動，則躁妄自失，所以凶也。安其居而不動，以待上之求，則得進退之道而吉也。二，中正之人，以其在咸而應五，故為此戒。復云居吉，若安其分，不自動，則吉也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 2,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：雖凶，居吉，順不害也。",
          "children": [
            {
              "type": "注",
              "text": "二居中得正，所應又中正，其才本善，以其在咸之時，質柔而上應，故戒以先動求君則凶，居以自守則吉。象復明之云：非戒之不得相感，唯順理則不害，謂守道不先動也。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 3,
      "lines": [
        {
          "type": "句",
          "value": "九三，咸其股，執其隨，往吝。",
          "children": [
            {
              "type": "注",
              "text": "九三以陽居剛，有剛陽之才，而為主於內，居下之上，是宜自得於正道，以感於物，而乃應於上六。陽好上而說，陰上居感說之極，故三感而從之。股者在身之下，足之上，不能自由，隨身而動者也，故以為象，言九三不能自主，隨物而動，如股然，其所執守者隨於物也。剛陽之才，感於所說而隨之，如此而往，可羞吝也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 3,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：咸其股，亦不處也；志在隨人，所執下也。",
          "children": [
            {
              "type": "注",
              "text": "云亦者，蓋《象》辭本不與易相比，自作一處，故諸爻之《象》辭，意有相續者。此言亦者，承上爻辭也。上云｢咸其拇，志在外也，雖凶居吉，順不害也｣，咸其股，亦不處也。前二陰爻皆有感而動，三雖陽爻亦然，故云｢亦不處也｣。不處謂動也。有剛陽之質，而不能自主，志反在於隨人，是所操執者卑下之甚也。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 4,
      "lines": [
        {
          "type": "句",
          "value": "九四，貞吉，悔亡。憧憧往來，朋從爾思。",
          "children": [
            {
              "type": "注",
              "text": "感者，人之動也，故皆就人身取象。拇取在下而動之微，腓取先動，股取其隨。九四无所取，直言感之道，不言咸其心，感乃心也。四在中而居上，當心之位，故為感之主，而言感之道。貞正則吉而悔亡，感不以正，則有悔也。又四說體，居陰而應初，故戒於貞感之道，无所不通，有所私係，則害於感通，乃有悔也。聖人感天下之心，如寒暑雨暘，无不通，无不應者，亦貞而已矣。貞者，虛中无我之謂也。憧憧往來，朋從爾思，夫貞一則所感无不通，若往來憧憧然，用其私心以感物，則思之所及者有能感而動，所不及者不能感也，是其朋類則從其思也，以有係之私心，既主於一隅一事，豈能廓然无所不通乎？《繫辭》曰：｢天下何思何慮？天下同歸而殊途，一致而百慮，天下何思何慮？｣夫子因咸極論感通之道。夫以思慮之私心感物，所感狹矣。天下之理一也，塗雖殊而其歸則同，慮雖百而其致則一。雖物有萬殊，事有萬變，統之以一，則无能違也。故貞其意，則窮天下无不感通焉，故曰｢天下何思何慮｣。用其思慮之私心，豈能无所不感也？日往則月來，月往則日來，日月相推而明生焉。寒往則暑來，暑往則寒來，寒暑相推而歲成焉。往者屈也，來者信也，屈信相感而利生焉。此以往來屈信明感應之理。屈則有信，信則有屈，所謂感應也。故日月相推而明生，寒暑相推而歲成，功用由是而成，故曰屈信相感而利生焉。感，動也，有感必有應。凡有動皆為感，感則必有應，所應復為感，感復有應，所以不已也。尺蠖之屈，以求信也。龍蛇之蟄，以存身也。精義入神，以致用也。利用安身，以崇德也。過此以往，未之或知也。前云屈信之理矣，復取物以明之。尺蠖之行，先屈而後信，蓋不屈則無信，信而後有屈，觀尺蠖則知感應之理矣。龍蛇之藏，所以存息其身，而後能奮迅也，不蟄則不能奮矣。動息相感，乃屈信也。君子潛心精微之義，入於神妙，所以致其用也。潛心精微，積也；致用，施也。積與施乃屈信也。利用安身，以崇德也，承上文致用而言，利其施用，安處其身，所以崇大其德業也。所為合理，則事正而身安，聖人能事盡於此矣，故云｢過此以往，未之或知也。窮神知化，德之盛也｣。既云｢過此以往，未之或知｣，更以此語終之，云窮極至神之妙，知化育之道，德之至盛也，无加於此矣。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 4,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：貞吉悔亡，未感害也；憧憧往來，未光大也。",
          "children": [
            {
              "type": "注",
              "text": "貞則吉而悔亡，未為私感所害也；係私應則害於感矣。憧憧往來，以私心相感，感之道狹矣，故云未光大也。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 5,
      "lines": [
        {
          "type": "句",
          "value": "九五，咸其脢，无悔。",
          "children": [
            {
              "type": "注",
              "text": "九居尊位，當以至誠感天下，而應二比上。若係二而說上，則偏私淺狹，非人君之道，豈能感天下乎？脢，背肉也，與心相背而所不見也。言能背其私心，感非其所見而說者，則得人君感天下之正，而无悔也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 5,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：咸其脢，志末也。",
          "children": [
            {
              "type": "注",
              "text": "戒使背其心而咸脢者，為其存心淺末，係二而說上，感於私欲也。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 6,
      "lines": [
        {
          "type": "句",
          "value": "上六，咸其輔頰舌。",
          "children": [
            {
              "type": "注",
              "text": "上陰柔而說體，為說之主，又居感之極，是其欲感物之極也，故不能以至誠感物，而發見於口舌之間，小人女子之常態也，豈能動於人乎？不直云口，而云輔頰舌，亦猶今人謂口過曰唇吻，曰頰舌也，輔頰舌皆所用以言也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 6,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：咸其輔頰舌，滕口說也。",
          "children": [
            {
              "type": "注",
              "text": "唯至誠為能感人，乃以柔說騰揚於口舌，言說豈能感於人乎？"
            }
          ]
        }
      ]
    }
  ]
}