{
  "children": [
    {
      "type": "卦",
      "name": "睽",
      "down": "兌",
      "up": "離",
      "lines": []
    },
    {
      "type": "彖",
      "lines": [
        {
          "type": "句",
          "value": "彖曰：睽，火動而上，澤動而下，二女同居，其志不同行。",
          "children": [
            {
              "type": "注",
              "text": "彖先釋睽義，次言卦才，終言合睽之道，而贊其時用之大。火之性動而上，澤之性動而下，二物之性違異，故為睽義。中少二女雖同居，其志不同行，亦為睽義。女之少也，同處長則各適其歸，其志異也；言睽者，本同也。本不同則非睽也。"
            }
          ]
        },
        {
          "type": "句",
          "value": "說而麗乎明，柔進而上行，得中而應乎剛，是以小事吉。",
          "children": [
            {
              "type": "注",
              "text": "卦才如是，所以小事吉也。兌說也，離麗也，又為明，故為說順而附麗於明。凡離在上，而彖欲見柔居尊者，則曰柔進而上行，晉、鼎是也。方睽乖之時，六五以柔居尊位，有說順麗明之善，又得中道而應剛，雖不能合天下之睽，成天下大事，亦可以小濟，是於小事吉也。五以明而應剛，不能致大吉，何也？曰：五陰柔雖應二，而睽之時，相與之道未能深固，故二必遇主于巷，五噬膚則无咎也。天下睽散之時，必君臣剛陽中正至誠，協力而後能合也。"
            }
          ]
        },
        {
          "type": "句",
          "value": "天地睽而其事同也，男女睽而其志通也，萬物睽而其事類也，睽之時用大矣哉。",
          "children": [
            {
              "type": "注",
              "text": "推物理之同，以明睽之時用，乃聖人合睽之道也。見同之為同者，世俗之知也。聖人則明物理之本同，所以能同天下而和合萬類也。以天地男女萬物明之，天高地下，其體睽也，然陽降陰升，相合而成化育之事則同也。男女異質，睽也，而相求之志則通也。生物萬殊，睽也，然而得天地之和，稟陰陽之氣則相類也。物雖異而理本同，故天下之大，群生之眾，睽散萬殊，而聖人為能同之，處睽之時，合睽之用，其事至大，故云大矣哉。"
            }
          ]
        }
      ]
    },
    {
      "type": "大象",
      "lines": [
        {
          "type": "句",
          "value": "象曰：上火下澤，睽，君子以同而異。",
          "children": [
            {
              "type": "注",
              "text": "上火下澤，二物之性違異，所以為睽離之象。君子觀睽異之象，於大同之中而知所當異也。夫聖賢之處世，在人理之常，莫不大同於世俗所同者，則有時而獨異，蓋於秉 彝則同矣，世俗之失則異也。不能大同者，亂常咈理之人也，不能獨異者，隨俗習非之人也。要在同而能異耳，《中庸》曰：和而不流是也。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 1,
      "lines": [
        {
          "type": "句",
          "value": "初九，悔亡，喪馬，勿逐，自復。見惡人，无咎。",
          "children": [
            {
              "type": "注",
              "text": "九居卦初，睽之始也。在睽乖之時，以剛動於下，有悔可知，所以得亡者，九四在上，亦以剛陽睽離，无與自然同類相合。同是陽爻同居下，又當相應之位，二陽本非相應者，以在睽故合也。上下相與，故能亡其悔也。在睽諸爻皆有應，夫合則有睽，本異則何睽，唯初與四雖非應，而同德相與故相遇。馬者所以行也，陽上行者也，睽獨无與，則不能行，是喪其馬也。四既與之合，則能行矣，是勿逐而馬復得也。惡人與己乖異者也，見者與相通也。當睽之時，雖同德者相與，然小人乖異者至眾，若棄絕之，不幾盡天下以仇君子乎，如此則失合弘之義，至凶咎之道也，又安能化不善而使之合乎，故必見惡人則无咎也。古之聖王所以能化姦凶為善良，革仇敵為臣民者，由弗絕也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 1,
      "lines": [
        {
          "type": "句",
          "value": "象曰：見惡人，以辟咎也。",
          "children": [
            {
              "type": "注",
              "text": "睽離之時，人情乖違，求和合之，且病其不能得也，若以惡人而拒絕之，則將眾仇於君子，而禍咎至矣，故必見之，所以免避怨咎也。无怨咎，則有可合之道。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 2,
      "lines": [
        {
          "type": "句",
          "value": "九二，遇主于巷，无咎。",
          "children": [
            {
              "type": "注",
              "text": "二與五正應，為相與者也，然在睽乖之時，陰陽相應之道衰，而剛柔相戾之意勝，學易者識此，則知變通矣。故二五雖正應，當委曲以相求也。二以剛中之德居下，上應六五之君，道合則志行，成濟睽之功矣。而居睽離之時，其交非，故二當委曲求於相遇，覬其得合也，故曰｢遇主于巷｣，必能合而後无咎。君臣睽離，其咎大矣。巷者，委曲之途也。遇者，會逢之謂也。當委曲相求期於會遇與之合也，以所謂委曲者，以善道宛轉將就使合而已，非枉己屈道也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 2,
      "lines": [
        {
          "type": "句",
          "value": "象曰：遇主于巷，未失道也。",
          "children": [
            {
              "type": "注",
              "text": "當睽之時，君心未合，賢臣在下，竭力盡誠，期使之信合而已。至誠以感動之，盡力以扶持之，明義理以致其知，杜蔽惑以誠其意，如是宛轉以求其合也。遇非枉道，迎逢也；巷非邪僻，曲徑也。故夫子特云｢遇主于巷，未失道也｣。未非必也，非必謂失道也。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 3,
      "lines": [
        {
          "type": "句",
          "value": "六三，見輿曳，其牛掣，其人天且劓，无初有終。",
          "children": [
            {
              "type": "注",
              "text": "陰柔於平時且不足以自立，況當睽離之際乎！三居二剛之間，處不得其所安，其見侵陵可知矣。三以正應在上，欲進與上合志，而四阻於前，二牽於後，車牛所以行之具也，輿曳牽於後也，牛掣阻於前也。在後者牽曳之而已，當前者，進者之所力犯也，故重傷於上，為四所傷也。其人天且劓，天髠首也，劓截鼻也。三從正應而四隔止之，三雖陰柔處剛而志行，故力進以犯之，是以傷也。天而又劓，言重傷也。三不合於二，與四睽之時，自无合義，適合居剛守正之道也。其於正應則睽極有終合之理，始為二陽所厄，是无初也。後必得合，是有終也。掣，從制從手，執止之義也。"
            },
            {
              "type": "注",
              "text": "註* 髠：ㄎㄨㄣ，古代一種剃去頭髮的刑罰"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 3,
      "lines": [
        {
          "type": "句",
          "value": "象曰：見輿曳，位不當也，无初有終，遇剛也。",
          "children": [
            {
              "type": "注",
              "text": "以六居三非正也，非正則不安，又在二陽之間，所以有如是艱厄，由位不當也。无初有終者，終必與上九相遇而合，乃遇剛也。不正而合，未有久而不離者也。合以正道，自无終睽之理，故賢者順理而安行，智者知幾而固守。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 4,
      "lines": [
        {
          "type": "句",
          "value": "九四，睽孤，遇元夫。交孚，厲无咎。",
          "children": [
            {
              "type": "注",
              "text": "九四當睽時，居非所安，无應而在二陰之間，是睽離孤處者也。以剛陽之德，當睽離之時，孤立无與，必以氣類相求而合，是以遇元夫也。夫陽，稱元善也。初九當睽之初，遂能與同德而亡睽之悔，處睽之至善者也，故目之為元夫，猶云善士也。四則過中，為睽已甚，不若初之善也。四與初皆以陽處一卦之下，居相應之位，當睽乖之時，各无應援，自然同德相親，故會遇也。同德相遇必須至誠相與交孚，各有孚誠也。上下二陽以至誠相合，則何時之不能行，何危之不能濟，故雖處危厲而无咎也。當睽離之時，孤居二陰之間，處不當位，危且有咎也，以遇元夫而交孚，故得无咎也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 4,
      "lines": [
        {
          "type": "句",
          "value": "象曰：交孚无咎，志行也。",
          "children": [
            {
              "type": "注",
              "text": "初四皆陽剛君子，當睽乖之時，上下以至誠相交，協志同力，則其志可以行，不止无咎而已。卦辭但言无咎，夫子又從而明之云可以行其志，救時之睽也。蓋以君子陽剛之才，而至誠相輔，何所不能濟也。唯有君子能行其志矣。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 5,
      "lines": [
        {
          "type": "句",
          "value": "六五，悔亡。厥宗噬膚，往何咎。",
          "children": [
            {
              "type": "注",
              "text": "六以陰柔當睽離之時，而居尊位，有悔可知，然而下有九二剛陽之賢與之為應，以輔翼之，故得悔亡。厥宗，其黨也，謂九二正應也。噬膚，噬齧其肌膚而深入之也。當睽之時，非入之者深，豈能合也。五雖陰柔之才，二輔以陽剛之道而深入之，則可往而有慶，復何過咎之有。以周成之幼穉而興盛王之治，以劉禪之昏弱而有中興之勢，蓋由任賢聖之輔，而姬公孔明所以入之者深也。"
            },
            {
              "type": "注",
              "text": "註*穉：ㄓˋ同｢稚｣。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 5,
      "lines": [
        {
          "type": "句",
          "value": "象曰：厥宗噬膚，往有慶也。",
          "children": [
            {
              "type": "注",
              "text": "爻辭但言厥宗噬膚，則可以往而无咎，象復推明其義言。人君雖己才不足，若能信任賢輔，使以其道深入於己，則可以有為，是往而有福慶也。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 6,
      "lines": [
        {
          "type": "句",
          "value": "上九，睽孤，見豕負塗，載鬼一車，先張之弧，後說之弧，匪寇婚媾。往，遇雨則吉。",
          "children": [
            {
              "type": "注",
              "text": "上居卦之終，睽之極也。陽剛居上，剛之極也。在離之上，用明之極也，睽極則咈戾而難合，剛極則躁暴而不詳，明極則過察而多疑。上九有六三之正應，實不孤而其才性如此，自睽孤也。如人雖有親黨而多自疑猜，妄生乖離，雖處骨肉親黨之間，而常孤獨也。上之與三雖為正應，然居睽極无所不疑，其見三如豕之污穢，而又背負泥塗，見其可惡之甚也。既惡之甚，則猜成其罪惡，如見載鬼滿一車也。鬼本无形，而見載之一車，言其以无為有妄之極也。物理極而必反，以近明之，如人適東，東極矣，動則西也；如升高，高極矣，動則下也。既極則動而必反也。上之睽乖既極，三之所處者正理，大凡施道既極，則必反正理，故上於三，始疑而終必合也。先張之弧，始疑惡而欲射之也，疑之者，妄也。妄安能常，故終必復於正。三實无惡，故後說弧而弗射。睽極而反，故與三非復為寇讐，乃婚媾也。此匪婚媾之語，與他卦同而義則殊也。陰陽交而和暢則為雨。上於三始疑而睽，睽極則不疑而合，陰陽合而益，和則為雨，故云往遇雨則吉。往者，自此以往也，謂既合而益合則吉也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 6,
      "lines": [
        {
          "type": "句",
          "value": "象曰：遇雨之吉，群疑亡也。",
          "children": [
            {
              "type": "注",
              "text": "雨者陰陽和也。始睽而能終和，故吉也。所以能和者，以羣疑盡亡也。其始睽也，无所不疑，故云羣疑睽極而合，則皆亡矣。"
            }
          ]
        }
      ]
    }
  ]
}