{
  "children": [
    {
      "type": "卦",
      "name": "革",
      "down": "離",
      "up": "兌",
      "lines": [
        {
          "type": "卦名",
          "value": "　革　離下兌上",
          "children": [
            {
              "type": "注",
              "text": "革，《序卦》：｢井道不可不革，故受之以革。｣井之為物，存之則穢敗，易之則清潔，不可不革者也，故井之後，受之以革也。為卦，兌上離下，澤中有火也。革，變革也。水火，相息之物，水滅火，火涸水，相變革者也。火之性上，水之性下，若相違行，則睽而已。乃火在下，水在上，相就而相尅，相滅息者也，所以為革也。又二女同居，而其歸各異，其志不同，為不相得也，故為革也。"
            }
          ]
        },
        {
          "type": "句",
          "value": "革，巳日乃孚，元亨，利貞，悔亡。",
          "children": [
            {
              "type": "注",
              "text": "革者，變其故也。變其故，則人未能遽信，故必巳日，然後人心信從。元亨利貞，悔亡，弊壞而後革之，革之所以致其通也，故革之而可以大亨；革之而利於正，道則可久而得去故之義；无變動之悔，乃悔亡也。革而无甚益，猶可悔也，況反害乎？古人所以重改作也。"
            }
          ]
        }
      ]
    },
    {
      "type": "彖",
      "lines": [
        {
          "type": "句",
          "value": "《彖》曰：革，水火相息，二女同居，其志不相得，曰革。",
          "children": [
            {
              "type": "注",
              "text": "澤火相滅息，又二女志不相得，故為革。息為止息，又為生息。物止而後有生，故為生義。革之相息，謂止息也。"
            }
          ]
        },
        {
          "type": "句",
          "value": "巳日乃孚，革而信之。",
          "children": [
            {
              "type": "注",
              "text": "事之變革，人心豈能便信？必終日而後孚。在上者於改為之際，當祥告申令，至於巳日，使人信之。人心不信，雖強之行，不能成也。先王政令，人心始以為疑者有矣，然其久也必信。終不孚而成善治者，未之有也。"
            }
          ]
        },
        {
          "type": "句",
          "value": "文明以說，大亨以正，革而當，其悔乃亡。",
          "children": [
            {
              "type": "注",
              "text": "以卦才言革之道也。離為文明，兌為說。文明則理无不盡，事无不察；說則人心和順。革而能照察事理，和順人心，可致大亨，而得貞正。如是，變革得其至當，故悔亡也。天下之事，革之不得其道，則反致弊害，故革有悔之道。惟革之至當，則新舊之悔皆亡也。"
            }
          ]
        },
        {
          "type": "句",
          "value": "天地革而四時成，湯武革命，順乎天而應乎人。革之時大矣哉！",
          "children": [
            {
              "type": "注",
              "text": "推革之道，極乎天地變易，時運終始也。天地陰陽推遷改易而成四時，萬物於是生長成終，各得其宜，革而後四時成也。時運既終，必有革而新之者。王者之興，受命於天，故易世謂之革命。湯武之王，上順天命，下應人心，順乎天而應乎人也。天道變改，世故遷易，革之至大也，故讚之曰，革之時大矣哉！"
            }
          ]
        }
      ]
    },
    {
      "type": "大象",
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：澤中有火，革，君子以治歷明時。",
          "children": [
            {
              "type": "注",
              "text": "水火相息為革，革，變也。君子觀變革之象，推日月星辰之遷易，以治歷數，明四時之序也。夫變易之道，事之至大，理之至明，跡之至著，莫如四時；觀四時而順變革，則與天地合其序矣。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 1,
      "lines": [
        {
          "type": "句",
          "value": "初九，鞏用黃牛之革。",
          "children": [
            {
              "type": "注",
              "text": "變革，事之大也，必有其時，有其位，有其才，審慮而慎動，而後可以无悔。九，以時則初也，動於事初，則无審慎之意，而有躁易之象；以位則下也，无時无援而動於下，則有僭妄之咎，而无體勢之重；以才則離體而陽也，離性上而剛體健，皆速於動也。其才如此，有為則凶咎至矣，蓋剛不中而體躁，所不足者中與順也，當以中順自固而无妄動則可也。鞏，局束也。革，所以包束。黃，中色。牛，順物。鞏用黃牛之革，謂以中順之道自固，不妄動也。不云吉凶，何也？曰：妄動則有凶咎，以中順自固，則不革而已，安得便有吉凶乎？"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 1,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：鞏用黃牛，不可以有為也。",
          "children": [
            {
              "type": "注",
              "text": "以初九時位才皆不可以有為，故當以中順自固也。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 2,
      "lines": [
        {
          "type": "句",
          "value": "六二，巳日乃革之，征吉，无咎。",
          "children": [
            {
              "type": "注",
              "text": "以六居二，柔順而得中正，又文明之主，上有剛陽之君，同德相應。中正則无偏蔽，文明則盡事理，應上則得權勢，體順則无違悖。時可矣，位得矣，才足矣，處革之至善者也。然臣道不當為革之先，又必待上下之信，故巳日乃革之也。如二之才德，所居之地，所逢之時，足以革天下之弊，新天下之治，當進而上輔於君，以行其道，則吉而无咎也。不進則失可為之時，為有咎也。以二體柔而處當位，體柔則其進緩，當位則其處固。變革者，事之大，故有此戒。二得中而應剛，未至失於柔也。聖人因其有可戒之疑，而明其義耳，使賢才不失可為之時也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 2,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：巳日革之，行有嘉也。",
          "children": [
            {
              "type": "注",
              "text": "巳日而革之，征則吉而无咎者，行則有嘉慶也，謂可以革天下之弊，新天下之事。處而不行，是无救弊濟世之心，失時而有咎也。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 3,
      "lines": [
        {
          "type": "句",
          "value": "九三，征凶，貞厲，革言三就，有孚。",
          "children": [
            {
              "type": "注",
              "text": "九三以剛陽為下之上，又居離之上而不得中，躁動於革者也。在下而躁於變革，以是而行，則有凶也。然居下之上，事苟當革，豈可不為也？在乎守貞正而懷危懼，順從公論，則可行之不疑。革言，謂當革之論。就，成也，合也。審察當革之言，至於三而皆合，則可信也。言重慎之至能如是，則必得至當乃有孚也。己可信而眾所信也，如此則可以革矣。在革之時，居下之上，事之當革，若畏懼而不為，則失時為害；唯當慎重之至，不自任其剛明，審稽公論，至於三就而後革之，則无過矣。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 3,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：革言三就，又何之矣？",
          "children": [
            {
              "type": "注",
              "text": "稽之眾論，至於三就，事至當也。又何之矣？乃俗語更何往也？如是而行，乃順理時行，非己之私意所欲為也，必得其宜矣。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 4,
      "lines": [
        {
          "type": "句",
          "value": "九四，悔亡，有孚，改命吉。",
          "children": [
            {
              "type": "注",
              "text": "九四，革之盛也。陽剛，革之才也。離下體而進上體，革之時也。居水火之際，革之勢也。得近君之位，革之任也。下无係應，革之志也。以九居四，剛柔相際，革之用也。四既具此，可謂當革之時也。事之可悔而後革之，革之而當，其悔乃亡也。革之既當，唯在處之以至誠，故有孚則改命吉。改命，改為也，謂革之也。既事當而弊革，行之以誠，上信而下順，其吉可知。四非中正，而至善，何也？曰：唯其處柔也，故剛而不過，近而不逼，順承中正之君，乃中正之人也。《易》之取義无常也，隨時而已。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 4,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：改命之吉，信志也。",
          "children": [
            {
              "type": "注",
              "text": "改命而吉，以上下信其志也。誠既至，則上下信矣。革之道，以上下之信為本。不當不孚則不信。當而不信，猶不可行也，況不當乎？"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 5,
      "lines": [
        {
          "type": "句",
          "value": "九五，大人虎變，未占有孚。",
          "children": [
            {
              "type": "注",
              "text": "九五以剛陽之才，中正之德，居尊位，大人也。以大人之道，革天下之事，无不當也，无不時也。所過變化，事理炳著，如虎之文采，故云虎變。龍虎，大人之象也。變者，事物之變。曰虎，何也？曰：大人變之，乃大人之變也。以大人中正之道變革之，炳然昭著，不待占決，知其至當而天下必信也。天下蒙大人之革，不待占決，知其至當而信之也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 5,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：大人虎變，其文炳也。",
          "children": [
            {
              "type": "注",
              "text": "事理明著，若虎文之炳煥明盛也，天下有不孚乎？"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 6,
      "lines": [
        {
          "type": "句",
          "value": "上六，君子豹變，小人革面，征凶，居貞吉。",
          "children": [
            {
              "type": "注",
              "text": "革之終，革道之成也。君子謂善人，良善則己從革而變，其著見，若豹之彬蔚也。小人，昏愚難遷者，雖未能心化，亦革其面以從上之教令也。龍虎，大人之象，故大人云虎，君子云豹也。人性本善，皆可以變化，然有下愚，雖聖人不能移者。以堯、舜為君，以聖繼聖，百有餘年，天下被化，可謂深且久矣，而有苗、有象，其來格烝乂，蓋亦革面而已。小人既革其外，革道可以為成也。苟更從而深治之，則為已甚，已甚非道也。故至革之終而又征，則凶也，當貞固以自守。革至於極，而不守以貞，則所革隨復變矣。天下之事，始則患乎難革，已革則患乎不能守也，故革之終戒以居貞則吉也。居貞非為六戒乎？曰：為革終言也，莫不在其中矣。人性本善，有不可革者，何也？曰：語其性則皆善也，語其才則有下愚之不移。所謂下愚有二焉：自暴也，自棄也。人苟以善自治，則无不可移者，雖昏愚之至，皆可漸磨而進也。唯自暴者，拒之以不信；自棄者，絕之以不為；雖聖人與居，不能化而入也，仲尼之所謂下愚也。然天下自棄自暴者，非必皆昏愚也，往往強戾而才力有過人者，商辛是也。聖人以其自絕於善，謂之下愚，然考其歸，則誠愚也。既曰下愚，其能革面，何也？曰：心雖絕於善道，其畏威而寡罪，則與人同也。唯其有與人同，所以知其非性之罪也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 6,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：君子豹變，其文蔚也；小人革面，順以從君也。",
          "children": [
            {
              "type": "注",
              "text": "君子從化遷善，成文彬蔚，章見於外也。中人以上，莫不變革，雖不移之小人，則亦不敢肆其惡，革易其外，以順從君上之教令，是革面也。至此，革道成矣。小人勉而假善，君子所容也，更往而治之，則凶矣。"
            }
          ]
        }
      ]
    }
  ]
}