{
  "children": [
    {
      "type": "卦",
      "name": "鼎",
      "down": "巽",
      "up": "離",
      "lines": [
        {
          "type": "卦名",
          "value": "鼎　巽下離上",
          "children": [
            {
              "type": "注",
              "text": "鼎，《序卦》：｢革物者莫若鼎，故受之以鼎。｣鼎之為用，所以革物也，變腥而為熟，易堅而為柔，水火不可同處也，能使相合為用而不相害，是能革物也，鼎所以次革也。為卦，上離下巽。所以為鼎，則取其象焉，取其義焉。取其象者有二：以全體言之，則下植為足，中實為腹，受物在中之象，對峙於上者耳也，橫亘乎上者鉉也，鼎之象也；以上下二體言之，則中虛在上，下有足以承之，亦鼎之象也。取其義，則木從火也，巽入也，順從之義，以木從火，為然之象。火之用惟燔與烹，燔不假器，故取烹象而為鼎，以木巽火，烹飪之象也。制器取其象也，乃象器以為卦乎？曰：製器取於象也，象存乎卦，而卦不必先器。聖人制器，不待見卦而後知象，以眾人之不能知象也，故設卦以示之。卦器之先後，不害於義也。或疑鼎非自然之象，乃人為也。曰：固人為也，然烹飪可以成物，形制如是則可用，此非人為，自然也。在井亦然，器雖在卦先，而所取者乃卦之象，卦復用器以為義也。"
            }
          ]
        },
        {
          "type": "句",
          "value": "鼎：元吉亨。",
          "children": [
            {
              "type": "注",
              "text": "以卦才言也。如卦之才，可以致元亨也。止當云元亨，文羨吉字。卦才可以致元亨，未便有元吉也。彖復止云元亨，其羨明矣。"
            }
          ]
        }
      ]
    },
    {
      "type": "彖",
      "lines": [
        {
          "type": "句",
          "value": "《彖》曰：鼎，象也。",
          "children": [
            {
              "type": "注",
              "text": "卦之為鼎，取鼎之象也；鼎之為器，法卦之象也。有象而後有器，卦復用器而為義也。鼎，大器也，重寶也，故其制作形模，法象尤嚴。鼎之名正也，古人訓方，方實正也。以形言，則耳對植於上，足分峙於下，周圓內外，高卑厚薄，莫不有法而至正，至正然後成安重之象。故鼎者法象之器，卦之為鼎，以其象也。"
            }
          ]
        },
        {
          "type": "句",
          "value": "以木巽火，亨飪也。聖人亨以享上帝，而大亨以養聖賢。",
          "children": [
            {
              "type": "注",
              "text": "以二體言鼎之用也。以木巽火，以木從火，所以亨飪也。鼎之為器，生人所賴至切者也。極其用之大，則聖人亨以享上帝，大亨以養聖賢。聖人，古之聖王。大，言其廣。"
            }
          ]
        },
        {
          "type": "句",
          "value": "巽而耳目聰明，柔進而上行，得中而應乎剛，是以元亨。",
          "children": [
            {
              "type": "注",
              "text": "上既言鼎之用矣，復以卦才言人。能如卦之才，可以致元亨也。下體巽，為巽順於理，離明而中虛於上，為耳目聰明之象。凡離在上者，皆云柔進而上行。柔，在下之物，乃居尊位，進而上行也。以明居尊而得中道，應乎剛能用剛，陽之道也。五居中而又以柔而應剛，為得中道。其才如是，所以能元亨也。"
            }
          ]
        }
      ]
    },
    {
      "type": "大象",
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：木上有火，鼎，君子以正位凝命。",
          "children": [
            {
              "type": "注",
              "text": " 木上有火，以木巽火也，烹飪之象，故為鼎。君子觀鼎之象以正位凝命，鼎者法象之器，其形端正，其體安重，取其端正之象，則以正其位，謂正其所居之位。君子所處必正，其小至於席不正不坐，毋跛毋倚。取其安重之象，則凝其命令，安重其命令也。凝，聚止之義，謂安重也。今世俗有凝然之語，以命令而言耳。凡動為皆當安重也。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 1,
      "lines": [
        {
          "type": "句",
          "value": "初六，鼎顛趾，利出否，得妾以其子，无咎。",
          "children": [
            {
              "type": "注",
              "text": " 六在鼎下，趾之象也。上應於四，趾而向上，顛之象也。鼎覆則趾顛，趾顛則覆其實矣，非順道也。然有當顛之時，謂傾出敗惡以致潔，取新則可也。故顛趾利在於出否。否，惡也。四近君，大臣之位，初在下之人而相應，乃上求於下，下從其上也。上能用下之善，下能輔上之為，可以成事功，乃善道，如鼎之顛趾，有當顛之時，未為悖理也。得妾以其子，无咎。六陰而卑，故為妾。得妾，謂得其人也。若得良妾，則能輔助其主，使无過咎也。子，主也。以其子致其主於无咎也。六陰居下而卑，巽從陽，妾之象也，以上六應四，為顛趾，而發此義。初六本无才德可取，故云得妾，言得其人則如是也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 1,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：鼎顛趾，未悖也。",
          "children": [
            {
              "type": "注",
              "text": "鼎顛而趾顛，悖道也。然非必為悖者，蓋有傾出否惡之時也。"
            }
          ]
        },
        {
          "type": "句",
          "value": "利出否，以從貴也。",
          "children": [
            {
              "type": "注",
              "text": " 去故而納新，瀉惡而受美，從貴之義也。應於四，上從於貴者也。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 2,
      "lines": [
        {
          "type": "句",
          "value": "九二，鼎有實，我仇有疾，不我能即，吉。",
          "children": [
            {
              "type": "注",
              "text": " 二以剛實居中，鼎中有實之象。鼎之有實，上出則為用，二剛陽，有濟用之才，與五相應，上從六五之君，則得正而其道可亨。然與初密比，陰從陽者也。九二居中而應，中不至失正己，雖自守，彼必相求，故戒能遠之使不來即我則吉也。仇，對也。陰陽相對之物，謂初也。相從則非正而害義，是有疾也。二當以正自守，使之不能來就己，人能自守以正，則不正不能就之矣。所以吉也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 2,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：鼎有實，慎所之也。",
          "children": [
            {
              "type": "注",
              "text": "鼎之有實，乃人之有才業也。當慎所趨向，不慎所往則亦陷於非義，二能不暱於初，而上從六五之正應，乃是慎所之也。"
            }
          ]
        },
        {
          "type": "句",
          "value": "我仇有疾，終无尤也。",
          "children": [
            {
              "type": "注",
              "text": " 我仇有疾，舉上文也。我仇對己者，謂初也。初比己而非正，是有疾也。既自守以正，則彼無能即我，所以終无過尤也。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 3,
      "lines": [
        {
          "type": "句",
          "value": "九三，鼎耳革，其行塞，雉膏不食，方雨虧悔，終吉。",
          "children": [
            {
              "type": "注",
              "text": " 鼎耳，六五也，為鼎之主。三以陽居巽之上，剛而能巽，其才足以濟務，然與五非應而不同。五中而非正，三正而非中，不同也，未得於君者也。不得於君，則其道何由而行？革，變革為異也。三與五異而不合也，其行塞不能亨也，不合於君則不得其任，无以施其用。膏，甘美之物，象祿位；雉指五也，有文明之德，故謂之雉。三有才用而不得六五之祿位，是不得雉膏食之也。君子蘊其德，久而必彰，守其道，其終必亨。五有聰明之象，而三終上進之物，陰陽交暢則雨。方雨，且將雨也，言五與三方將和合，虧悔終吉，謂不足之悔終當獲吉也。三懷才而不偶，故有不足之悔，然其有剛陽之德，上聰明而下巽正，終必相得，故吉也。三雖不中，以巽體，故无過剛之失，若過剛則豈能終吉。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 3,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：鼎耳革，失其義也。",
          "children": [
            {
              "type": "注",
              "text": " 始與鼎耳革異者，失其相求之義也，與五非應，失求合之道也。不中，非同志之象也，是以其行塞而不通。然上明而下才，終必和合，故方雨而吉也。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 4,
      "lines": [
        {
          "type": "句",
          "value": "九四，鼎折足，覆公餗，其形渥，凶。",
          "children": [
            {
              "type": "注",
              "text": " 四，大臣之位，任天下之事者也。天下之事豈一人所能獨任，必當天下之賢智與之協力。得其人則天下之治可不勞而致也。用非其人，則敗國家之事，貽天下之患。四下應於初，初陰柔小人，不可用者也，而四用之，其不勝任而敗事，猶鼎之折足也。鼎折足則傾覆公上之餗。餗，鼎實也，居大臣之位，當天下之任而所用非人，至於覆敗，乃不勝其任，可羞愧之甚也。其形渥，謂赧污也，其凶可知。繫辭曰：德薄而位尊，知小而謀大，力小而任重，鮮不及矣。言不勝其任也，蔽於所私，德薄知小也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 4,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：覆公餗，信如何也！",
          "children": [
            {
              "type": "注",
              "text": " 大臣當天下之任，必能成天下之治，安則不誤君上之所倚，下民之所望，與己致身任道之志不失所，斯乃所謂信也，不然則失其職，誤上之委任，得為信乎？故曰：信如何也。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 5,
      "lines": [
        {
          "type": "句",
          "value": "六五，鼎黃耳、金鉉，利貞。",
          "children": [
            {
              "type": "注",
              "text": " 五在鼎上，耳之象也。鼎之舉措在耳，為鼎之主也。五有中德，故云黃耳，鉉加耳者也。二應於五，來從於耳者，鉉也，二有剛中之德，陽體剛中色黃，故為金鉉。五文明得中而應剛，二剛中巽體而上應，才无不足也，相應至善矣，所利在貞固而已。六五居中，應，中不至於失正，而質本陰柔，故戒以貞固於中也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 5,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：「鼎黃耳」，中以為實也。",
          "children": [
            {
              "type": "注",
              "text": "六五以得中為善，是以中為實德也。五之所以聰明應剛，為鼎之主，得鼎之道，皆由得中也。"
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 6,
      "lines": [
        {
          "type": "句",
          "value": "上九，鼎玉鉉，大吉，无不利。",
          "children": [
            {
              "type": "注",
              "text": "井與鼎以上出為用，處終，鼎功之成也。在上鉉之象，剛而溫者玉也，九雖剛陽而居陰，履柔不極剛而能溫者也，居成功之道，唯善處而已，剛柔適宜，動靜不過，則為大吉，无所不利矣。在上為鉉，雖居无位之地，實當用也，與他卦異矣。井亦然。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 6,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：玉鉉在上，剛柔節也。",
          "children": [
            {
              "type": "注",
              "text": "剛而溫，乃有節也。上居成功致用之地，而剛柔中節，所以大吉，无不利也。井鼎皆以終為成功，而鼎不云元吉，何也？曰：井之功用皆在上出，又有博施有常之德，是以元吉。鼎以烹飪為功，居上為成德，與井異，以剛柔節，故得大吉也。"
            }
          ]
        }
      ]
    }
  ]
}