{
  "children": [
    {
      "type": "书名",
      "lines": [
        {
          "type": "句",
          "value": "《彖》曰：歸妹，天地之大義也。",
          "children": [
            {
              "type": "注",
              "text": "一陰一陽之謂道，陰陽交感，男女配合，天地之常理也。歸妹，女歸於男也。故云天地之大義也。男在女上，陰從陽動，故為女歸之象。"
            }
          ]
        },
        {
          "type": "句",
          "value": "天地不交而萬物不興，歸妹，人之終始也。",
          "children": [
            {
              "type": "注",
              "text": "天地不交，則萬物何從而生。女之歸男，乃生生相續之道。男女交，而後有生息，有生息而後其終不窮。前者有終，而後者有始，相續不窮，是人之終始也。"
            }
          ]
        },
        {
          "type": "句",
          "value": "說*以動，所歸妹也。"
        },
        {
          "type": "句",
          "value": "征凶，位不當也。",
          "children": [
            {
              "type": "注",
              "text": "以二體釋歸妹之義。男女相感，說而動者，少女之事，故以說而動，所歸者妹也，所以征則凶者，以諸爻皆不當位也。 所處皆不正，何動而不凶。 大率以說而動，安有不失正者。"
            },
            {
              "type": "注",
              "text": "註*說：音｢月｣，同悅。"
            }
          ]
        },
        {
          "type": "句",
          "value": "无攸利，柔乘剛也。",
          "children": [
            {
              "type": "注",
              "text": "不唯位不當也，又有乘剛之過，三五皆乘剛。 男女有尊卑之序，夫婦有唱隨之禮，此常理也。如恒是也。茍不由常正之道，徇情肆欲，惟說是動，則夫婦瀆亂，男牽欲而失其剛，婦狃*説而忘其順，如歸妹之乘剛是也，所以凶。无所往而利也。夫陰陽之配合，男女之交媾，理之常也。然從欲而流放，不由義理，則淫邪无所不至，傷身敗德，豈人理哉。歸妹之所以凶也。"
            },
            {
              "type": "注",
              "text": "註*狃：ㄋㄧㄡˇ，貪求"
            }
          ]
        },
        {
          "type": "句",
          "value": "《象》曰：澤上有雷，歸妹。君子以永終知敝。",
          "children": [
            {
              "type": "注",
              "text": "雷震於上，澤隨而動。陽動於上，陰說而從女，從男之象也，故為歸妹。君子觀男女配合，生息相續之象，而以永其終，知有敝也。永終，謂生息嗣續，永久其傳也。知敝，謂知物有敝壞，而為相繼之道也。女歸，則有生息，故有永終之義，又夫婦之道，當常永有終，必知其有敝壞之理，而戒慎之敝壞，謂離隙。歸妹，說以動者也，異乎恒之巽而動，漸之止而巽也。少女之說，情之感動，動則失正，非夫婦正而可長之道。久必敝壞，知其必敝，則當思永其終也，天下之反目者，皆不能永終者也。不獨夫婦之道，天下之事，莫不有終、有敝，莫不有可繼、可久之道。觀歸妹，則當思永終之戒也。"
            }
          ]
        },
        {
          "type": "句",
          "value": "初九，歸妹以娣*，跛能履，征吉。",
          "children": [
            {
              "type": "注",
              "text": "女之歸，居下而无正應，娣之象也。剛陽在婦人，為賢貞之德，而處卑順，娣之賢正者也。處說居下，為順義。娣之卑下，雖賢，何所能為，不過自善其身，以承助其君而已。如跛之能履，言不能及遠也。然在其分，為善故，以是而行則吉也。"
            },
            {
              "type": "注",
              "text": "註* 娣: 音ㄉㄧˋ，古代諸侯的女兒出嫁，從嫁共事一夫的妹妹和侄女。"
            }
          ]
        },
        {
          "type": "句",
          "value": "《象》曰：歸妹以娣，以恒也。跛能履，吉相承也。",
          "children": [
            {
              "type": "注",
              "text": "歸妹之義，以說而動，非夫婦能常之道。九乃剛陽有賢貞之德，雖娣之微，乃能以常者也。雖在下，不能有所為，如跛者之能履。然征而吉者，以其能相承助也，能助其君，娣之吉也。"
            }
          ]
        },
        {
          "type": "句",
          "value": "九二，眇*能視，利幽人之貞。",
          "children": [
            {
              "type": "注",
              "text": "九二陽剛而得中，女之賢正者也。上有正應，而反陰柔之質，動於說者也，乃女賢能而配不良故。 二雖賢，不能自遂以成其內助之功，適可以善其身，而小施之。 如眇者之能視而已，言不能及遠也。男女之際，當以正禮。 五雖不正，二自守其幽靜，貞正乃所利也。 二有剛正之德，幽靜之人也。二之才，如是而言。 利貞者，利言宜於如是之貞，非不足而為之戒也。"
            },
            {
              "type": "注",
              "text": "註* 眇:音ㄇㄧㄠˇ眼睛失明,或一目失明"
            }
          ]
        },
        {
          "type": "句",
          "value": "《象》曰：利幽人之貞，未變常也。",
          "children": [
            {
              "type": "注",
              "text": "守其幽貞，未失夫婦常正之道也。 世人以媟*狎為常故，以貞靜為變常，不知乃常久之道也。"
            },
            {
              "type": "注",
              "text": "註*：媟ㄒㄧㄝˋ，過於親昵而不莊重。"
            }
          ]
        },
        {
          "type": "句",
          "value": "六三，歸妹以須，反歸以娣。",
          "children": [
            {
              "type": "注",
              "text": "三居下之上，本非賤者，以失德而无正應，故為欲有歸而未得其歸。須，待也。待者未有所適也。六居三不當位，德不正也。柔而尚剛，行不順也。為說之主，以說求歸，動非禮也。上无應无受之者也，无所適，故須也。女子之處如是，人誰取之，不可以為人配矣，當反歸而求為娣媵則可也。以不正而失其所也。"
            }
          ]
        },
        {
          "type": "句",
          "value": "《象》曰：歸妹以須，未當也。",
          "children": [
            {
              "type": "注",
              "text": "未當者，其處其德，其求歸之道皆不當，故无取之者，所以須也。"
            }
          ]
        },
        {
          "type": "句",
          "value": "九四，歸妹愆期，遲歸有時。",
          "children": [
            {
              "type": "注",
              "text": "九以陽居四，四上體地之高也。陽剛在女子為正德賢明者也。无正應，未得其歸也。過時未歸，故云愆期。女子居貴高之地，有賢明之資，人情所願娶，故其愆期乃為有時，蓋自有待，非不售也。待得佳配，而後行也。九居四，雖不當位而處柔。乃婦人之道，以无應故，為愆期之義。而聖人推理，以女賢而愆期，蓋有待也。"
            }
          ]
        },
        {
          "type": "句",
          "value": "《象》曰：愆期之志，有待而行也。",
          "children": [
            {
              "type": "注",
              "text": "所以愆期者，由己而不由彼。賢女人所願娶，所以愆期。乃其志欲，有所待，待得佳配，而後行也。"
            }
          ]
        },
        {
          "type": "句",
          "value": "六五，帝乙歸妹，其君之袂*不如其娣之袂良。月幾望，吉。",
          "children": [
            {
              "type": "注",
              "text": "六五居尊位，妹之貴高者也。下應於二，為下嫁之象、王姬下嫁，自古而然，至帝乙而後正。 婚姻之禮，明男女之分，雖至貴之女，不得失柔巽之道。有貴驕之志，故易中陰尊而謙降者，則曰帝乙。歸妹泰六五是也。貴女之歸，唯謙降以從禮，乃尊高之德也。 不事容飾，以說於人也。娣 媵**者，以容飾為事者也。衣袂，所以為容飾也。六五尊貴之女，尚禮而不尚飾，故不衭，不及其娣之袂良也。良，美好也。月望，陰之盈也。 盈則敵陽矣。幾望，未至於盈也。五之貴高，常不至於盈極，則不亢其夫，乃為吉也。女之處尊貴之道也。"
            },
            {
              "type": "注",
              "text": "註* 袂: 音ㄇㄟˋ袖也"
            },
            {
              "type": "注",
              "text": "** 媵，ㄧㄥˋ，姬妾婢女"
            }
          ]
        },
        {
          "type": "句",
          "value": "《象》曰：帝乙歸妹，不如其娣之袂良也。其位在中，以貴行也。",
          "children": [
            {
              "type": "注",
              "text": "以帝乙歸妹之道，言其袂不如其娣之袂良：尚禮而不尚飾也。 五以柔中，在尊高之位，以尊貴而行中道也。 柔順降屈，尚禮而不尚飾，乃中道也。"
            }
          ]
        },
        {
          "type": "句",
          "value": "上六，女承筐无實，士刲*羊无血，无攸利。",
          "children": [
            {
              "type": "注",
              "text": "上六，女歸之終而无應，女歸之无終者也。婦者，所以承先祖，奉祭祀，不能奉祭祀則不可以為婦矣。 筐篚*之實，婦職所供也。古者房中之爼葅歜*之類，后夫人職之。諸侯之祭，親割牲，卿大夫皆然。割取血以祭。禮云：血祭，盛氣也。女當承事，筐篚而无實。无實則无以祭，謂不能奉祭祀也。夫婦共承宗廟，婦不能奉祭祀，乃夫不能承祭祀也，故刲羊而无血，亦无以祭也，謂不可以承祭祀也。婦不能奉祭祀，則當離絕矣。是夫婦之无終者也。何所往而利哉。"
            },
            {
              "type": "注",
              "text": "* 刲: 音ㄎㄨㄟ宰殺"
            },
            {
              "type": "注",
              "text": "*篚：ㄈㄟˇ，盛物的圓形竹器"
            },
            {
              "type": "注",
              "text": "*爼音ㄗㄨˇ；葅ㄗㄨ；歜ㄔㄨˋ"
            }
          ]
        },
        {
          "type": "句",
          "value": "《象》曰：上六无實，承虛筐也",
          "children": [
            {
              "type": "注",
              "text": "筐无實，是空筐也。空筐可以祭乎？言不可以奉祭祀也。女不可以承祭祀，則離絕而已。是女歸之无終者也。"
            }
          ]
        }
      ]
    }
  ]
}