[
  " ",
  "　 閱讀古書, 2, 3, 4, 5, 6",
  "　否　坤下乾上",
  "否之匪人，不利君子貞。大往小來。",
  "疏　正義曰：「否之匪人」者，言否閉之世，非是人道交通之時，故云匪人。「不利君子貞」者，由小人道長，君子道消，故不利君子為正也。陽氣往而陰氣來，故云大往小來。陽主生息，故稱大；陰主消耗，故稱小。",
  "《彖》曰：否之匪人，不利君子貞，大往小來，則是天地不交，而萬物不通也；上下不交，而天下无邦也。內陰而外陽，內柔而外剛，內小人而外君子，小人道長，君子道消也。",
  "疏　正義曰：「上下不交而天下无邦」者，與泰卦反也。《泰卦》云「上下交而其志同」，此應云「上下不交則其志不同」也。非但其志不同，上下乖隔，則邦國滅亡，故變云「天下无邦」也。「內柔而外剛」者，欲取否塞之義，故內至柔弱，外禦剛彊，所以否閉。若欲取「通泰」之義，則云「內健」「外順」。各隨義為文，故此云剛柔，不云健順。",
  "《象》曰：天地不交，否。君子以儉德辟難，不可榮以祿。",
  "疏　正義曰：「君子以儉德辟難」者，言君子於此否塞之時，以節儉為德，辟其危難，不可榮華其身，以居祿位。此若據諸侯公卿言之，辟其群小之難，不可重受官賞；若據王者言之，謂節儉為德，辟其陰陽厄運之難，不可重自榮華而驕逸也。",
  "初六，拔茅茹，以其彙，貞吉亨。",
  "注云：居否之初，處順之始，為類之首者也。順非健也，何可以征？居否之時，動則入邪，三陰同道，皆不可進。故茅茹以類，貞而不諂，則吉亨。",
  "《象》曰：拔茅貞吉，志在君也。",
  "注云：志在於君，故不苟進。",
  "疏　正義曰：「拔茅茹」者，以居否之初，處順之始，未可以動，動則入邪，不敢前進。三陰皆然，猶若拔茅，牽連其根相茹也。己若不進，餘皆從之，故云拔茅茹也。「以其彙」者，以其同類，共皆如此。「貞吉亨」者，守正而居，志在於君，乃得吉而亨通。",
  "《象》曰「志在君」者，釋「拔茅貞吉」之義。所以居而守正者，以其志意在君，不敢懷諂苟進，故得吉亨也。此假外物以明人事。",
  "六二，包承，小人吉，大人否，亨。",
  "注云：居否之世，而得其位，用其至順，包承於上，小人路通，內柔外剛，大人否之，其道乃亨。",
  "《象》曰：大人否亨，不亂群也。",
  "疏　正義曰：「包承」者，居否之世而得其位，用其志順，包承於上。小人吉者，否閉之時，小人路通，故於小人為吉也。大人否亨者，若大人用此包承之德，能否閉小人之吉，其道乃亨。",
  "《象》曰「大人否亨，不亂群也」者，此釋所以大人否亨之意，良由否閉小人，防之以得其道，小人雖盛，不敢亂群，故言「不亂群也」。",
  "六三，包羞。",
  "注云：俱用小道以承其上，而但不當，所以包羞也。",
  "《象》曰：包羞，位不當也。",
  "疏　正義曰：「包羞」者，言群陰俱用小人之道包承於上，以失位不當，所包承之事，唯羞辱也。",
  "九四，有命无咎，疇離祉。",
  "注云：夫處否而不可以有命者，以所應者小人也。有命於小人，則消君子之道者也。今初志在君，處乎窮下，故可以有命无咎而疇麗福也。疇謂初也。",
  "《象》曰：有命无咎，志行也。",
  "疏　正義曰：「有命无咎」者，九四處否之時，其陰爻皆是小人。若有命於小人，則君子道消也。今初六志在於君，守正不進，處于窮下。今九四有命命之，故无咎。「疇離祉」者，疇謂疇匹，謂初六也。離，麗也。麗謂附著也。言九四命初，身既无咎，初既被命，附依祉福，言初六得福也。",
  "《象》曰「有命无咎，志行也」者，釋「有命无咎」之義，所以九四有命，得无咎者，由初六志意得行，守正而應於上，故九四之命得无咎。",
  "九五，休否，大人吉。其亡其亡，繫于苞桑。",
  "注云：居尊當位，能休否道者也。施否於小人，否之休也。唯大人而後能然，故曰大人吉也。處君子道消之時，己居尊位，何可以安？故心存將危，乃得固也。",
  "《象》曰：大人之吉，位正當也。",
  "疏　正義曰：「休否」者，休，美也。謂能行休美之事於否塞之時，能施此否閉之道，遏絕小人，則是否之休美者也，故云休否。「大人吉」者，唯大人乃能如此而得吉也，若其凡人，則不能。「其亡其亡，繫于苞桑」者，在道消之世，居於尊位而遏小人，必近危難，須恒自戒慎其意，常懼其危亡，言丁寧戒慎如此也。「繫于苞桑」者，苞，本也。凡物繫于桑之苞本則牢固也。若能「其亡其亡」，以自戒慎，則有「繫于苞桑」之固，无傾危也。",
  "《象》曰「大人之吉，位正當」者，釋「大人吉」之義，言九五居尊得位，正所以當遏絕小人得其吉。",
  "注「居尊」至「得固也」。　正義曰：「心存將危」解「其亡其亡」之義。身雖安靜，心意常存將有危難，恒念「其亡其亡」，乃得固者，即「繫于苞桑」也。必云「苞桑」者，取會韻之義。又桑之為物，其根眾也。眾則牢固之義。",
  "上九，傾否，先否後喜。",
  "注云：先傾後通，故後喜也。始以傾為否，後得通乃喜。",
  "《象》曰：否終則傾，何可長也？",
  "疏　正義曰：「傾否，先否後喜」者，處否之極，否道已終，此上九能傾毀其否，故曰傾否也。「先否後喜」者，否道未傾之時，是先否之道；否道巳傾之後，其事得通，故云「後有喜」也。",
  "《象》曰「否終則傾，何可長」者，釋「傾否」之義。否道巳終，通道將至。故否之終極，則傾損其否，何得長久？故云「何可長也」。",
  " "
]