[
  " ",
  "　 閱讀古書, 2, 3, 4, 5, 6, 7, 8",
  "　大壯　乾下震上",
  "大壯，利貞。",
  "疏　正義曰：大壯，卦名也。壯者，強盛之名。以陽稱大，陽長既多，是大者盛壯，故曰大壯。利貞者，卦德也。群陽盛長，小道將滅，大者獲正，故曰利貞也。 ",
  "《彖》曰：大壯，大者壯也。",
  "注云：大者謂陽爻，小道將滅，大者獲正，故利貞也。 ",
  "剛以動，故壯。大壯利貞，大者正也，正大而天地之情可見矣。",
  "注云：天地之情，正大而巳矣。弘正極大，則天地之情可見矣。",
  "疏　正義曰：大者壯也者，就爻釋卦名。陽爻浸長，已至於四，是大者盛壯，故曰大者壯也。",
  "剛以動故壯者，就二體釋卦名。乾剛而震動，柔弱而動，即有退弱。剛強以動，所以成壯。「大壯利貞大者正也」者，就爻釋卦德。大者獲正，故得利貞。「正大而天地之情可見矣」者，因大獲正，遂廣美正大之義。天地之道，弘正極大，故正大則見天地之情。不言萬物者，壯大之名，義歸天地，故不與咸恒同也。",
  "注「大者獲正故利貞也」。　正義曰：釋名之下，剩解利貞成大者之義也。 ",
  "《象》曰：雷在天上，大壯。",
  "注云：剛以動也。",
  "君子以非禮弗履。",
  "注云：壯而違禮則凶，凶則失壯也。故君子以大壯而順禮也。",
  "疏　正義曰：「雷在天上大壯」者，震雷為威動，乾天主剛健，雷在天上，是剛以動，所以為大壯。",
  "「君子以非禮弗履」者，盛極之時，好生驕溢，故於大壯誡以非禮勿履也。",
  " ",
  "初九，壯于趾，征凶有孚。",
  "注云：夫得大壯者，必能自然成也。未有陵犯於物而得終其壯者。在下而壯，故曰壯于趾也。居下而用剛壯，以斯而進，窮凶可必也，故曰征凶有孚。 ",
  "《象》曰：壯于趾，其孚窮也。",
  "注云：言其信窮。",
  "疏　正義曰：「壯於趾征凶有孚」者，趾，足也。初在體下，有如趾足之象，故曰壯於趾也。施之於人，即是在下而用壯也。在下用壯，陵犯於物，以斯而行，凶其信矣。故曰征凶有孚。",
  "《象》曰「其孚窮」者，釋「壯於趾」者，其人信有窮凶也。",
  " ",
  "九二，貞吉。",
  "注云：居得中位，以陽居陰，履謙不亢，是以貞吉。",
  "《象》曰：九二貞吉，以中也。",
  "疏　正義曰：以其居中履謙，行不違禮，故得正而吉也。",
  " ",
  "九三，小人用壯，君子用罔，貞厲。羝羊觸藩，羸其角。",
  "注云：處健之極，以陽處陽，用其壯者也。故小人用之以為壯，君子用之以為羅己者也。貞厲以壯，雖復羝羊，以之觸藩，能無羸乎？",
  "《象》曰：小人用壯，君子罔也。",
  "疏　正義曰：罔，羅罔也。羝羊，羖羊也。藩，藩籬也。羸，拘累纏繞也。九三處乾之上，是健之極也。又以陽居陽，是健而不謙也。健而不謙，必用其壯也。小人當此，不知恐懼，即用以為壯盛，故曰小人用壯。君子當此即慮危難，用之為羅罔於己，故曰君子用罔。以壯為正，其正必危，故云貞厲也。以此為正，狀似羝羊觸藩也。必拘羸其角矣。",
  "《象》曰「小人用壯，君子罔」者，言小人用以為壯者，即是君子所以為羅罔也。",
  " ",
  "九四，貞吉，悔亡。藩決不羸。壯于大輿之輹。",
  "注云：下剛而進，將有憂虞。而以陽處陰，行不違謙，不失其壯，故得貞吉而悔亡也。己得其壯，而上陰不罔己路，故藩決不羸也。壯于大輿之輹，无有能說其輹者，可以往也。",
  "《象》曰：藩決不羸，尚往也。",
  "疏　正義曰：大輿者，大車也。下剛而進，將有憂虞，而九四以陽處陰，行不違謙，居謙即不失其壯，故得正吉而悔亡也，故云貞吉悔亡。九三以壯健不謙，即被羸其角。九四以謙而進，謂之上行。陰爻不罔己路，故藩決不羸也。「壯於大輿之輹」者，言四乘車而進，其輹壯大，无有能脫之者，故曰「藩決不羸，壯於大輿之輹」也。",
  "《象》曰「尚往」者，尚，庶幾也。言己不失其壯，庶幾可以往也。",
  " ",
  "六五，喪羊于易，无悔。",
  "注云：居於大壯，以陽處陽，猶不免咎，而況以陰處陽，以柔乘剛者乎？羊，壯也。必喪其羊，失其所居也。能喪壯于易，不于險難，故得无悔。二履貞吉，能幹其任，而己委焉，則得无悔。委之則難不至，居之則敵寇來，故曰喪羊于易。",
  "《象》曰：喪羊于易，位不當也。",
  "疏　正義曰：「喪羊于易無悔」者，羊，壯也。居大壯之時，以陽處陽，猶不免咎，而況以陰處陽，以柔乘剛者乎？違謙越禮，必喪其壯。群陽方進，勢不可止。若於平易之時，逆捨其壯，委身任二，不為違拒，亦剛所不害，不害即无悔矣，故曰「喪羊于易无悔」也。",
  "《象》曰「位不當」者，正由處不當位，故須舍其壯也。",
  "注「羊壯也」至「无悔」。　正義曰：羊，剛很之物，故以譬壯。云「必喪其羊失其所居」者，言違謙越禮，理勢必然。云「能喪壯於易不於險難」者，二雖應己，剛長則侵，陰為己寇難，必喪其壯，當在於平易寇難未來之時，勿於險難敵寇既來之日。良由居之必有喪其羊之理，故戒其預防。而莊氏云：「經止一言喪羊，而注為兩處分用。初云『必喪其羊，失其所居』，是自然應失。後云『能喪壯於易，不於險難』，故得无咎。自能喪其羊，二理自為矛盾。」竊謂莊氏此言，全不識注意。",
  " ",
  "上六，羝羊觸藩，不能退，不能遂。无攸利，艱則吉。",
  "注云：有應於三，故不能退。懼於剛長，故不能遂。持疑猶豫，志无所定，以斯決事，未見所利。雖處剛長，剛不害正。苟定其分，固志在三*，以斯自處，則憂患消亡，故曰艱則吉也。",
  "*「三」或作「一」。",
  "《象》曰：不能退，不能遂，不詳也。艱則吉，咎不長也。",
  "疏　正義曰：退謂退避，遂謂進往。有應於三，欽之不巳，故不能退避。然懼於剛長，故不能遂往，故云「羝羊觸藩不能退不能遂」也。无攸利者，持疑猶豫，不能自決，以此處事，未見其利，故曰无攸利也。艱則吉者，雖處剛長，剛不害正。但艱固其志，不捨於三，即得吉，故曰艱則吉也。",
  "《象》曰「不詳也」者，祥者善也。進退不定，非為善也，故云不祥也。「咎不長也」者，能艱固其志，即憂患消亡，其咎不長，釋所以得吉也。",
  " "
]