[
  " ",
  "　 閱讀古書, 2, 3, 4, 5, 6, 7, 8",
  "　晉　坤下離上",
  "晉，康侯用錫馬蕃庶，晝日三接。",
  "疏　正義曰：晉者，卦名也。晉之為義，進長之名。此卦明臣之昇進，故謂之晉。康者，美之名也。侯謂昇進之臣也。臣既柔進，天子美之，賜以車馬，蕃多而眾庶，故曰「康侯用錫馬蕃庶」也。晝日三接者，言非惟蒙賜蕃多，又被親寵頻數，一晝之間，三度接見也。 ",
  " ",
  "《彖》曰：晉，進也。明出地上，順而麗乎大明，柔進而上行。",
  "注云：凡言上行者，所之在貴也。",
  "是以康侯用錫馬蕃庶，晝日三接也。",
  "注云：康，美之名也。順以著明，臣之道也。柔進而上行，物所與也。故得錫馬而蕃庶。以訟受服，則終朝三褫。柔進受寵，則一晝三接也。",
  "疏　正義曰：「晉，進也」者，以今釋古，古之晉字，即以進長為義，恐後世不曉，故以進釋之。「明出地上」者，此就二體釋得晉名。離上坤下，故言明出地上。明既出地，漸就進長，所以為晉。「順而麗乎大明柔進而上行」者，此就二體之義及六五之爻釋「康侯用錫馬」巳下也。坤，順也；離，麗也，又為明。坤能順從而麗著於大明，六五以柔而進，上行貴位，順而著明臣之美道也。柔進而上行，君上所與也，故得厚賜而被親寵也。",
  "「是以康侯用錫馬蕃庶，晝日三接」者，釋訖舉《經》以結君寵之意也。",
  "注「以訟」至「三接也」。　正義曰：舉此對釋者，蓋訟言終朝，晉言一晝，俱不盡一日，明黜陟之速，所以示懲勸也。",
  " ",
  "《象》曰：明出地上，晉。君子以自昭明德。",
  "注云：以順著明，自顯之道。",
  "疏　正義曰：「自昭明德」者，昭亦明也，謂自顯明其德也。周氏等為「照」，以為自照己身。《老子》曰：「自知者明。」用明以自照為明德。案：王注此云：「以順著明自顯之道。」又此卦與明夷正反。《明夷象》云：「君子以蒞眾用晦而明。」王注彼云：「蒞眾顯明，蔽偽百姓。」「藏明於內，乃得明也。」准此二注，明王之注意以此為自顯明德。昭字宜為昭（之遙反）。周氏等為照（之召反），非注旨也。",
  " ",
  "初六，晉如摧如，貞吉。罔孚，裕，无咎。",
  "注云：處順之初，應明之始，明順之德，於斯將隆。進明退順，不失其正，故曰「晉如摧如貞吉」也。處卦之始，功業未著，物未之信，故曰罔孚。方踐卦始，未至履位，以此為足，自喪其長者也。故必裕之，然後无咎。",
  " ",
  "《象》曰：晉如摧如，獨行正也。裕无咎，未受命也。",
  "注云：未得履位，未受命也。",
  " ",
  "疏　正義曰：「晉如摧如貞吉」者，何氏云：「摧，退也。裕，寬也。如，辭也。」初六處順之初，應明之始，明順之德，於斯將隆，進則之明，退則居順，進之與退，不失其正，故曰「晉如摧如貞吉」也。罔孚者，處卦之始，功業未著，未為人所信服，故曰罔孚。裕无咎者，裕，寬也。方踐卦始，未至履位，不可自以為足也，若以此為足，是自喪其長也。故必宜寬裕其德，使功業弘廣，然後无咎，故曰裕无咎也。",
  "《象》曰「獨行正」者，獨猶專也，言進與退，專行其正也。「裕无咎未受命也」者，處進之初，未得履位，未受錫命，故宜寬裕進德，乃得无咎。",
  " ",
  "六二，晉如愁如，貞吉。受茲介福，于其王母。",
  "注云：進而无應，其德不昭，故曰「晉如愁如」。居中得位，履順而正，不以无應而回其志，處晦能致其誠者也。脩德以斯，聞乎幽昧，得正之吉也，故曰貞吉。母者，處內而成德者也。鳴鶴在陰則其子和之，立誠於闇，闇亦應之，故其初愁如。履貞不回，則乃受茲大福于其王母也。",
  " ",
  "《象》曰：受茲介福，以中正也。",
  "疏　正義曰：「晉如愁如」者，六二進而无應於上，其德不見昭明，故曰進如愁如，憂其不昭也。貞吉者，然履順居於中正，不以无應而不脩其德，正而獲吉，故曰貞吉也。「受茲介福于其王母」者，介者，大也。母者，處內而成德者也。初雖愁如，但守正不改，終能受此大福於其所脩，故曰「受茲介福於其王母」。",
  "注「鳴鶴在陰則其子和之」。　正義曰：此王用《中孚》九二爻辭也。",
  " ",
  "六三，眾允，悔亡。",
  "注云：處非其位，悔也。志在上行，與眾同信，順而麗明，故得悔亡也。",
  " ",
  "《象》曰：眾允之，志上行也。",
  "疏　正義曰：六三處非其位，有悔也。志在上行，與眾同信，順而麗明，故得其悔亡。",
  "《象》曰「眾允之，志上行也」者，居晉之時，眾皆欲進，己應於上，志在上行，故能與眾同信也。",
  " ",
  "九四，晉如鼫鼠，貞厲。",
  "注云：履非其位，上承於五，下據三陰。履非其位，又負且乘，无業可安，志无所據，以斯為進，正之危也。進如鼫鼠，无所守也。",
  "《象》曰：鼫鼠貞厲，位不當也。",
  "疏　正義曰：晉如鼫鼠者，鼫鼠有五能而不成伎之蟲也。九四履非其位，上承於五，下據三陰，上不許其承，下不許其據，以斯為進，无業可安，无據可守，事同鼫鼠，无所成功也。以斯為進，正之危也，故曰「晉如鼫鼠，貞厲」也。",
  "注「進如鼫鼠，无所守也」。　正義曰：蔡邕《勸學篇》云：「鼫鼠五能不成一伎術。」《注》曰：「能飛不能過屋，能緣不能窮木，能游不能度谷，能穴不能掩身，能走不能先人*。」《本草經》云：「螻蛄一名鼫鼠。」謂此也。鄭引《詩》云：「碩鼠碩鼠，无食我黍。」謂大鼠也。陸機以為「雀鼠」。案：王以為「无所守」，蓋五伎者當之。",
  "*「先人」原文作「免人」。",
  " ",
  "六五，悔亡，失得勿恤，往吉，无不利。",
  "注云：柔得尊位，陰為明主，能不用察，不代下任也。故雖不當位，能消其悔。失得勿恤，各有其司，術斯以往，无不利也。",
  " 《象》曰：失得勿恤，往有慶也。",
  "疏　正義曰：「悔亡失得勿恤往吉无不利」者，居不當位，悔也。柔得尊位，陰為明主，能不自用其明，以事委任於下，故得悔亡。既以事任下，委物責成，失之與得，不須憂恤，故曰失得勿恤也。能用此道，所往皆吉而无不利，故曰往吉无不利也。",
  "《象》曰「有慶」者，委任得人，非惟自得无憂，亦將人所慶說，故曰有慶也。",
  " ",
  "上九，晉其角，維用伐邑。厲吉无咎，貞吝。",
  "注云：處進之極，過明之中，明將夷焉。已在乎角，在猶進之，非亢如何？失夫道化无為之事，必須攻伐，然後服邑，危乃得吉，吉乃无咎。用斯為正，亦以賤矣。",
  "《象》曰：維用伐邑，道未光也。",
  "疏　正義曰：晉其角者，西南隅也。上九處進之極，過明之中，其猶日過於中，已在於角而猶進之，故曰進其角也。維用伐邑者，在角猶進，過亢不已，不能端拱无為，使物自服，必須攻伐其邑，然後服之，故云維用伐邑也。「厲吉无咎貞吝」者，兵者凶器，伐而服之，是危乃得吉，吉乃无咎，故曰厲吉无咎。以此為正，亦以賤矣，故曰貞吝也。",
  "《象》曰「道未光也」者，用伐乃服，雖得之，其道未光大也。",
  " ",
  " "
]