[
  " ",
  "　 閱讀古書, 2, 3, 4, 5, 6, 7",
  "　家人　離下巽上",
  "家人，利女貞。",
  "注云：家人之義，各自脩一家之道，不能知家外他人之事也。統而論之，非元亨利君子之貞，故利女貞，其正在家內而巳。",
  "疏　正義曰：家人者，卦名也。明家內之道，正一家之人，故謂之家人。利女貞者，既修家內之道，不能知家外他人之事。統而論之，非君子丈夫之正，故但言利女貞。",
  "《彖》曰：家人，女正位乎內，",
  "注云：謂二也。",
  "男正位乎外。",
  "注云：謂五也。家人之義，以內為本，故先說女也。",
  "男女正，天地之大義也。家人有嚴君焉，父母之謂也。父父、子子、兄兄、弟弟、夫夫、婦婦，而家道正，正家而天下定矣。",
  "疏　正義曰：「女正位乎內，男正位乎外」者，此因二、五得正，以釋家人之義，並明女貞之旨。家人之道，必須女主於內，男主於外，然後家道乃立。今此卦六二柔而得位，是女正位乎內也。九五剛而得位，是男正位乎外也。家人以內為本，故先說女也。",
  "「男女正天地之大義也」者，因正位之言，廣明家人之義乃道均二儀，非惟人事而已。家人即女正於內，男正於外，二儀則天尊在上，地卑在下，同於男女正位，故曰天地之大義也。",
  "「家人有嚴君焉父母之謂」者，上明義均天地，此又言道齊邦國。父母一家之主，家人尊事，同於國有嚴君焉，父母之謂也。",
  "「父父、子子、兄兄、弟弟、夫夫、婦婦而家道正，正家而天下定矣」者，此歎美正家之功，可以定於天下，申成道齊邦國。既家有嚴君，即父不失父道，乃至婦不失婦道，尊卑有序，上下不失，而後為家道之正。各正其家，无家不正，即天下之治定矣。",
  " ",
  "《象》曰：風自火出，家人。",
  "注云：由內以相成，熾也。",
  "君子以言有物而行有恒。",
  "注云：家人之道，脩於近小而不妄也。故君子以言必有物而口无擇言，行必有恒而身无擇行。",
  "疏　正義曰：「風自火出，家人」者，巽在離外，是風從火出。火出之初，因風方熾。火既炎盛，還復生風。內外相成，有似家人之義。故曰「風自火出家人」也。",
  "「君子以言有物而行有恒」者，物，事也。言必有事，即口无擇言。行必有常，即身无擇行。正家之義，修於近小。言之與行，君子樞機。出身加人，發邇化遠，故舉言行以為之誡。言既稱物，而行稱恒者，發言立行，皆須合於可常之事，互而相足也。",
  " ",
  "初九，閑有家，悔亡。",
  "注云：凡教在初而法在始，家瀆而後嚴之，志變而後治之，則悔矣。處家人之初，為家人之始，故宜必以閑有家，然後悔亡也。",
  "《象》曰：閑有家，志未變也。",
  "疏　正義曰：「閑有家，悔亡」者，治家之道，在初即須嚴正，立法防閑。若黷亂之後，方始治之，即有悔矣。初九處家人之初，能防閑有家，乃得悔亡，故曰「閑有家，悔亡」也。",
  "《象》曰「志未變也」者，釋在初防閑之義。所以在初防閑其家者，家人志未變黷也。",
  " ",
  "六二，无攸遂，在中饋，貞吉。",
  "注云：居內處中，履得其位，以陰應陽，盡婦人之正義，无所必遂，職乎中饋，巽順而巳，是以貞吉也。",
  "《象》曰：六二之吉，順以巽也。",
  "疏　正義曰：「无攸遂，在中饋，貞吉」者，六二履中，居位以陰應陽，盡婦人之義也。婦人之道，巽順為常，无所必遂。其所職主，在於家中饋食供祭而已，得婦人之正吉，故曰「无攸遂在中饋貞吉」也。",
  "《象》曰「六二之吉，順以巽」者，舉爻位也。言吉者，明其以柔居中而得正位，故能順以巽而獲吉也。",
  " ",
  "九三，家人嗃嗃，悔厲，吉。婦子嘻嘻，終吝。",
  "注云：以陽處陽，剛嚴者也。處下體之極，為一家之長者也。行與其慢，寧過乎恭；家與其瀆，寧過乎嚴。是以家人雖嗃嗃悔厲，猶得其道。婦子嘻嘻，乃失其節也。",
  "《象》曰：家人嗃嗃，未失也。婦子嘻嘻，失家節也。",
  "疏　正義曰：「家人嗃嗃，悔厲，吉。婦子嘻嘻，終吝」者，嗃嗃，嚴酷之意也。嘻嘻，喜笑之貌也。九三處下體之上，為一家之主，以陽處陽，行剛嚴之政，故家人嗃嗃。雖復嗃嗃傷猛，悔其酷厲，猶保其吉，故曰悔厲吉。若縱其婦子慢黷嘻嘻，喜笑而无節，則終有恨辱，故曰「婦子嘻嘻終吝」也。",
  "《象》曰「未失也」者，初雖悔厲，似失於猛，終无慢黷，故曰未失也。失家節者，若縱其嘻嘻，初雖歡樂，終失家節也。",
  " ",
  "六四，富家，大吉。",
  "注云：能以其富，順而處位，故大吉也。若但能富其家，何足為大吉？體柔居巽，履得其位，明於家道，以近至尊，能富其家也。",
  "《象》曰：富家大吉，順在位也。",
  "疏　正義曰：「富家大吉」者，富謂祿位昌盛也。六四體柔處巽，得位承五，能富其家者也。由其體巽承尊，長保祿位，吉之大者也，故曰富家大吉。",
  "《象》曰「順在位」者，所以致大吉，由順承於君而在臣位，故不見黜奪也。",
  " ",
  "九五，王假有家，勿恤，吉。",
  "注云：假，至也。履正而應，處尊體巽，王至斯道，以有其家者也。居於尊位，而明於家道，則下莫不化矣。父父、子子、兄兄、弟弟、夫夫、婦婦，六親和睦，交相愛樂，而家道正，正家而天下定矣，故王假有家則勿恤而吉。",
  "《象》曰：王假有家，交相愛也。",
  "疏　正義曰：「王假有家」者，假，至也。九五履正而應，處尊體巽，是能以尊貴巽接於物，王至此道，以有其家，故曰王假有家也。「勿恤吉」者，居於尊位而明於家道，則在下莫不化之矣，不須憂恤而得吉也，故曰勿恤吉也。",
  "《象》曰「交相愛也」者，王既明於家道，天下化之，六親和睦，交相愛樂也。",
  " ",
  "上九，有孚，威如，終吉。",
  "注云：處家人之終，居家道之成，刑于寡妻，以著于外者也，故曰有孚。凡物以猛為本者則患在寡恩，以愛為本者則患在寡威，故家人之道尚威嚴也。家道可終，唯信與威。身得威敬，人亦如之。反之於身，則知施於人也。",
  "《象》曰：威如之吉，反身之謂也。",
  "疏　正義曰：「有孚，威如，終吉」者，上九處家人之終，家道大成，刑于寡妻，以著於外，信行天下，故曰有孚也。威被海內，故曰威如。威信並立，乃得終於家道，而吉從之，故曰「有孚威如終吉」也。",
  "《象》曰「反身之謂」者，身得人敬則敬於人，明知身敬於人人亦敬己，反之於身則知施之於人，故曰反身之謂也。",
  " "
]