[
  " ",
  "　 閱讀古書, 2, 3, 4, 5, 6, 7, 8, 9, 10",
  "　蒙卦　坎下艮上",
  "蒙，亨。匪我求童蒙，童蒙求我。初筮告，再三瀆，瀆則不告。",
  "注云：筮者決疑之物也。童蒙之來求我，欲決所惑也。決之不一，不知所從，則復惑也。故初筮則告，再、三則瀆，瀆蒙也。能為初筮，其唯二乎？以剛處中，能斷夫疑者也。",
  "利貞。",
  "注云： 蒙之所利，乃利正也。夫明莫若聖，昧莫若蒙。蒙以養正，乃聖功也。然則養正以明，失其道矣。",
  "疏　正義曰：蒙者，微昧闇弱之名。物皆蒙昧，唯願亨通，故云「蒙，亨」。「匪我求童蒙，童蒙求我」者，物既闇弱而意願亨通，即明者不求於闇，即匪我師德之高明往求童蒙之闇，但闇者求明，明者不諮於闇，故云「童蒙求我」也。「初筮告」者，初者，發始之辭；筮者，決疑之物。童蒙既來求我，我當以初始一理剖決告之。「再三瀆，瀆則不告」者，師若遲疑不定，或再或三，是褻瀆，瀆則不告。童蒙來問，本為決疑，師若以廣深二義再三之言告之，則童蒙聞之，轉亦瀆亂，故不如不告也。自此已上，解「蒙亨」之義。順此上事，乃得亨也。故亨文在此事之上也。不云元者，謂時當蒙弱，未有元也。",
  "「利貞」者，貞，正也。言蒙之為義，利以養正，故《彖》云「蒙以養正」，乃「聖功也」。若養正以明，即失其道也。",
  "注「筮」者至「夫疑」者也。　正義曰：「初筮則告」者，童蒙既來求我，我當以初心所念所筮之義，一理而剖告之。「再三則瀆，瀆蒙也」者，若以棄此初本之意而猶豫遲疑，岐頭別說，則童蒙之人，聞之褻瀆而煩亂也。故「再三則瀆，瀆蒙也」。「能為初筮，其唯二乎」者，以《彖》云「初筮告，以剛中」者，剛而得中故知是二也。",
  "注蒙之至失其道矣。　正義曰：「然則養正以明，失其道」者，言人雖懷聖德，若隱默不言，人則莫測其淺深，不知其大小，所以聖德彌遠而難測矣。若彰顯其德，苟自發明，即人知其所為，識其淺深。故《明夷》注云「明夷蒞眾，顯明於外，巧所避」是也。此卦，《繫辭》皆以人事明之。",
  " ",
  "《彖》曰：蒙，山下有險，險而止，蒙。",
  "注云：遯退用險*，進則閡山，不知所適，蒙之義也。",
  "*「遯退用險」或作「退則困險」。",
  " ",
  "蒙，亨，以亨行，時中也。",
  "注云：時之所願，唯願亨也。以亨行之，得時中也。",
  "匪我求童蒙，童蒙求我，志應也。",
  "注云：我謂非童蒙者也。非童蒙者，即陽也。凡不識者求問識者，識者不求所告；闇者求明，明者不諮於闇。故《蒙》之為義，「匪我求童蒙，童蒙求我」也。童蒙之來求我，志應故也。",
  "初筮告，以剛中也。",
  "注云：謂二也。二為眾陰之主也，无剛決中，何由得初筮之告乎？",
  "再、三瀆，瀆則不告。瀆蒙也，蒙以養正，聖功也。",
  "疏　正義曰：「山下有險」者，坎在艮下，是山下有險。艮為止，坎上遇止，是險而止也。恐進退不可，故蒙昧也。此釋蒙卦之名。",
  "「蒙亨以亨行時中」者，疊蒙亨之義，言居蒙之時，人皆願亨。若以亨道行之于時，則得中也。故云時中也。",
  "「匪我求童蒙，童蒙求我，志應」者，以童蒙闇昧之志，而求應會明者，故云志應也。",
  "「再三瀆，瀆則不告。瀆蒙」者，所以再三不告，恐瀆亂蒙者。自此已上，《彖》辭總釋蒙亨之義。「蒙以養正，聖功也」者，能以蒙昧隱默自養正道，乃成至聖之功。此一句釋經之利貞。",
  " ",
  "《象》曰：山下出泉，蒙。",
  "注云：山下出泉，未知所適，蒙之象也。",
  "君子以果行育德。",
  "注云：果行者，初筮之義也。育德者，養正之功也。",
  "疏　正義曰：「山下出泉，蒙」者，山下出泉，未有所適之處，是險而止，故蒙昧之象也。",
  "「君子以果行育德」者，君子當發此蒙道，以果決其行，告示蒙者，則初筮之義。育德謂隱默懷藏，不自彰顯，以育養其德。果行育德者，自相違錯，若童蒙來問，則果行也，尋常處眾則育德，是不相須也。",
  "初六，發蒙，利用刑人，用說桎梏，以往吝。",
  "注云：處蒙之初，二照其上，故蒙發也。蒙發疑明，刑說當也。以往吝，刑不可長也。",
  "《象》曰：利用刑人，以正法也。",
  "注云：刑人之道，道所惡也。以正法制，故刑人也。",
  "疏　正義曰：「發蒙」者，以初近於九二，二以陽處中，而明能照闇，故初六以能發去其蒙也。「利用刑人，用說桎梏」者，蒙既發去，无所疑滯，故利用刑戮于人，又利用說去罪人桎梏，以蒙既發去，疑事顯明，刑人說桎梏皆得當。在足曰桎，在手曰梏。《小爾雅》云：「杻謂之梏，械謂之桎。」「以往吝」者，若以正道而往，即其事益善矣；若以刑人之道出往行之，即有鄙吝。",
  "《象》曰「利用刑人以正法」者，且刑人之道乃賊害於物，是道之所惡，以利用刑人者，以正其法制，不可不刑矣。故刑罰不可不施於國，鞭扑不可不施於家。案：此經刑人、說人二事，《象》直云「利用刑人」一者，但舉刑重故也。",
  " ",
  "九二，包蒙，吉。納婦吉，子克家。",
  "注云：以剛居中，童蒙所歸，包而不距，則遠近咸至，故曰「包蒙吉」也。婦者，配己而成德者也。體陽而能包蒙，以剛而能居中，以此納配，物莫不應，故納婦吉也。處于卦內，以剛接柔，親而得中，能幹其任，施之於子，克家之義。",
  "《象》曰：子克家，剛柔接也。",
  "疏　正義曰：「包蒙，吉。納婦吉，子克家」者，包謂包含，九二以剛居中，群蒙悉來歸己，九二能含容而不距，皆與之決疑，故得吉也。九二以剛居中，陰來應之。婦謂配也，故納此疋配而得吉也。此爻在下體之中，能包蒙納婦，任內理中，幹了其任，即是子孫能克荷家事，故云「子克家」也。",
  "《象》曰：「子克家，剛柔接」者，以陽居於卦內，接待群陰，是剛柔相接，故克幹家事也。",
  "注以剛至之義。　正義曰：「親而得中」者，言九二居下卦之中央，上下俱陰，以己之剛陽迎接上下二陰，陰陽相親，故云「親而得中」也。「能幹其任」者，既能包蒙，又能納疋，是能幹其任。",
  " ",
  "六三，勿用取女。見金夫，不有躬，无攸利。",
  "注云：童蒙之時，陰求於陽，晦求於明，各求發其昧者也。六三在下卦之上，上九在上卦之上，男女之義也。上不求三而三求上，女先求男者也。女之為體，正行以待命者也。見剛夫而求之，故曰不有躬也。施之於女行在不順，故勿用取女而无攸利。",
  "《象》曰：勿用取女，行不順也。",
  "疏　正義曰：「勿用取女」者，女謂六三，言勿用取此六三之女。所以不須取者，此童蒙之世，陰求於陽，是女求男之時也。「見金夫」者，謂上九以其剛陽，故稱金夫。此六三之女，自往求見金夫。女之為體，正行以待命而嫁。今先求於夫，是為女不能自保其躬，固守貞信，乃非禮而動，行既不順，若欲取之，无所利益，故云「不有躬，无攸利」也。",
  "《象》曰：「勿用取女，行不順」者，釋勿用取女之義。所以勿用取此女者，以女行不順故也。",
  " ",
  "六四，困蒙，吝。",
  "注云：獨遠於陽，處兩陰之中，闇莫之發，故曰困蒙也。困於蒙昧，不能比賢以發其志，亦以鄙矣，故曰吝也。",
  "《象》曰：困蒙之吝，獨遠實也。",
  "注云：陽稱實也。",
  "疏　正義曰：此釋六四爻辭也。六四在兩陰之中，去九二既遠，无人發去其童蒙，故曰困于蒙昧而有鄙吝。",
  "《象》曰「獨遠實」者，實謂九二之陽也。九二以陽，故稱實也。六三近九二，六五近上九，又應九二，唯此六四既不近二，又不近上，故云「獨遠實也」。",
  "注「陽稱實」者。　正義曰：陽主生息，故稱實。陰主消損，故不得言實。",
  "  ",
  "六五，童蒙吉。",
  "注云：以夫陰質居於尊位，不自任察而委於二，付物以能，不勞聰明，功斯克矣，故曰童蒙吉。",
  "《象》曰：童蒙之吉，順以巽也。",
  "注云：委物以能，不先不為，順以巽也。",
  "疏　正義曰：「童蒙吉」者言六五以陰居於尊位，其應在二，二剛而得中，五則以事委任於二，不勞己之聰明，猶若童稚蒙昧之人，故所以得吉也。",
  "《象》曰至「順以巽」者釋童蒙之吉，巽亦順也，猶委物於二。順謂心順，巽謂貌順。故褚氏云：「順者心不違也，巽者外迹相卑下也。」",
  "注「委物」至「以巽也」。　正義曰：委物以能」謂委付事物與有能之人，謂委二也。「不先不為」者，五雖居尊位，而事委任於二，不在二先而首唱，是順於二也。「不為」者，謂不自造為，是委任二也。不先於二，是心順也；不自造為，是貌巽也。",
  "上九，擊蒙，不利為寇，利禦寇。",
  "注云：處蒙之終，以剛居上，能擊去童蒙，以發其昧者也，故曰擊蒙也。童蒙願發而己能擊去之，合上下之願，故莫不順也。為之扞禦，則物咸附之。若欲取之，則物咸叛矣，故「不利為寇，利禦寇」也。",
  "《象》曰：利用禦寇，上下順也。",
  "疏　正義曰：「擊蒙，不利為寇，利禦寇」者，處蒙之終，以剛居上，能擊去眾陰之蒙，合上下之願，故莫不順從也。若因物之來即欲取之而為寇害，物皆叛矣，故不利為寇也。若物從外來，為之扞禦，則物咸附之，故利用禦寇也。",
  "《象》曰「利用禦寇，上下順」者，所宜利為物禦寇者，由上下順從故也。言此爻既能發去眾蒙，以合上下之願，又能為之禦寇，故上下彌更順從也。",
  " "
]