[
  " ",
  "　 閱讀古書, 2, 3, 4, 5, 6, 7, 8, 9, 10",
  "　益　震下巽上",
  "益，利有攸往，利涉大川。",
  "疏　正義曰：益者，增足之名，損上益下，故謂之益。下已有矣，而上更益之，明聖人利物之无已也。損卦則損下益上，益卦則損上益下，得名皆就下而不據上者，向秀云：「明王之道，志在惠下，故取下謂之損，與下謂之益。」既上行惠下之道，利益萬物，動而无違，何往不利，故曰「利有攸往」。以益涉難，理絕險阻，故曰「利涉大川」。",
  "《彖》曰：益，損上益下，民說无疆，",
  "注云：震，陽也；巽，陰也。巽非違震者也，處上而巽，不違於下，損上益下之謂也。",
  "自上下下，其道大光。 利有攸往，中正有慶。",
  "注云：五處中正，自上下下，故有慶也。以中正有慶之德，有攸往也，何適而不利哉。",
  "利涉大川，木道乃行。",
  "注云：木者，以涉大川為常而不溺者也。以益涉難，同乎木也。",
  "益動而巽，日進无疆。天施地生，其益无方。",
  "注云：損上益下。",
  "凡益之道，與時偕行。",
  "注云：益之為用，施未足也；滿而益之，害之道也。故凡益之道，與時偕行也。",
  "疏　正義曰：「益，損上益下，民說无疆」者，此就二體釋卦名之義。柔巽在上，剛動在下，上巽不違於下，損上益下之義也。既居上者能自損以益下，則下民歡說，无復疆限。益卦所以名益者，正以「損上益下，民說无疆」者也。",
  "「自上下下，其道大光。 利有攸往，中正有慶」者，此就九五之爻，釋「利有攸往，中正有慶」也。五處中正，能自上下下，則其道光大，為天下之所慶賴也。以中正有慶之德，故所往无不利焉。益之所以「利有攸往」者，正謂中正有慶故也。",
  "「利涉大川，木道乃行」者，此取辟以釋「利涉大川」也。木體輕浮，以涉大川，為常而不溺也。以益涉難，如木道之涉川。涉川无害，方見益之為利，故云「利涉大川，木道乃行」也。",
  "「益動而巽，日進无疆」者，自此已下，廣明益義。前則就二體明損上益下以釋卦名，以下有動求，上能巽接，是損上益下之義。今就二體更明得益之方也，若動而驕盈，則被損无已；若動而卑巽，則進益无疆，故曰「益動而巽，日進无疆」。",
  "「天施地生，其益无方」者，此就天地廣明益之大義也。天施氣於地，地受氣而化生，亦是「損上益下」之義也。其施化之益，无有方所，故曰「天施地生，其益无方」。",
  "「凡益之道，與時偕行」者，雖施益无方，不可恒用，當應時行之，故舉「凡益」總結之，故曰「凡益之道，與時偕行」也。",
  "《象》曰：風雷，益。君子以見善則遷，有過則改。",
  "注云：遷善改過，益莫大焉。",
  "疏　正義曰：「風雷，益，君子以見善則遷，有過則改」者，《子夏傳》云：「雷以動之，風以散之，萬物皆益。」孟僖亦與此同其意。言必須雷動於前，風散於後，然後萬物皆益。如二月啟蟄之後，風以長物；八月收聲之後，風以殘物。風之為益，其在雷後，故曰「風雷，益」也。遷謂遷徙慕尚，改謂改更懲止，遷善改過，益莫大焉，故君子求益，以「見善則遷，有過則改」也。六子之中，並有益物，獨取雷風者，何晏云：「取其最長可久之義也。」",
  "初九，利用為大作，元吉无咎。",
  "注云：處益之初，居動之始，體夫剛德，以莅其事，而之乎巽，以斯大作，必獲大功。夫居下非厚事之地，在卑非任重之處，大作非小功所濟，故元吉，乃得无咎也。",
  "《象》曰：元吉无咎，下不厚事也。",
  "注云：時可以大作而下不可以厚事，得其時而无其處，故元吉，乃得无咎也。",
  "疏　正義曰：「利用為大作，元吉无咎」者，大作謂興作大事也。初九處益之初，居動之始，有興作大事之端，又體剛能幹，應巽不違，有堪建大功之德，故曰「利用為大作」也。然有其才而无其位，得其時而非其處，雖有殊功，人不與也。時人不與，則咎過生焉。故必「元吉」，乃得「无咎」，故曰「元吉，无咎」。",
  "《象》曰「下不厚事」者，厚事猶大事也。",
  "六二，或益之十朋之龜，弗克違，永貞吉。王用享于帝，吉。",
  "注云：以柔居中，而得其位，處內履中，居益以沖。益自外來，不召自至，不先不為，則朋龜獻策，同於損卦六五之位。位不當尊，故吉在永貞也。帝者，生物之主，興益之宗，出震而齊巽者也。六二居益之中，體柔當位，而應於巽，享帝之美，在此時也。",
  "《象》曰：或益之，自外來也。",
  "疏　正義曰：「或益之十朋之龜，弗克違，永貞吉。王用享于帝，吉」者，六二體柔居中，當位應巽，是居益而能用謙沖者也。居益用謙，則物自外來，朋龜獻策，弗能違也。同於損卦六五之位，故曰「或益之十朋之龜，弗克違」也。然位不當尊，故永貞乃吉，故曰「永貞吉」。帝，天也。王用此時，以享祭於帝，明靈降福，故曰「王用享於帝吉」也。",
  "《象》曰「自外來」者，明益之者從外自來，不召而至也。",
  "六三，益之用凶事，无咎。有孚，中行，告公用圭。",
  "注云：以陰居陽，求益者也，故曰益之。益不外來，己自為之，物所不與，故在謙則戮，救凶則免。以陰居陽，處下卦之上，壯之甚也，用救衰危，物所恃也，故用凶事，乃得无咎也。若能益不為私，志在救難，壯不至亢，不失中行，以此告公，國主所任也。用圭之禮，備此道矣。故曰有孚，中行告公用圭也。公者，臣之極也。凡事足以施天下，則稱王；次天下之大者，則稱公。六三之才，不足以告王，足以告公，而得用圭也。故曰｢中行，告公用圭｣也。",
  "《象》曰：益用凶事，固有之也。",
  "注云：用施凶事，乃得固有之也。",
  "疏　正義曰：「益之用凶事，无咎。有孚，中行，告公用圭」者，六三以陰居陽，不能謙退，是求益者也，故曰「益之」。益不外來，已自為之，物所不與。若以謙道責之，則理合誅戮。若以救凶原之，則情在可恕。然此六三，以陰居陽，處下卦之上，壯之甚也。用此以救衰危，則物之所恃，所以用凶事而得免咎，故曰「益之，用凶事，无咎」。若能求益不為私己，志在救難，為壯不至亢極，能適於時，是有信實而得中行，故曰「有孚中行」也。用此「有孚中行」之德，執圭以告於公，公必任之以救衰危之事，故曰「告公用圭」。",
  "《象》曰「固有之」者，明其為救凶，則不可求益；施之凶事，乃得固有其功也。",
  "注「公者臣之拯」至「用圭也」。正義曰：告王者宜以文德燮理，使天下人寧，不當恒以救凶，用志褊狹也。",
  "六四，中行，告公從，利用為依遷國。",
  "注云：居益之時，處巽之始，體柔當位，在上應下，卑不窮下，高不處亢，位雖不中，用中行者也。以斯告公，何有不從？以斯依遷，誰有不納也？",
  "《象》曰：告公從，以益志也。",
  "注云：志得益也。",
  "疏　正義曰：「中行，告公從，利用為依遷國」者，六四居益之時，處巽之始，體柔當位，在上應下，卑不窮下，高不處亢，位雖不中，用中行者也，故曰「中行」也。以此中行之德，有事以告於公，公必從之，故曰「告公從」也。用此道以依人而遷國者，人无不納，故曰「利用為依遷國」也。遷國，國之大事，明以中行，雖有大事，而无不利，如「周之東遷，晉鄭焉依」之義也。",
  "《象》曰「以益志」者，既為公所從，其志得益也。",
  "九五，有孚惠心，勿問元吉。有孚，惠我德。",
  "注云：得位履尊，為益之主者也。為益之大，莫大於信，為惠之大，莫大於心。因民所利而利之焉，惠而不費，惠心者也。信以惠心，盡物之願，固不待問而元吉。有孚，惠我德也，以誠惠物，物亦應之，故曰｢有孚，惠我德｣也。",
  "《象》曰：有孚惠心，勿問之矣。惠我德，大得志也。",
  "疏　正義曰：「有孚惠心，勿問元吉。有孚，惠我德」者，九五得位處尊，為益之主，兼弘德義，以益物者也。為益之大，莫大於信，為惠之大，莫大於心。因民所利而利之焉，惠而不費，惠心者也。有惠有信，盡物之願，必獲元吉，不待疑問，故曰「有孚惠心，勿問元吉」。我既以信，惠被於物，物亦以信，惠歸於我，故曰「有孚，惠我德」也。",
  "《象》曰「大得志」者，天下皆以信惠歸我，則可以得志於天下，故曰「大得志」也。",
  "上九，莫益之，或擊之，立心勿恒，凶。",
  "注云：處益之極，過盈者也。求益无已，心无恒者也。无厭之求，人弗與也。獨唱莫和，是偏辭也。人道惡盈，怨者非一，故曰｢或擊之｣也。",
  "《象》曰：莫益之，偏辭也。或擊之，自外來也。",
  "疏　正義曰：上九處益之極，益之過甚者也。求益无厭，怨者非一，故曰「莫益之，或擊之」也。勿猶无也，求益无己，是「立心无恒」者也。无恒之人，必凶咎之所集，故曰「立心勿恒，凶」。",
  "《象》曰「偏辭」者，此有求而彼不應，是偏辭也。「自外來」者，怨者非一，不待召也，故曰自外來也。"
]