[
  " ",
  "　 閱讀古書, 2, 3, 4, 5, 6, 7, 8",
  "　漸　艮下巽上",
  "漸，女歸吉，利貞。",
  "注云：漸者，漸進之卦也。止而巽，以斯適進，漸進者也。以止巽為進，故女歸吉也。進而用正，故利貞也。",
  "疏　正義曰：漸者，不速之名也。凡物有變移，徐而不速，謂之漸也。女歸吉者，歸嫁也。女人生有外成之義，以夫為家，故謂嫁曰歸也。婦人之嫁，備禮乃動，故漸之所施，吉在女嫁，故曰女歸吉也。利貞者，女歸有漸，得禮之正，故曰利貞也。",
  " ",
  "《彖》曰：漸之進也，",
  "注云：之於進也。",
  "女歸吉也。進得位，往有功也。進以正，可以正邦也。其位，剛得中也。",
  "注云：以漸進得位也。",
  "止而巽，動不窮也。",
  "疏　正義曰：「漸之進也」者，釋卦名也。漸是徐動之名，不當進退，但卦所名漸，是之於進也。",
  "「女歸吉也」者，漸漸而進之，施於人事，是女歸之吉也。「進得位，往有功也，進以正，可以正邦也」者，此就九五得位剛中釋利貞也。言進而得於貴位，是往而有功也。以六二適九五，是進而以正。身既得正，可以正邦也。「其位剛得中」者，此卦爻皆得位，上言進得位，嫌是兼二三四等，故特言剛得中，以明得位之言，唯是九五也。",
  "「止而巽，動不窮也」者，此就二體廣明漸進之美也。止不為暴，巽能用謙，以斯適進，物无違拒，故能漸而動，進不有困窮也。",
  " ",
  "《象》曰：山上有木，漸，君子以居賢德善俗。",
  "注云：賢德以止巽則居，風俗以止巽乃善。",
  "疏　正義曰：「山上有木，漸」者，木生山上，因山而高，非是從下忽高，故是漸義也。「君子以居賢德善俗」者，夫止而巽者，漸之美也。君子求賢得使居位，化風俗使清善，皆須文德謙下，漸以進之。若以卒暴威刑，物不從矣。",
  " ",
  "初六，鴻漸于干，小子厲，有言，无咎。",
  "注云：鴻，水鳥也。適進之義，始於下而升者也，故以鴻為喻。六爻皆以進而履之為義焉，始進而位乎窮下，又无其應。若履于干，危不可以安也。始進而未得其位，則困於小子，窮於謗言，故曰小子厲有言也。困於小子讒諛之言，未傷君子之義，故曰无咎也。",
  "《象》曰：小子之厲，義无咎也。",
  "疏　正義曰：「鴻漸於干」者，鴻，水鳥也。干，水涯也。漸進之道，自下升高，故取譬。鴻飛，自下而上也。初之始進，未得祿位，上无應援，體又窮下，若鴻之進於河之干，不得安寧也，故曰鴻漸於干也。「小子厲有言，无咎」者，始進未得顯位，易致陵辱，則是危於小子，而被毀於謗言，故曰小子厲有言。小人之言，未傷君子之義，故曰无咎。",
  "《象》曰「義无咎」者，備如經釋。",
  " ",
  "六二，鴻漸于磐，飲食衎衎，吉。",
  "注云：磐，山石之安者也。進而得位，居中而應，本无祿養，進而得之，其為歡樂，願莫先焉。",
  "《象》曰：飲食衎衎，不素飽也。",
  "疏　正義曰：「鴻漸于磐，飲食衎衎，吉」者，磐，山石之安者也。衎衎，樂也。六二進而得位，居中而應，得可安之地，故曰鴻漸於磐。既得可安之地，所以飲食衎衎然，樂而獲吉福也，故曰「鴻漸於磐，飲食衎衎吉」也。",
  "《象》曰「不素飽」者，素，故也，故无祿養，今日得之，故「願莫先焉」。",
  "注「磐，山石之安者也」。　正義曰：馬季長云：「山中石磐紆，故稱磐也」。鴻是水鳥，非是集於山石陵陸之禽，而爻辭以此言鴻漸者，蓋漸之為義，漸漸之於高，故取山石陵陸，以應漸高之義，不復係水鳥也。",
  " ",
  "九三，鴻漸于陸。夫征不復，婦孕不育，凶。利禦寇。",
  "注云：陸，高之頂也。進而之陸，與四相得，不能復反者也。夫征不復，樂於邪配，則婦亦不能執貞矣。非夫而孕，故不育也。三本艮體，而棄乎群醜，與四相得，遂乃不反，至使婦孕不育，見利忘義，貪進忘舊，凶之道也。異體合好，順而相保，物莫能間，故利禦寇也。",
  "《象》曰：夫征不復，離群醜也。婦孕不育，失其道也。利用禦寇，順相保也。",
  "疏　正義曰：「鴻漸于陸，夫征不復，婦孕不育，凶」者，陸，高之頂也。九三居下體之上，是進而得高之象，故曰鴻漸于陸也。進而之陸，无應於上，與四相比，四亦无應，近而相得。三本是艮體，與初二相同一家，棄其群類，而與四合好，即是夫征而不反復也。夫既樂於邪配，妻亦不能保其貞。非夫而孕，故不育也。見利忘義，貪進忘舊，凶之道也，故曰「夫征不復，婦孕不育，凶」也。「利禦寇」者，異體合好，恐有寇難離間之者，然和比相順，共相保安，物莫能間，故曰利用禦寇也。",
  "《象》曰「離群醜」者，醜，類也。言三與初二，雖有陰陽之殊，同體艮卦，故謂之群醜也。失其道也者，非夫而孕，孕而不育，失道故也。順相保也者，謂四以陰乘陽，嫌其非順，然好合相得，和比相安，故曰順相保也。",
  "注「陸，高之頂也」。　正義曰：《爾雅》云「高平曰陸」，故曰高之頂也。",
  " ",
  "六四，鴻漸于木。或得其桷，无咎。",
  "注云：鳥而之木，得其宜也。或得其桷，遇安棲也。雖乘于剛，志相得也。",
  "《象》曰：或得其桷，順以巽也。",
  "疏　正義曰：鴻漸于木者，鳥而之木，得其宜也。六四進而得位，故曰鴻漸於木也。或得其桷无咎者，桷，榱也。之木而遇堪為桷之枝，取其易直可安也。六四與三相得，順而相保，故曰或得其桷。既與相得，无乘剛之咎，故曰无咎。",
  "《象》曰「順以巽也」者，言四雖乘三體，巽而下附，三雖被乘，上順而相保，所以六四得其安栖，由順以巽也。",
  " ",
  "九五，鴻漸于陵。婦三歲不孕，終莫之勝，吉。",
  "注云：陵，次陸者也。進得中位，而隔乎三四，不得與其應合，故婦三歲不孕也。各履正而居中，三四不能久塞其塗者也。不過三歲，必得所願矣。進以正邦，三年有成，成則道濟，故不過三歲也。",
  "《象》曰：終莫之勝吉，得所願也。",
  "疏　正義曰：「鴻漸于陵」者，陵，次陸者也。九五進於中位，處於尊高，故曰鴻漸于陵。婦三歲不孕者，有應在二而隔乎三、四，不得與其應合，是二、五情意徒相感說，而隔礙不交，故曰婦三歲不孕也。「終莫之勝，吉」者，然二與五合，各履正而居中，三、四不能久塞其路，終得遂其所懷，故曰「終莫之勝，吉」也。",
  "《象》曰「得所願也」者，所願在於與二合好，既各履中正，无能勝之，故終得其所願也。",
  "注「進以正邦，三年有成」。　正義曰：九五居尊得位，故曰進以正邦也。三歲有成，則三、四不敢塞其路，故曰不過三歲也。",
  " ",
  "上九，鴻漸于陸。其羽可用為儀，吉。",
  "注云：進處高絜，不累於位，无物可以屈其心而亂其志。峨峨清遠，儀可貴也，故曰「其羽可用為儀，吉」。",
  "《象》曰：其羽可用為儀，吉，不可亂也。",
  "疏　正義曰：鴻漸于陸者，上九與三皆處卦上，故並稱陸。上九最居上極，是進處高潔，故曰鴻漸于陸也。「其羽可用為儀，吉」者，然居无位之地，是不累於位者也。處高而能不以位自累，則其羽可用為物之儀表，可貴可法也，故曰「其羽可用為儀，吉」也。必言羽者，既以鴻明漸，故用羽表儀也。",
  "《象》曰「不可亂也」者，進處高絜，不累於位，无物可以亂其志也。",
  " "
]