[
  " ",
  "　 閱讀古書, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13",
  "　訟卦　坎下乾上",
  "訟，有孚，窒惕，中吉。",
  "注云：窒謂窒塞也。皆惕，然後可以獲中吉。",
  "終凶。利見大人，不利涉大川。",
  "疏　正義曰：「訟，有孚，窒惕，中吉」者，窒，塞也。惕，懼也。凡訟者，物有不和，情相乖爭而致其訟。凡訟之體，不可妄興，必有信實，被物止塞，而能惕懼，中道而止，乃得吉也。",
  "「終凶」者，訟不可長，若終竟訟事，雖復窒惕，亦有凶也。「利見大人」者，物既有訟，須大人決之，故「利見大人」也。「不利涉大川」者，以訟不可長，若以訟而往涉危難，必有禍患，故「不利涉大川」。",
  " ",
  "《彖》曰：訟，上剛下險，險而健，訟。訟有孚窒惕中吉，剛來而得中也。終凶，訟不可成也。利見大人，尚中正也。不利涉大川，入于淵也。",
  "注云：凡不和而訟，无施而可，涉難特甚焉。唯有信而見塞懼者，乃可以得吉也。猶復不可終，中乃吉也。不閉其源，使訟不至，雖每不枉，而訟至終竟，此亦凶矣。故雖復有信，而見塞懼，猶不可以為終也。故曰「訟有孚，窒惕，中吉，終凶」也。无善聽者，雖有其實，何由得明？而令有信塞懼者得其中吉，必有善聽之主焉，其在二乎？以剛而來正夫群小，斷不失中，應斯任也。",
  "疏　正義曰：此釋繇辭之義。「訟，上剛下險，險而健，訟」者，上剛即乾也，下險即坎也，猶人意懷險惡，性又剛健，所以訟也。此二句因卦之象以顯有訟之所由。案：上「需」，須也，以釋卦之名。此訟卦不釋「訟」名者，訟義可知，故不釋也。諸卦其名難者則釋之，其名易者則不釋之，他皆倣此。「訟有孚，窒惕中吉，剛來而得中」者，先疊出訟之繇辭，以「剛來而得中」者，釋所以訟得其「有孚，窒惕中吉」者，言中九二之剛，來向下體而處下卦之中，為訟之主，而聽斷獄訟，故訟者得其有孚窒惕中吉也。「終凶，訟不可成」者，釋「終凶」之義，以爭訟之事，不可使成，故終凶也。「利見大人，尚中正」者，釋「利見大人」之義。所以於訟之時，利見此大人者，以時方鬪爭，貴尚居中得正之主而聽斷之。「不利涉大川，入于淵」者，釋「不利涉大川」之義。若以訟事往涉于川，即必墜于深淵而陷于難也。",
  "注「凡不和」至「應斯任」。　正義曰：「无施而可」者，言若性好不和，又與人鬪訟，即无處施設而可也。言所往之處皆不可也。「涉難特甚焉」者，言好訟之人，習常施為，己且不可，若更以訟涉難，其不可特甚焉，故云「涉難特甚焉」。「中乃吉」者，謂此訟事以中途而止，乃得吉也。前注云「可以獲中吉」。謂獲中止之吉。「不閉其源，使訟不至」者，若能謙虛退讓，與物不競，即此是閉塞訟之根源，使訟不至也。今不能如此，是不閉塞訟源，使訟得至也。「雖每不枉而訟至終竟」者，謂雖每訴訟陳其道理，不有枉曲，而訟至終竟，此亦凶矣。",
  "《象》曰：天與水違行，訟。君子以作事謀始。",
  "注云：「聽訟，吾猶人也。必也使无訟乎？」无訟在於謀始，謀始在於作制。契之不明，訟之所以生也。物有其分，職不相濫，爭何由興？訟之所以起，契之過也。故有德司契而不責於人。",
  "疏　正義曰：天道西轉，水流東注，是天與水相違而行，相違而行，象人彼此兩相乖戾，故致訟也。不云「水與天違行」者，凡訟之所起，必剛健在先，以為訟始，故云「天與水違行」也。「君子以作事謀始」者，物既有訟，言君子當防此訟源。凡欲興作其事，先須謀慮其始。若初始分職分明，不相干涉，即終无所訟也。",
  "注「聽訟」至「不責於人」。　正義曰：「訟之所以起，契之過」者，凡鬪訟之起，只由初時契要之過，謂作契要不分明。「有德司契」者，言上之有德司主契要，而能使分明以斷於下，亦不須責在下之人有爭訟也。「有德司契」之文，出《老子》經也。",
  " ",
  "初六，不永所事，小有言，終吉。",
  "注云：處訟之始，訟不可終，故不永所事，然後乃吉。凡陽唱而陰和，陰非先唱者也。四召而應，見犯乃訟。處訟之始，不為訟先，雖不能不訟，而了訟必辯明也。",
  "《象》曰：不永所事，訟不可長也。雖小有言，其辯明也。",
  "疏　正義曰：「不永所事」者，永，長也，不可長久為鬪訟之事，以訟不可終也。「小有言，終吉」者，言初六應于九四。然九四剛陽，先來非理犯己，初六陰柔，見犯乃訟，雖不能不訟，是不獲己而訟也，故小有言。以處訟之始，不為訟先，故終吉。",
  "《象》曰「訟不可長」者，釋「不永所事」，以訟不可長，故不長此鬪爭之事。「其辯明」者，釋「小有言」，以訟必辯析分明。四雖初時犯己，己能辯訟，道理分明，故初時小有言也。",
  "注「處訟之始不為訟先」者。　正義曰：「處訟之始」者，始入訟境，言訟事尚微，故云「處訟之始」也。「不為訟先」者，言己是陰柔，待唱乃和，故云不為訟先也。",
  " ",
  "九二，不克訟，歸而逋其邑。人三百戶，无眚。",
  "注云：以剛處訟，不能下物，自下訟上，宜其不克。若能以懼歸竄其邑，乃可以免災。邑過三百，非為竄也。竄而據強，災未免也。",
  "《象》曰：不克訟，歸逋竄也。自下訟上，患至掇也。",
  "疏　正義曰：「不克訟」者，克，勝也；以剛處訟，不能下物，自下訟上，與五相敵，不勝其訟，言訟不得勝也。「歸而逋其邑」者，訟既不勝，怖懼還歸，逋竄其邑。若其邑強大，則大都偶國，非逋竄之道。「人三百戶，无眚」者，若其邑狹少，唯三百戶乃可也。「三百戶」者，鄭注《禮記》云：「小國下大夫之制。」又鄭注《周禮．小司徒》云：方十里為成九百夫之地，溝渠、城郭、道路三分去其一，餘六百夫。又以田有不易，有一易，有再易，定受田三百家。即此「三百戶」者，一成之地也。鄭注云：不易之田，歲種之；一易之田，休一歲乃種；再易之地，休二歲乃種。言至薄也。苟自藏隱，不敢與五相敵，則无災眚。",
  "《象》曰「歸逋竄」者，釋歸而逋邑，以訟之不勝，故退歸逋竄也。「患至掇」者，掇猶拾掇也。自下訟上，悖逆之道，故禍患來至，若手自拾掇其物，言患必來也。故王肅云：「若手拾掇物然。」",
  "注「以剛」至「災未免也」。　正義曰：「若能以懼歸竄其邑，乃可免災」者，如此注意，則經稱「其邑」二字連上為句，「人三百戶」合下為句。",
  " ",
  "六三，食舊德，貞厲，終吉。或從王事，无成。",
  "注云：體夫柔弱，以順於上，不為九二，自下訟上，不見侵奪，保全其有，故得食其舊德而不失也。居爭訟之時，處兩剛之間，而皆近不相得，故曰貞厲。柔體不爭，繫應在上，眾莫能傾，故曰終吉。上壯爭勝，難可忤也，故或從王事，不敢成也。",
  "《象》曰：食舊德，從上吉也。",
  "疏　正義曰：「食舊德」者，六三以陰柔順從上九，不為上九侵奪，故保全己之所有，故食其舊日之德祿位。「貞厲」者，貞，正也；厲，危也。居爭訟之時，處兩剛之間，故須貞正自危厲，故曰貞厲。然六三柔體不爭，係應在上，眾莫能傾，故終吉也。「或從王事无成」者，三應於上，上則壯而又勝，故六三或從上九之王事，不敢觸忤，无敢先成，故云无成。",
  "《象》曰：「從上吉」者，釋所以食舊德以順從上九，故得其吉，食舊德也。",
  "九四，不克訟。",
  "初辯明也。",
  "復即命渝，安貞吉。",
  "注云：處上訟下，可以改變者也，故其咎不大。若能反從本理，變前之命，安貞不犯，不失其道，為仁由己，故吉從之。",
  "《象》曰：復即命渝，安貞不失也。",
  "疏　正義曰：「不克訟」者，九四既非理陵犯於初，初能分辯道理，故九四訟不勝也。",
  "「復即命渝」者，復，反也；即，就也。九四訟既不勝，若能反就本理，變前與初爭訟之命，能自渝變休息，不與初訟，故云「復即命渝」。「安貞吉」者，既能反從本理，渝變往前爭訟之命，即得安居貞吉。",
  "《象》曰：「安貞不失」者，釋「復即命渝」之義，以其反理變命，故得安貞之吉，不失其道。",
  "注「處上」至「吉從之」。　正義曰：「若能反從本理」者，釋「復即」之義。復，反也；即，從也。本理謂原本不與初訟之理。當反從此原本不爭之理，故云「反從本理」。「變前之命」者，解「命渝」也。渝，變也。但倒經渝字在命上，故云「變前之命」。「前命」者，謂往前共初相訟之命也，今乃變之也。「安貞不犯」者，謂四安居貞正，不復犯初，故云「安貞不犯」。「為仁由己，故吉從之」者，「為仁由己」，《論語》文。初不犯己，己莫陵於初，是為仁義之道，自由於己，故云「為仁由己」。",
  " ",
  "九五，訟元吉。",
  "注云：處得尊位，為訟之主，用其中正以斷枉直，中則不過，正則不邪，剛无所溺，公无所偏，故訟元吉。",
  "《象》曰：訟元吉，以中正也。",
  "疏　正義曰：「訟元吉」者，處得尊位，中而且正，以斷獄訟，故得元吉也。",
  "《象》曰：「以中正也」者，釋「元吉」之義。所以訟得大吉者，以九五處中而得正位，中則不有過差，正則不有邪曲，中正為德，故元吉。",
  "注「處得」至「元吉」。　正義曰：「處得尊位為訟之主」者，居九五之位，當爭訟之時，是主斷獄訟者也。然此卦之內，斷獄訟之人，凡有二主。案上注云「善聽之主，其在二乎」？是二為主也。此注又云「為訟之主，用其中正以斷枉直」，是五又為主也。一卦兩主者，凡諸卦之內，如此者多矣。五是其卦尊位之主，餘爻是其卦為義之主，猶若復卦初九是復卦之主，復義在于初九也。六五亦居復之尊位，為復卦尊位之主，如此之例，非一卦也。所以然者，五居尊位，猶若天子總統萬機，與萬物為主，故諸卦皆五居尊位。諸爻則偏主一事，猶若六卿春官主禮，秋官主刑之類，偏主一事，則其餘諸爻各主一事也。即六卿總歸於天子，諸卦之爻，皆以九五為尊位也。若卦由五位，五又居尊，正為一主也，若比之九五之類是也。今此訟卦二既為主，五又為主，皆有斷獄之德，其五與二爻，其義同然也，故俱以為主也。案：上《彖》辭「剛來而得中」，今九五《象》辭云「訟元吉，以中正」，何知《彖》辭「剛來得中」，非據九五也。輔嗣必以為九二者，凡上下二象，在於下象者則稱「來」。故《賁卦》云「柔來而文剛」，是離下艮上而稱「柔來」。今此云「剛來而得中」，故知九二也。且凡云「來」者，皆據異類而來。九二在二陰之中故稱「來」；九五在外卦，又三爻俱陽，不得稱「來」。若於爻辭之中，亦有從下卦向上卦稱「來」也。故需上六「有不速之客三人來」，謂下卦三陽來。然需上六陰爻，陽來詣之，亦是往非類而稱「來」也。「以斷枉直」者，枉，曲也。凡二人來訟，必一曲一直，此九五聽訟能斷定曲直者，故云「以斷枉直」。",
  " ",
  "上九，或錫之鞶帶，終朝三褫之。",
  "注云：處訟之極，以剛居上，訟而得勝者也。以訟受錫，榮何可保？故終朝之間，褫帶者三也。",
  "《象》曰：以訟受服，亦不足敬也。",
  "疏　正義曰：「或錫之鞶帶」者，上九以剛居上，是訟而得勝者也。若以謙讓蒙錫，則可長保。有若因訟而得勝，雖或錫與鞶帶，不可長久，終一朝之間三被褫脫，故云「終朝三褫之」。",
  "《象》曰「以訟受服，亦不足敬」者，「釋終朝三褫」之義。以其因訟得勝，受此錫服，非德而受，亦不足可敬，故終朝之間，三被褫脫也。凡言「或」者，或之言有也。言或有如此，故言或。則上云「或從王事无成」，及《坤》之六三「或從王事无成」之類是也。鞶帶謂大帶也。故杜元凱桓二年《傳》「鞶厲旒纓」注云：「鞶，大帶也。」此訟一卦及爻辭並以人事明之，唯「不利涉大川」，假外物之象以喻人事。",
  " ",
  "周易注疏卷第二"
]