[
  " ",
  "　 閱讀古書, 2, 3, 4, 5, 6, 7, 8, 9",
  "　未濟　坎下離上",
  "未濟，亨，小狐汔濟，濡其尾，无攸利。",
  "疏　正義曰：「未濟，亨」者，未濟者未能濟渡之名也。未濟之時，小才居位，不能建功立德，拔難濟險。若能執柔用中，委任賢哲，則未濟有可濟之理，所以得通，故曰「未濟，亨」。「小狐汔濟，濡其尾，无攸利」者，汔者，將盡之名。小才不能濟難，事同小狐雖能渡水，而无餘力，必須水汔，方可涉川。未及登岸，而濡其尾，濟不免濡，豈有所利？故曰「小狐汔濟，濡其尾，无攸利」也。",
  "《彖》曰：未濟，亨，柔得中也。",
  "注云：以柔處中，不違剛也。能納剛健，故得亨也。",
  "小狐汔濟，未出中也。",
  "注云：小狐不能涉大川，須汔然後乃能濟。處未濟之時，必剛健拔難，然後乃能濟，汔乃能濟，未能出險之中。",
  "濡其尾，无攸利，不續終也。",
  "注云：小狐雖能渡而无餘力。將濟而濡其尾，力竭於斯，不能續終。險難猶未足以濟也。濟未濟者，必有餘力也。",
  "雖不當位，剛柔應也。",
  "注云：位不當，故未濟。剛柔應，故可濟。",
  "疏　正義曰：「未濟，亨，柔得中也」者，此就六五以柔居中，下應九二，釋未濟所以得亨，柔而得中，不違剛也。與二相應，納剛自輔，故於未濟之世，終得亨通也。",
  "「小狐汔濟，未出中也」者，釋小狐涉川，所以必須水汔乃濟，以其力薄，未能出險之中故也。",
  "「濡其尾，无攸利，不續終」者，濡尾力竭，不能相續而終至於登岸，所以无攸利也。",
  "「雖不當位，剛柔應」者，重釋未濟之義，凡言未者，今日雖未濟，復有可濟之理。以其不當其位，故即時未濟；剛柔皆應，是得相拯，是有可濟之理。故稱未濟，不言不濟也。",
  "《象》曰：火在水上，未濟，君子以慎辨物居方。",
  "注云：辨物居方，令物各當其所也。",
  "疏　正義曰：「火在水上未濟」者，火在水上，不成烹飪，未能濟物。故曰「火在水上，未濟」。「君子以慎辨物居方」者，君子見未濟之時，剛柔失正，故用慎為德，辨別眾物，各居其方，使皆得安其所，所以濟也。",
  "初六，濡其尾，吝。",
  "注云：處未濟之初，最居險下，不可以濟者也。而欲之其應，進則溺身。未濟之始，始於既濟之上六也。濡其首猶不反，至于濡其尾，不知紀極者也。然以陰處下，非為進亢，遂其志者也。困則能反，故不曰凶。事在己量，而必困乃反，頑亦甚矣，故曰吝也。",
  "《象》曰：濡其尾，亦不知極也。",
  "疏　○正義曰：「濡其尾，吝」者，初六處未濟之初，最居險下，而欲上之其應，進則溺身，如小狐之渡川，濡其尾也。未濟之始，始於既濟之上六也。既濟上六，但云「濡其首」，言始入於難，未沒其身。此言「濡其尾」者，進不知極已沒其身也。然以陰處下，非為進亢，遂其志者也。困則能反，故不曰凶。不能豫昭事之幾萌，困而後反，頑亦甚矣，故曰吝也。",
  "《象》曰「亦不知極」者，未濟之初，始於既濟之上六，濡首而不知，遂濡其尾，故曰不知極也。",
  "○注「不知紀極」者。○正義曰：《春秋傳》曰「聚斂積實，不知紀極，謂之饕餮」，言无休已也。",
  "九二，曳其輪，貞吉。",
  "注云：體剛履中，而應於五，五體陰柔，應與而不自任者也。居未濟之時，處險難之中，體剛中之質，而見任與，拯救危難，經綸屯蹇者也。用健拯難*，靖難*在正，而不違中，故「曳其輪，貞吉」也。",
  "*拯難原文誤作「施難」。",
  "*「靖難」或作「循難」。",
  "《象》曰：九二貞吉，中以行正也。",
  "注云：位雖不正，中以行正也。",
  "疏　正義曰：「曳其輪，貞吉」者，九二居未濟之時，處險難之內，體剛中之質，以應於五。五體陰柔，委任於二，令其濟難者也。經綸屯蹇，任重憂深，故曰曳其輪。「曳其輪」者，言其勞也。靖難在正，然後得吉，故曰「曳其輪，貞吉」也。",
  "《象》曰「中以行正」者，釋九二失位而稱貞吉者，位雖不正，以其居中，故能行正也。",
  "六三，未濟，征凶，利涉大川。",
  "注云：以陰之質，失位居險，不能自濟者也。以不正之身，力不能自濟，而求進焉，喪其身也。故曰征凶也。二能拯難，而己比之，棄己委二，載二而行，溺可得乎？何憂未濟，故曰利涉大川。",
  "《象》曰：未濟征凶，位不當也。",
  "疏　正義曰：「未濟征凶」者，六三以陰柔之質，失位居險，不能自濟者也。身既不能自濟，而欲自進求濟，必喪其身。故曰「未濟，征凶」也。「利涉大川」者，二能拯難，而己比之，若能棄己委二，則沒溺可免，故曰利涉大川。",
  "《象》曰「位不當」者，以不當其位，故有征則凶。",
  "九四，貞吉，悔亡。震用伐鬼方，三年有賞于大國。",
  "注云：處未濟之時，而出險難之上，居文明之初，體乎剛質，以近至尊。雖履非其位，志在乎正，則吉而悔亡矣。其志得行，靡禁其威，故曰「震用伐鬼方」也。「伐鬼方」者，興衰之征也。故每至興衰而取義焉。處文明之初，始出於難，其德未盛，故曰三年也。五居尊以柔，體乎文明之盛，不奪物功者也，故以大國賞之也。",
  "《象》曰：貞吉悔亡，志行也。",
  "疏　正義曰：居未濟之時，履失其位，所以為悔。但出險難之外，居文明之初，以剛健之質，接近至尊，志行其正，正則貞吉而悔亡，故曰貞吉、悔亡。正志既行，靡禁其威，故震發威怒，用伐鬼方也。然處文明之初，始出於險，其德未盛，不能即勝，故曰三年也。五以順柔文明而居尊位，不奪物功。九四既克而還，必得百里大國之賞，故曰「有賞於大國」也。",
  "《象》曰「志行」者，釋九四失位而得貞吉悔亡者也。以其正志得行，而終吉故也。",
  "六五，貞吉，无悔。君子之光，有孚，吉。",
  "注云：以柔居尊，處文明之盛，為未濟之主，故必正然後乃吉，吉乃得无悔也。夫以柔順文明之質，居於尊位，付與於能，而不自役，使武以文，御剛以柔，斯誠君子之光也。付物以能，而不疑也，物則竭力，功斯克矣，故曰「有孚，吉。」",
  "《象》曰：君子之光，其暉吉也。",
  "疏　正義曰：「貞吉，无悔」者，六五以柔居尊，處文明之盛，為未濟之主，故必正然後乃吉，吉乃得无悔，故曰「貞吉，无悔」也。「君子之光」者，以柔順文明之質，居於尊位，有應於二，是能付物以能，而不自役，有君子之光華矣，故曰「君子之光」也。「有孚，吉」者，付物以能而无疑焉，則物竭其誠，功斯克矣，故曰「有孚，吉」也。",
  "《象》曰「其暉吉」者，言君子之德，光暉著見，然後乃得吉也。",
  "上九，有孚于飲酒，无咎。濡其首，有孚失是。",
  "注云：未濟之極，則反於既濟。既濟之道，所任者當也。所任者當，則可信之无疑，而己逸焉，故曰「有孚於飲酒，无咎」也。以其能信於物，故得逸豫而不憂於事之廢。苟不憂於事之廢，而耽於樂之甚，則至於失節矣。由於有孚，失於是矣，故曰「濡其首，有孚，失是」也。",
  "《象》曰：飲酒濡首，亦不知節也。",
  "疏　正義曰：「有孚于飲酒，无咎」者，上九居未濟之極，則反於既濟。既濟之道，則所任者當也。所任者當，則信之无疑，故得自逸飲酒而已，故曰「有孚于飲酒，无咎」。「濡其首」者，既得自逸飲酒，而不知其節，則濡首之難，還復及之，故曰「濡其首」也。「有孚，失是」者，言所以濡首之難，及之者，良由信任得人，不憂事廢，故失於是矣。故曰「有孚，失是」也。",
  "《象》曰「亦不知節」者，釋飲酒所以致濡首之難，以其不知止節故也。"
]