[
  " ",
  "　 乾卦 　乾下乾上",
  "乾，元亨利貞。 初九，潛龍勿用。",
  "【注】文言備矣。",
  " ",
  "九二，見龍在田，利見大人。",
  "【注】出潛離隱，故曰「見龍」；處於地上，故曰「在田」。德施周普，居中不偏，雖非君位，君之德也。初則不彰，三則乾乾，四則或躍，上則過亢。利見大人，唯二、五焉。",
  " ",
  "九三，君子終日乾乾，夕惕若厲，无咎。",
  "【注】處下體之極，居上體之下，在不中之位，履重剛之險。上不在天，未可以安其尊也。下不在田，未可以寧其居也。純修下道，則居上之德廢；純修上道，則處下之禮曠。故終日乾乾，至於夕惕猶若厲也。居上不驕，在下不憂，因時而惕，不失其幾，雖危而勞，可以无咎。處下卦之極，愈於上九之亢，故竭知力而後免於咎也。乾三以處下卦之上，故免亢龍之悔。坤三以處下卦之上，故免龍戰之災。",
  " ",
  "九四，或躍在淵，无咎。",
  "【注】去下體之極，居上體之下，乾道革之時也。上不在天，下不在田，中不在人，履重剛之險，而无定位所處，斯誠進退无常之時也。近乎尊位，欲進其道，迫乎在下，非躍所及。欲靜其居，居非所安，持疑猶豫，未敢決志。用心存公，進不在私，疑以為慮，不謬於果，故无咎也。",
  " ",
  "九五，飛龍在天，利見大人。",
  "【注】不行不躍而在乎天，非飛而何？故曰飛龍也。龍德在天，則大人之路亨也。夫位以德興，德以位敘，以至德而處盛位，萬物之覩，不亦宜乎！",
  " ",
  "上九，亢龍有悔。",
  "用九，見群龍无首，吉。",
  "【注】九，天之德也。能用天德，乃見群龍之義焉。夫以剛健而居人之首，則物之所不與也。以柔順而為不正，則佞邪之道也。故乾吉在无首，坤利在永貞。",
  " ",
  "彖曰：大哉乾元，萬物資始，乃統天。雲行雨施，品物流形。大明終始，六位時成，時乘六龍以御天。乾道變化，各正性命。",
  "【注】天也者，形之名也。健也者，用形者也。夫形也者，物之累也。有天之形而能永保无虧，為物之首，統之者豈非至健哉！大明乎終始之道，故六位不失其時而成，升降无常，隨時而用，處則乘潛龍，出則乘飛龍，故曰「時乘六龍」也。乘變化御大器，靜專動直，不失太和，豈非正性命之情者邪！",
  " ",
  "保合大和，乃利貞。",
  "【注】不和而剛暴。",
  " ",
  "首出庶物，萬國咸寧。",
  "【注】萬國所以寧，各以有君也。",
  " ",
  "象曰：天行健，君子以自強不息。 潛龍勿用，陽在下也。 見龍在田，德施普也。 終日乾乾，反復道也。",
  "【注】以上言之則不驕，以下言之則不憂，反覆皆道也。",
  " ",
  "或躍在淵，進，无咎也。 飛龍在天，大人造也。 亢龍有悔，盈不可久也。 用九，天德，不可為首也。",
  "文言曰：元者善之長也，亨者嘉之會也，利者義之和也，貞者事之幹也。君子體仁足以長人，嘉會足以合禮，利物足以和義，貞固足以幹事。君子行此四德者，故曰：乾，元亨利貞。",
  "初九曰：「潛龍勿用」何謂也？子曰：「龍德而隱者也。不易乎世。",
  "【注】不為世俗所移易也。",
  " ",
  "不成乎名，遯世无悶，不見是而无悶。樂則行之，憂則違之，確乎其不可拔，潛龍也。」",
  "九二曰：「見龍在田，利見大人。」何謂也？子曰：「龍德而正中者也。庸言之信，庸行之謹，閑邪存其誠，善世而不伐，德博而化。易曰：『見龍在田，利見大人。』君德也。」",
  "九三曰：「君子終日乾乾，夕惕若厲，无咎。」何謂也？子曰：「君子進德修業。忠信，所以進德也；修辭立其誠，所以居業也。知至至之，可與幾也。知終終之，可與存義也。",
  "【注】處一體之極，是至也。居一卦之盡，是終也。處事之至而不犯咎，知至者也。故可與成務矣。處終而能全其終，知終者也。夫進物之速者，義不若利，存物之終者，利不及義。故靡不有初，鮮克有終。夫可與存義者，其唯知終者乎。",
  " ",
  "是故居上位而不驕，在下位而不憂。",
  "【注】居下體之上，在上體之下，明夫終敝，故不驕也；知夫至至，故不憂也。",
  " ",
  "故乾乾因其時而惕，雖危无咎矣。",
  "【注】惕，怵惕之謂也。處事之極，失時則廢，懈怠則曠。故因其時而惕，雖危无咎。",
  " ",
  "九四曰：「或躍在淵，无咎。」何謂也？子曰：「上下无常，非為邪也；進退无恒，非離群也。君子進德修業，欲及時也，故无咎。」",
  "九五曰：「飛龍在天，利見大人。」何謂也？子曰：「同聲相應，同氣相求；水流濕、火就燥、雲從龍、風從虎。聖人作而萬物覩，本乎天者親上，本乎地者親下．則各從其類也。」",
  "上九曰：「亢龍有悔」何謂也？子曰：「貴而无位，高而无民。",
  "【注】下无陰也。",
  " ",
  "賢人在下位而无輔，",
  "【注】賢人雖在下而當位，不為之助。",
  " ",
  "是以動而有悔也。」",
  "【注】處上卦之極而不當位，故盡陳其闕也。獨立而動物莫之與矣。《乾．文言》首不論乾而先說元，下乃曰乾，何也？夫乾者統行四事者也。君子以自強不息，行此四者，故首不論乾而下曰「乾，元亨利貞」。餘爻皆說龍，至於九三獨以君子為目，何也？夫易者象也。象之所生，生於義也。有斯義，然後明之以其物，故以龍敘乾，以馬敘坤，隨其事義而取象焉。是故初九、九二，龍德皆應其義，故可論龍以明之也。至於九三「乾乾夕惕」，非龍德也，明以君子當其象矣。統而舉之，乾體皆龍，別而敘之，各隨其義。",
  " ",
  "潛龍勿用，下也。見龍在田，時舍也。 終日乾乾，行事也。 或躍在淵，自試也。 飛龍在天，上治也。 亢龍有悔，窮之災也。 乾元用九，天下治也。",
  "【注】此一章全以人事明之也。九，陽也。陽，剛直之物也。夫能全用剛直，放遠善柔，非天下至理，未之能也。故乾元用九，則天下治也。夫識物之動，則其所以然之理，皆可知也。龍之為德，不為妄者也。潛而勿用，何乎？必窮處於下也。見而在田，必以時之通舍也。以爻為人，以位為時，人不妄動，則時皆可知也。文王明夷，則主可知矣。仲尼旅人，則國可知矣。",
  " ",
  "潛龍勿用，陽氣潛藏。 見龍在田，天下文明。 終日乾乾，與時偕行。",
  "【注】與天時俱不息。",
  " ",
  "或躍在淵，乾道乃革。 飛龍在天，乃位乎天德。 亢龍有悔，與時偕極。",
  "【注】與時運俱終極。",
  " ",
  "乾元用九，乃見天則。",
  "【注】此一章全說天氣以明之也。九，剛直之物，唯乾體能用之，用純剛以觀天，天則可見矣。",
  " ",
  "乾元者，始而亨者也。利貞者，性情也。",
  "【注】不為乾元，何能通物之始？不性其情，何能久行其正？是故始而亨者，必乾元也；利而正者，必性情也。",
  " ",
  "乾，始能以美利利天下，不言所利，大矣哉！大哉乾乎！剛健中正，純綷精也。六爻發揮，旁通情也。時乘六龍，以禦天也。雲行雨施，天下平也。 君子以成德為行，日可見之行也。 潛之為言也，隱而未見，行而未成，是以君子弗用也。 ",
  "君子，學以聚之、問以辯之、",
  "【注】以君德而處下體，資納於物者也。",
  " ",
  "寬以居之、仁以行之。易曰：「見龍在田，利見大人。」君德也。",
  "九三重剛而不中，上不在天，下不在田。故乾乾，因其時而惕，雖危无咎矣。",
  "九四重剛而不中，上不在天，下不在田，中不在人，故或之。或之者，疑之也，故无咎。",
  "夫大人者，與天地合其德，與日月合其明，與四時合其序，與鬼神合其吉凶。先天而天弗違，後天而奉天時，天且弗違，而況於人乎？況於鬼神乎？",
  "亢之為言也，知進而不知退，知存而不知亡，知得而不知喪。其唯聖人乎，知進退存亡而不失其正者，其唯聖人乎！",
  " "
]