[
  " ",
  "　 坤卦 　坤下坤上 ",
  "坤，元亨，利牝馬之貞。 ",
  "【注】坤貞之所利，利於牝馬也。馬在下而行者也，而又牝焉，順之至也。至順而後乃亨，故唯利於牝馬之貞。",
  " ",
  "君子有攸往，先迷後得，主利。西南得朋，東北喪朋。安貞吉。 ",
  "【注】西南致養之地，與坤同道者也，故曰得朋。東北反西南者也，故曰喪朋。陰之為物，必離其黨，之於反類，而後獲安貞吉。",
  " ",
  "《彖》曰：至哉坤元，萬物資生，乃順承天。坤厚載物，德合无疆。含弘光大，品物咸亨。牝馬地類，行地无疆。 ",
  "【注】地之所以得无疆者，以卑順行之故也。乾以龍御天，坤以馬行地。",
  " ",
  " 柔順利貞。君子攸行，先迷失道，後順得常。西南得朋，乃與類行；東北喪朋，乃終有慶。安貞之吉，應地无疆。 ",
  "【注】地也者，形之名也。坤也者，用地者也。夫兩雄必爭，二主必危，有地之形，與剛健為耦，而能永保无疆，用之者不亦至順乎？若夫行之不以牝馬，利之不以永貞，方而又剛，柔而又圓，求安難矣。",
  " ",
  "《象》曰：地勢坤。 ",
  "【注】地形不順，其勢順。",
  " ",
  "君子以厚德載物。 ",
  "初六，履霜，堅冰至。 ",
  "【注】始於履霜，至于堅冰，所謂至柔而動也剛。陰之為道，本於卑弱而後積著者也，故取履霜以明其始。陽之為物，非基於始以至於著者也，故以出處明之，則以初為潛。",
  " ",
  "《象》曰：履霜堅冰，陰始凝也。馴致其道，至堅冰也。 ",
  "六二，直方大，不習，无不利。 ",
  "【注】居中得正，極於地質。任其自然而物自生，不假脩營而功自成，故不習焉而无不利。",
  " ",
  "《象》曰：六二之動，直以方也。 ",
  "【注】動而直方，任其質也。",
  " ",
  "不習，无不利，地道光也。 ",
  "六三，含章可貞，或從王事，无成有終。 ",
  "【注】三處下卦之極，而不疑於陽，應斯義者也。不為事始，須唱乃應，待命乃發，含美而可正者也，故曰含章可貞也。有事則從，不敢為首，故曰或從王事也。不為事主，順命而終，故曰无成有終也。",
  " ",
  "《象》曰：含章可貞，以時發也。或從王事，知光大也。 ",
  "【注】知慮光大，故不擅其美。",
  " ",
  "六四，括囊，无咎无譽。 ",
  "【注】處陰之卦，以陰居陰。履非中位，无直方之質；不造陽事，无含章之美。括結否閉，賢人乃隱；施慎則可，非泰之道。",
  " ",
  "《象》曰：括囊无咎，慎不害也。 ",
  "六五，黃裳元吉。 ",
  "【注】黃，中之色也。裳，下之飾也。坤為臣道，美盡於下。夫體无剛健而能極物之情，通理者也。以柔順之德，處於盛位，任夫文理者也。垂黃裳以獲元吉，非用武者也。極陰之盛，不至疑陽，以文在中，美之至也。",
  " ",
  "《象》曰，黃裳元吉，文在中也。 ",
  "【注】用黃裳而獲元吉，以文在中也。",
  " ",
  "上六，龍戰于野，其血玄黃。 ",
  "【注】陰之為道，卑順不盈，乃全其美，盛而不已，固陽之地，陽所不堪，故戰于野。",
  " ",
  "《象》曰：龍戰于野，其道窮也。 ",
  "用六，利永貞。 ",
  "【注】用六之利，利永貞也。",
  " ",
  "《象》曰：用六永貞，以大終也。 ",
  "【注】能以永貞，大終者也。",
  " ",
  "文言曰：坤至柔而動也剛，至靜而德方， ",
  "【注】動之方正，不為邪也；柔而又圓，消之道也；其德至靜，德必方也。",
  " ",
  "後得主而有常，含萬物而化光。坤道其順乎？承天而時行。 ",
  "積善之家，必有餘慶；積不善之家，必有餘殃。臣弒其君，子弒其父， 非一朝一夕之故，其所由來者漸矣，由辯之不早辯也。《易》曰「履霜，堅冰至」，蓋言順也。 ",
  "直其正也，方其義也。君子敬以直內，義以方外，敬義立而德不孤。直方大，不習无不利，則不疑其所行也。 ",
  "陰雖有美，含之；以從王事，弗敢成也。地道也，妻道也，臣道也。地道无成，而代有終也。 ",
  "天地變化，草木蕃；天地閉，賢人隱。《易》曰：「括囊，无咎无譽。」蓋言謹也。 ",
  "君子黃中通理，正位居體。美在其中，而暢於四支，發於事業，美之至也。 ",
  "陰疑於陽，必戰， ",
  "【注】辯之不早，疑盛乃動，故必戰。",
  " ",
  "為其嫌於无陽也， ",
  "【注】為其嫌於非陽而戰。",
  " ",
  "故稱龍焉。猶未離其類也， ",
  "【注】猶未失其陰類，為陽所滅。",
  " ",
  "故稱血焉。 ",
  "【注】猶與陽戰而相傷，故稱血。",
  " ",
  "夫玄黃者，天地之雜也，天玄而地黃。",
  " "
]