{
  "children": [
    {
      "type": "卦",
      "name": "豫",
      "down": "坤",
      "up": "震",
      "lines": [
        {
          "type": "句",
          "value": "豫，利建侯、行師。",
          "children": [
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：謂之豫者，取逸豫之義，以和順而動，動不違眾，眾皆說豫，故謂之豫也。動而眾說，故可利建侯也。以順而動，不加无罪，故可以行師也。无四德者，以逸豫之事不可以常行，時有所為也。縱恣寬暇之事不可長行，以經邦訓俗，故无元亨也。逸豫非幹正之道，故不云利貞也。莊氏云：「建侯，即元亨也。行師，即利貞也。」案：《屯卦》「元亨利貞」之後，別云「利建侯」，則「建侯」非「元亨」也。恐莊氏說非也。"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "type": "彖",
      "lines": [
        {
          "type": "句",
          "value": "《彖》曰：豫，剛應而志行，順以動，豫。豫，順以動，故天地如之，而況建侯行師乎？天地以順動，故日月不過，而四時不忒，聖人以順動，則刑罰清而民服。豫之時義大矣哉！",
          "children": [
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：「豫，剛應而志行，順以動，豫」者，剛謂九四也；應謂初六也。既陰陽相應，故志行也。此就爻明豫義。順以動，坤在下，是順也。震在上，是動也。以順而動，故豫也。此以上下二象明豫義也。自此已上，釋豫卦之理也。"
                },
                {
                  "type": "句",
                  "value": "「豫順以動，故天地如之，而況建侯行師乎」者，此釋「利建侯行師」也。若聖人和順而動，合天地之德，故天地亦如聖人而為之也。天地尊大而遠神之難者猶尚如之，況於封建諸侯、行師征伐乎？難者既從，易者可知。若建侯能順動，則人從之。行師能順動，則眾從之。天地以順動，故日月不過而四時不忒。自此已下，廣明天地聖人順動之功也。若天地以順而動，則日月不有過差，依其晷度，四時不有忒變，寒暑以時。「聖人以順動，則刑罰清而民服」者，聖人能以理順而動，則不赦有罪，不濫无辜，故刑罰清也。刑罰當理，故人服也。"
                },
                {
                  "type": "句",
                  "value": "「豫之時義大矣哉」者，歎美為豫之善，言於逸豫之時，其義大矣。此歎卦也。凡言不盡意者，不可煩文具說，且歎之以示情，使後生思其餘蘊，得意而忘言也。然歎卦有三體：一直歎時，如「大過之時大矣哉」之例是也；二歎時并用，如「險之時用大矣哉」之例是也；三歎時并義，「豫之時義大矣哉」之例是也。夫立卦之體，各象其時，時有屯夷，事非一揆，故爻來適時，有凶有吉。人之生世，亦復如斯，或逢治世，或遇亂時，出處存身，此道豈小？故曰「大矣哉」也。然時運雖多，大體不出四種者：一者治時，頤養之世是也；二者亂時，大過之世是也；三者離散之時，解緩之世是也；四者改易之時，革變之世是也。故舉此四卦之時為歎，餘皆可知。言用者，謂適時之用也。雖知居時之難，此事不小，而未知以何而用之耳。故坎、睽、蹇之時宜用君子，小人勿用。用險取濟，不可為常，斟酌得宜，是用時之大略。舉險難等三卦，餘從可知矣。又言義者，《姤卦》注云：「凡言義者，不盡於所見，中有意謂」者也。是其時皆有義也。略明佚樂之世，相隨相遇之日，隱遯羈旅之時，凡五卦，其義不小，則餘卦亦可知也。今所歎者十二卦，足以發明大義，恢弘妙理者也。凡于《彖》之末歎云「大哉」者，凡一十二卦。若《豫》、《旅》、《遯》、《姤》凡四卦，皆云「時義」。案：《姤卦》注云：「凡言義者，不盡於所見，中有意謂。」以此言之，則四卦卦各未盡其理，其中更有餘意，不可盡申，故總云「義」也。《隨》之一卦亦言「義」，但與四卦其文稍別。四卦皆云「時義」，《隨卦》則「隨時之義」者，非但其中別有義意，又取隨逐其時，故變云「隨時之義大矣哉！」《睽》、《蹇》、《坎》此三卦皆云「時用」。案：《睽卦》注云：「睽離之時，非小人之所能用。」《蹇卦》亦云「非小人之所能用」。此二卦言「大矣哉」者，則是大人能用，故云「大矣哉」，其中更无餘義，唯大人能用，故云「用」不云「義」也。《坎卦》「時用」，則與《睽》、《蹇》稍別，故注云「非用之常，用有時也」。謂坎險之事，時之須用，利益乃大，與《睽》、《蹇》「時用」文同而義異也。解之時，革之時，頤之時，大過之時，此四卦直云「時」，不云「義」與「用」也。案：《解卦》注難解之時，非治難時，故不言用。體盡於《解》之名，无有幽隱，故不曰義，以此注言之，直云時，尋卦之名則其意具盡，中間更无餘義，故不言義，其卦名之事，事已行了，不須別有所用，故《解》、《革》及《頤》事已行了，不須言用。唯《大過》稱「時」，注云：「君子有為之時。」與《解》、《革》、《頤》其理稍別。《大過》是有用之時，亦直稱「時」者，取「大過」之名，其意即盡，更无餘意，故直稱「時」，不云「義」，又略不云「用」也。"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "type": "大象",
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：雷出地奮，豫。先王以作樂崇德。殷薦之上帝，以配祖考。",
          "children": [
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：案諸卦之象，或云「雲上于天」，或云「風行天上」，以類言之，今此應云「雷出地上」，乃云「雷出地奮豫」者，雷是陽氣之聲，奮是震動之狀。雷既出地，震動萬物，被陽氣而生，各皆逸豫，故云「雷出地奮，豫」也。「先王以作樂崇德」者，雷是鼓動，故先王法此鼓動而作樂，崇盛德業，樂以發揚盛德故也。「殷薦之上帝」者，用此殷盛之樂，薦祭上帝也，象雷出地而向天也。「以配祖考」者，謂以祖考配上帝。用祖用考，若周夏正郊天配靈威仰以祖后稷配也；配祀明堂五方之帝，以考文王也，故云「以配祖考」也。"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 1,
      "lines": [
        {
          "type": "句",
          "value": "初六，鳴豫，凶。",
          "children": [
            {
              "type": "注",
              "text": "處豫之初，而特得志於上，樂過則淫，志窮則凶，豫何可鳴？"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 1,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：初六鳴豫，志窮凶也。",
          "children": [
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：鳴豫者，處豫之初，而獨得應於四，逸豫之甚，是聲鳴于豫。但逸樂之極，過則淫荒。獨得於樂，所以凶也。"
                },
                {
                  "type": "句",
                  "value": "《象》曰「初六鳴豫，志窮凶」者，釋鳴豫之義。而初時鳴豫，後則樂志窮盡，故為凶也。"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 2,
      "lines": [
        {
          "type": "句",
          "value": "六二，介於石，不終日，貞吉。",
          "children": [
            {
              "type": "注",
              "text": "處豫之時，得位履中，安夫貞正，不求苟豫者也。順不苟從，豫不違中，是以上交不諂，下交不瀆。明禍福之所生，故不苟說。辯必然之理，故不改其操，介如石焉。不終日明矣。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 2,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：不終日貞吉，以中正也。",
          "children": [
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：「介於石」者，得位履中，安夫貞正，不苟求逸豫，上交不諂，下交不瀆，知幾事之初始，明禍福之所生，不苟求逸豫，守志耿介似於石。然見幾之速，不待終竟一日，去惡修善，恒守正得吉也。"
                },
                {
                  "type": "句",
                  "value": "《象》曰「不終日貞吉，以中正」者，釋貞吉之義，所以見其惡事，即能離去，不待終日守正吉者，以此六二居中守正，順不苟從，豫不違中，故不須待其一日，終守貞吉也。"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 3,
      "lines": [
        {
          "type": "句",
          "value": "六三，盱豫，悔，遲有悔。",
          "children": [
            {
              "type": "注",
              "text": "居下體之極，處兩卦之際，履非其位，承動豫之主。若其睢盱而豫，悔亦生焉。遲而不從，豫之所疾，位非所據，而以從豫，進退離悔，宜其然矣。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 3,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：盱豫有悔，位不當也。",
          "children": [
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：「盱豫悔」者，六三履非其位，上承動豫之主。盱謂睢盱。睢盱者，喜說之貌。若睢盱之求豫，則悔吝也。「遲有悔」者，居豫之時，若遲停不求於豫，亦有悔也。"
                },
                {
                  "type": "句",
                  "value": "《象》曰「盱豫有悔，位不當」者，解其「盱豫有悔」之義，以六三居不當位，進退不得其所，故「盱豫有悔」。但《象》載經文，多從省略。經有「盱豫有悔」、「遲有悔」，兩文具載，《象》唯云「盱豫有悔」，不言遲者，略其文也。故直云「盱豫」。舉其欲進，略云有悔，舉其遲也。"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 4,
      "lines": [
        {
          "type": "句",
          "value": "九四，由豫，大有得。勿疑，朋盍簪。",
          "children": [
            {
              "type": "注",
              "text": "處豫之時，居動之始，獨體陽爻，眾陰所從，莫不由之以得其豫，故曰「由豫，大有得」也。夫不信於物，物亦疑焉，故勿疑則朋合疾也。盍，合也。簪，疾也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 4,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：由豫，大有得，志大行也。",
          "children": [
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：「由豫大有得」者，處豫之時，居動之始，獨體陽爻，為眾陰之所從，莫不由之以得其豫，故云「由豫」也。「大有得」者，眾陰皆歸，是大有所得。「勿疑朋盍簪」者，盍，合也。簪，疾也。若能不疑於物，以信待之，則眾陰群朋合聚而疾來也。"
                },
                {
                  "type": "句",
                  "value": "《象》曰「由豫，大有得，志大行」者，釋「由豫大有得」之意。眾陰既由之而豫，大有所得，是志意大行也。"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 5,
      "lines": [
        {
          "type": "句",
          "value": "六五，貞疾，恒不死。",
          "children": [
            {
              "type": "注",
              "text": "四以剛動，為豫之主，專權執制，非己所乘，故不敢與四爭權，而又居中處尊，未可得亡，是以必常至于「貞疾，恒不死」而巳。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 5,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：六五貞疾，乘剛也。恒不死，中未亡也。",
          "children": [
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：「貞疾，恒不死」者，四以剛動為豫之主，專權執制，非合己所乘，故不敢與四爭權。而又居中處尊，未可得亡滅之，是以必常至於貞疾，恒得不死而巳。"
                },
                {
                  "type": "句",
                  "value": "《象》曰「六五貞疾乘剛」者，解「貞疾」之義。以乘九四之剛，故正得其疾，恒不死也。「中未亡」者，以其居中處尊，未可亡滅之也。"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 6,
      "lines": [
        {
          "type": "句",
          "value": "上六，冥豫，成有渝，无咎。",
          "children": [
            {
              "type": "注",
              "text": "處動豫之極，極豫盡樂，故至于冥豫成也。過豫不已，何可長乎？故必渝變然後无咎。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 6,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：冥豫在上，何可長也？",
          "children": [
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：處動豫之極，極豫盡樂，乃至於冥昧之豫而成就也。如俾晝作夜，不能休已，滅亡在近。有渝无咎者，渝，變也。若能自思改變，不為冥豫，乃得无咎也。"
                }
              ]
            }
          ]
        },
        {
          "type": "句",
          "value": " "
        }
      ]
    }
  ]
}