{
  "children": [
    {
      "type": "卦",
      "name": "坤",
      "down": "坤",
      "up": "坤",
      "lines": [
        {
          "type": "卦名",
          "value": "　坤卦　坤下坤上"
        },
        {
          "type": "句",
          "value": "坤，元亨，利牝馬之貞。",
          "children": [
            {
              "type": "注",
              "text": "坤貞之所利，利於牝馬也。馬在下而行者也，而又牝焉，順之至也。至順而後乃亨，故唯利於牝馬之貞。"
            }
          ]
        },
        {
          "type": "句",
          "value": "君子有攸往，先迷，後得主利。西南得朋，東北喪朋，安貞吉。"
        },
        {
          "type": "句",
          "value": "西南致養之地，與坤同道者也，故曰得朋。東北反西南者也，故曰喪朋。陰之為物，必離其黨，之於反類，而後獲安貞吉。",
          "children": [
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：此一節是文王於坤卦之下陳坤德之辭。但乾、坤合體之物，故乾後次坤，言地之為體，亦能始生萬物，各得亨通，故云元亨，與乾同也。「利牝馬之貞」者，此與乾異。乾之所利，利於萬事為貞，此唯云「利牝馬之貞」，坤是陰道，當以柔順為貞，假借柔順之象，以明柔順之德也。牝對牡為柔，馬對龍為順，假借此柔順以明柔道，故云「利牝馬之貞」。牝馬，外物自然之象，此亦聖人因坤元亨，利牝馬之貞自然之德以垂教也。不云牛而云馬者，牛雖柔順，不能行地无疆，无以見坤廣生之德，馬雖比龍為劣，所行亦能廣遠，象地之廣育。"
                },
                {
                  "type": "句",
                  "value": "「君子有攸往」者，以其柔順利貞，故君子利有所往。「先迷後得主利」者，以其至陰，當待唱而後和。凡有所為，若在物之先即迷惑，若在物之後即得主利，以陰不可先唱，猶臣不可先君，卑不可先尊故也。「西南得朋」者，此假像以明人事。西南坤位，是陰也，今以陰詣陰乃得朋，俱是陰類，不獲吉也。猶人既懷陰柔之行，又向陰柔之所，是純陰柔弱，故非吉也。「東北喪朋，安貞吉」者，西南既為陰，東北反西南，即為陽也。以柔順之道，往詣於陽，是喪失陰朋，故得安靜貞正之吉，以陰而兼有陽故也。若以人事言之，象人臣離其黨而入君之朝，女子離其家而入夫之室。莊氏云：「先迷後得主利者，唯據臣事君也。得朋、喪朋，唯據婦適夫也」。其理褊狹，非易弘通之道。"
                },
                {
                  "type": "句",
                  "value": "注坤貞至牝馬之貞。　正義曰：至順而後乃亨，故唯利於牝馬之貞者柔，牝馬是至順，牝馬在元亨之下，在貞之上，應云至順而後乃貞。今云「至順而後乃亨」，倒取上文者。輔嗣之意，下句既云「牝馬之貞」，避此「貞」文，故云「乃亨」。但亨、貞相將之物，故云至順之「貞」，亦是至順之「亨」。此坤德以牝馬至順乃得貞也。下文又云「東北喪朋」，去陰就陽，乃得貞吉。上下義反者，但易含萬象，一屈一伸。此句與乾相對，不可純剛敵乾，故利牝馬。下句論凡所交接，不可純陰，當須剛柔交錯，故喪朋吉也。"
                },
                {
                  "type": "句",
                  "value": "注「西南」至「貞吉」。　正義曰：坤位居西南。《說卦》云：「坤也者，地也，萬物皆致養焉。」坤既養物，若向西南，與坤同道也。「陰之為物，必離其黨，之於反類，而後獲安貞吉」者，若二女同居，其志不同，必之於陽，是之于反類，乃得吉也。凡言朋者，非唯人為其黨，性行相同，亦為其黨。假令人是陰柔而之剛正，亦是離其黨。"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "type": "彖",
      "lines": [
        {
          "type": "句",
          "value": "《彖》曰：至哉坤元！萬物資生，乃順承天，坤厚載物，德合无疆。含弘光大，品物咸亨，牝馬地類，行地无疆。",
          "children": [
            {
              "type": "注",
              "text": "地之所以得「无疆」者，以卑順行之故也。乾以龍御天，坤以馬行地。"
            }
          ]
        },
        {
          "type": "句",
          "value": "柔順利貞，君子攸行，先迷失道，後順得常。西南得朋，乃與類行。東北喪朋，乃終有慶。安貞之吉，應地无疆。",
          "children": [
            {
              "type": "注",
              "text": "地也者，形之名也。坤也者，用地者也。夫兩雄必爭，二主必危，有地之形，與剛健為耦，而能永保无疆，用之者不亦至順乎？若夫行之不以牝馬，利之不以永貞，方而又剛，柔而又圓，求安難矣。"
            },
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：「至哉坤元」至「德合无疆」，此五句摠明坤義及二德之首也。但元是坤德之首，故連言之，猶乾之元德，與乾相連共文也。「至哉坤元」者，歎美坤德，故云「至哉」。至謂至極也，言地能生養至極，與天同也。但天亦至極，包籠於地，非但至極，又大於地。故《乾》言「大哉」，《坤》言「至哉」。「萬物資生」者，言萬物資地而生。初稟其氣謂之始，成形謂之生。乾本氣初，故云資始，坤據成形，故云資生。「乃順承天」者，乾是剛健能統領於天，坤是陰柔以和順承奉於天。「坤厚載物，德合无疆」者，以其廣厚，故能載物，有此生長之德，合會无疆。凡言无疆者，其有二義，一是廣博无疆，二是長久无疆也。自此已上，論坤元之德也。「含弘光大，品物咸亨」者，包含弘厚，光著盛大，故品類之物，皆得亨通。但坤比乾，即不得大名，若比眾物，其實大也，故曰「含弘光大」者也。此二句釋亨也。「牝馬地類，行地无疆」者，以其柔順，故云地類，以柔順為體，終无禍患，故行地无疆，不復窮已。此二句釋利貞也。故上文云「利牝馬之貞」是也。"
                },
                {
                  "type": "句",
                  "value": "「柔順利貞，君子攸行」者，重釋利貞之義，是君子之所行，兼釋前文「君子有攸往」。「先迷失道」者，以陰在物之先，失其為陰之道。「後順得常」者，以陰在物之後，陽唱而陰和，人得主利，是後順得常。「西南得朋，乃與類行」者，以陰而造坤位，是乃與類俱行。「東北喪朋，乃終有慶」者，以陰而詣陽，初雖離群，乃終久有慶善也。「安貞之吉，應地无疆」者，安謂安靜，貞謂貞正，地體安靜而貞正，人若得靜而能正，即得其吉應，合地之无疆，是慶善之事也。"
                },
                {
                  "type": "句",
                  "value": "注「若夫行」至「難矣」。　正義曰：「行之不以牝馬」，牝馬謂柔順也。「利之不以永貞」，永貞謂貞固剛正也，言坤既至柔順，而利之即不兼剛正也。「方而又剛」者，言體既方正，而性又剛強，即太剛也。所以須牝馬也。「柔而又圓」者，謂性既柔順，體又圓曲，謂太柔也，故須永貞也。若其坤无牝馬，又无永貞，求安難矣。云永貞者，是下用六爻辭也。東北喪朋，去陰就陽，是利之永貞。"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "type": "大象",
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：地勢坤。",
          "children": [
            {
              "type": "注",
              "text": "地形不順，其勢順。"
            }
          ]
        },
        {
          "type": "句",
          "value": "君子以厚德載物。",
          "children": [
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：君子用此地之厚德容載萬物。言君子者，亦包公卿諸侯之等，但厚德載物，隨分多少，非如至聖載物之極也。"
                }
              ]
            }
          ]
        },
        {
          "type": "句",
          "value": "注：地形不順，其勢順。　正義曰：地體方直，是不順也。其勢承天，是其順也。"
        }
      ]
    },
    {
      "type": "爻",
      "index": 1,
      "lines": [
        {
          "type": "句",
          "value": "初六，履霜，堅冰至。",
          "children": [
            {
              "type": "注",
              "text": "始於履霜，至于堅冰，所謂至柔而動也剛。陰之為道，本於卑弱而後積著者也，故取履霜以明其始。陽之為物，非基於始以至於著者也，故以出處明之，則以初為潛。"
            },
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：初六陰氣之微，似若初寒之始，但履踐其霜，微而積漸，故堅冰乃至。義所謂陰道，初雖柔順，漸漸積著，乃至堅剛。凡易者象也，以物象而明人事，若《詩》之比喻也。或取天地陰陽之象以明義者，若《乾》之潛龍，見龍，《坤》之履霜堅冰，龍戰之屬是也。或取萬物雜象以明義者，若《屯》之六三即鹿无虞，六四乘馬班如之屬是也。如此之類，《易》中多矣。或直以人事，不取物象以明義者，若《乾》之九三君子終日乾乾，《坤》之六三含章可貞之例是也。聖人之意，可以取象者則取象也，可以取人事者則取人事也。故《文言》注云：「至於九三，獨以君子為目者何也？」「乾乾夕惕，非龍德也」。故以人事明之，是其義也。"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：「履霜堅冰，陰始凝也。馴致其道，至堅冰也。」",
          "children": [
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：夫子所作《象》辭，元在六爻經辭之後，以自卑退，不敢于亂先聖正經之辭。及至輔嗣之意，以為象者本釋經文，宜相附近，其義易了，故分爻之《象》辭，各附其當爻下言之，猶如元凱注《左傳》分經之年，與傳相附。「陰始疑也」者，釋履霜之義，言陰氣始凝結而為霜也。「馴致其道，至堅冰也」者，馴猶狎順也。若鳥獸馴狎然。言順其陰柔之道，習而不已，乃至堅冰也。褚氏云：「履霜者，從初六至六三。堅冰者，從六四至上六。」陰陽之氣无為，故積馴履霜，必至於堅冰。以明人事有為，不可不制其節度，故於履霜而逆以堅冰為戒，所以防漸慮微，慎終于始也。"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 2,
      "lines": [
        {
          "type": "句",
          "value": "六二，直方大，不習无不利。",
          "children": [
            {
              "type": "注",
              "text": "居中得正，極於地質，任其自然而物自生，不假脩營而功自成，故不習焉而无不利。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 2,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：「六二之動，直以方也。"
        },
        {
          "type": "句",
          "value": "動而直方，任其質也。"
        },
        {
          "type": "句",
          "value": "不習无不利，地道光也。」",
          "children": [
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：「直方大，不習无不利」者，《文言》云：「直其正也」。二得其位，極地之質，故亦同地也。俱包三德，生物不邪，謂之直也。地體安靜，是其方也。无物不載，是其大也。既有三德極地之美，自然而生，不假脩營，故云「不習无不利」。物皆自成，无所不利，以此爻居中得位，極於地體，故盡極地之義。此因自然之性，以明人事，居在此位，亦當如地之所為。"
                },
                {
                  "type": "句",
                  "value": "《象》曰：「六二之動，直以方」者，言六二之體，所有興動，任其自然之性，故云直以方也。不習无不利，地道光者，言所以不假脩習，物无不利，猶地道光大故也。"
                },
                {
                  "type": "句",
                  "value": "注：居中至地質。　正義曰：質謂形質，地之形質直方又大，此六二居中得正，是盡極地之體質也。所以直者，言氣至即生物，由是體正直之性。其運動生物之時，又能任其質性，直而且方，故《象》云：「六二之動，直以方也」。"
                },
                {
                  "type": "句",
                  "value": "注：動而至質也。　正義曰：是質以直方，動又直方，是質之與行，內外相副。物有內外不相副者，故《略例》云「形躁好靜，質柔愛剛」，此之類是也。"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 3,
      "lines": [
        {
          "type": "句",
          "value": "六三，含章可貞，或從王事，无成有終。",
          "children": [
            {
              "type": "注",
              "text": "三處下卦之極，而不疑於陽，應斯義者也。不為事始，須唱乃應，待命乃發，含美而可正者也，故曰含章可貞也。有事則從，不敢為首，故曰或從王事也。不為事主，順命而終，故曰无成有終也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 3,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：「含章可貞，以時發也。或從王事，知光大也。」",
          "children": [
            {
              "type": "注",
              "text": "知慮光大，故不擅其美。"
            },
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：「含章可貞」者，六三處下卦之極，而能不被疑於陽。章，美也。既居陰極，能自降退，不為事始，唯內含章美之道，待命乃行，可以得正，故曰含章可貞。「或從王事，无成有終」者，言六三為臣，或順從於王事，故不敢為事之首，主成於物，故云无成。唯上唱下和，奉行其終，故云有終。"
                },
                {
                  "type": "句",
                  "value": "《象》曰「含章可貞，以時發」者，夫子釋含章之義，以身居陰極，不敢為物之首，但內含章美之道，待時而發，是以時發也。「或從王事，知光大」者，釋无成有終也。既隨從王事，不敢主成物始，但奉終而行，是知慮光大，不自擅其美，唯奉於上。"
                },
                {
                  "type": "句",
                  "value": "注三處至有終也。　正義曰：「三處下卦之極」者，欲見三雖陰爻，其位尊也。「不疑於陽」者，陰之尊極，將與陽敵，體必被陽所忌。今不被疑於陽，言陽不害也。「應斯義」者，斯，此也，若能應此義，唯行含章可貞已下之事，乃應斯義。此爻全以人事明之。"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 4,
      "lines": [
        {
          "type": "句",
          "value": "六四，括囊，无咎无譽。",
          "children": [
            {
              "type": "注",
              "text": "處陰之卦，以陰居陰，履非中位，无直方之質；不造陽事，无含章之美。括結否閉，賢人乃隱。施慎則可，非泰之道。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 4,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：「括囊无咎，慎不害也。」",
          "children": [
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：括，結也。囊所以貯物，以譬心藏知也。閉其知而不用，故曰括囊。功不顯物，故曰无譽。不與物忤，故曰无咎。"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：「慎不害」者，釋所以括囊无咎之義。曰其謹慎，不與物競，故不被害也。"
        },
        {
          "type": "句",
          "value": "注：處陰至之道。　正義曰：「不造陽事，无含章之美」者，六三以陰居陽位，是造為陽事，但不為事始，待唱乃行，是陽事猶在，故云含章，章即陽之美也。今六四以陰處陰，內无陽事，是不造陽事，无含章之美，當括結否閉之時，是賢人乃隱，唯施謹慎則可，非通泰之道也。"
        }
      ]
    },
    {
      "type": "爻",
      "index": 5,
      "lines": [
        {
          "type": "句",
          "value": "六五，黃裳，元吉。",
          "children": [
            {
              "type": "注",
              "text": "黃，中之色也。裳，下之飾也。坤為臣道，美盡於下。夫體无剛健而能極物之情，通理者也。以柔順之德，處於盛位，任夫文理者也。垂黃裳以獲元吉，非用武者也。極陰之盛，不至疑陽，以文在中，美之至也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 5,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：「黃裳元吉，文在中也。」",
          "children": [
            {
              "type": "注",
              "text": "用黃裳而獲元吉，以文在中也。 "
            },
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：黃裳元吉者，黃是中之色，裳是下之飾，坤為臣道，五居君位，是臣之極貴者也。能以中和通於物理，居於臣職，故云黃裳元吉。元大也。以其德能如此，故得大吉也。　《象》曰「黃裳元吉，文在中」者，釋所以黃裳元吉之義，以其文德在中故也。既有中和，又奉臣職，通達文理，故云文在其中，言不用威武也。"
                },
                {
                  "type": "句",
                  "value": "注：黃中至美之至也。　正義曰：黃，中之色，裳，下之飾者，《左氏．昭十二年傳》文也。裳，下之飾，則上衣比君，下裳法臣也。「垂黃裳以獲元吉，非用武」者，以體无剛健，是非用威武也。以內有文德，通達物理，故象云文在中也。"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 6,
      "lines": [
        {
          "type": "句",
          "value": "上六，龍戰于野，其血玄黃。",
          "children": [
            {
              "type": "注",
              "text": "陰之為道，卑順不盈，乃全其美。盛而不已，固陽之地，陽所不堪，故戰于野。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 6,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：「龍戰于野，其道窮也。」",
          "children": [
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：「龍戰于野，其血玄黃」者，以陽謂之龍，上六是陰之至極，陰盛似陽，故稱龍焉。「盛而不已，固陽之地，陽所不堪」，故陽氣之龍與之交戰，即《說卦》云「戰乎乾」是也。戰於卦外，故曰「于野」。陰陽相傷，故其血玄黃。"
                },
                {
                  "type": "句",
                  "value": "注「陰之」至「戰于野」。　正義曰：「盛而不己，固陽之地」者，固為占固，陰去則陽來，陰乃盛而不去，占固此陽所生之地，故陽氣之龍與之交戰。"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 7,
      "lines": [
        {
          "type": "句",
          "value": "用六，利永貞。",
          "children": [
            {
              "type": "注",
              "text": "用六之利，利永貞也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 7,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：「用六永貞，以大終也。」",
          "children": [
            {
              "type": "注",
              "text": "能以永貞大終者也。"
            },
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：「用六，利永貞」者，此坤之六爻摠辭也。言坤之所用，用此眾爻之六，六是柔順，不可純柔，故利在永貞。永，長也。貞，正也。言長能貞正也。"
                },
                {
                  "type": "句",
                  "value": "《象》曰「以大終」者，釋永貞之義，既能用此柔順，長守貞正，所以廣大而終也。若不用永貞，則是柔而又圓，即前注云「求安難」矣。此永貞即坤卦之下安貞吉是也。"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "type": "文言",
      "lines": [
        {
          "type": "句",
          "value": "《文言》曰：坤至柔而動也剛，至靜而德方。",
          "children": [
            {
              "type": "注",
              "text": "動之方正，不為邪也。柔而又圓，消之道也。其德至靜，德必方也。"
            }
          ]
        },
        {
          "type": "句",
          "value": "後得主而有常，含萬物而化光。坤道其順乎？承天而時行！",
          "children": [
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：此一節是第一節，明坤之德也。自「積善之家」以下是第二節也，分釋六爻之義。「坤至柔而動也剛」者，六爻皆陰，是至柔也。體雖至柔而運動也剛，柔而積漸，乃至堅剛，則上云「履霜堅冰」是也。又地能生物，初雖柔弱，後至堅剛而成就。「至靜而德方」者，地體不動，是至靜。生物不邪，是德能方正。"
                },
                {
                  "type": "句",
                  "value": "「後得主而有常」者，陰主卑退，若在事之後，不為物先，即得主也。此陰之恒理，故云有常。「含萬物而化光」者，自明《彖》辭含弘光大，言含養萬物而德化光大也。「坤道其順乎，承天而時行」者，言坤道柔順，承奉於天，以量時而行，即不敢為物之先，恒相時而動。"
                }
              ]
            }
          ]
        },
        {
          "type": "句",
          "value": "積善之家，必有餘慶。積不善之家，必有餘殃。臣弑其君，子弑其父，非一朝一夕之故，其所由來者漸矣，由辯之不早辯也。《易》曰「履霜堅冰至」，蓋言順也。",
          "children": [
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：此一節明初六爻辭也。「積善之家，必有餘慶，積不善之家，必有餘殃」者，欲明初六其惡有漸，故先明其所行善惡事，由久而積漸，故致後之吉凶。「其所由來者漸矣」者，言弑君弑父，非一朝一夕率然而起，其禍患所從來者積漸久遠矣。「由辯之不早辯」者，臣子所以久包禍心，由君父欲辯明之事，不早分辯故也。此戒君父防臣子之惡。「蓋言順」者，言此履霜堅冰至，蓋言順習陰惡之道，積微而不已，乃致此弑害。稱蓋者是疑之辭。凡萬事之起，皆從小至大，從微至著，故上文善惡並言，今獨言弑君弑父有漸者，以陰主柔順，積柔不已，乃終至禍亂，故特於坤之初六言之，欲戒其防柔弱之初，又陰為弑害，故寄此以明義。"
                }
              ]
            }
          ]
        },
        {
          "type": "句",
          "value": "直其正也，方其義也。君子敬以直內，義以方外，敬義立而德不孤。直方大，不習无不利，則不疑其所行也。",
          "children": [
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：此一節釋六二爻辭。「直其正」者，經稱直是其正也。「方其義」者，經稱方是其義也。義者，宜也，於事得宜，故曰義。「君子敬以直內」者，覆釋「直其正」也。言君子用敬以直內，內謂心也，用此恭敬以直內心。「義以方外」者，用此義事，以方正外物，言君子法地正直而生萬物，皆得所宜，各以方正，然即前云「直其正也，方其義也」。下云「義以方外」，即此應云「正以直內」。改云「敬以直內」者，欲見正則能敬，故變正為敬也。「敬義立而德不孤」者，身有敬義，以接於人，則人亦敬，義以應之，是德不孤也。直則不邪，正則謙恭，義則與物无競，方則凝重不躁，既「不習无不利」，則所行不須疑慮，故曰「不疑其所行」。"
                }
              ]
            }
          ]
        },
        {
          "type": "句",
          "value": "陰雖有美含之，以從王事，弗敢成也。地道也，妻道也，臣道也。地道无成，而代有終也。",
          "children": [
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：此一節明六三爻辭，言「陰雖有美，含之以從王事」者，釋含章可貞之義也。言六三之陰，雖有美道包含之德，若或從王事，不敢為主先成之也。「地道也，妻道也，臣道也」者，欲明坤道處卑，待唱乃和，故歷言此三事，皆卑應於尊，下順於上也。「地道无成，而代有終」者，其地道卑柔，无敢先唱成物，必待陽始先唱，而後代陽有終也。"
                }
              ]
            }
          ]
        },
        {
          "type": "句",
          "value": "天地變化，草木蕃；天地閉，賢人隱。《易》曰「括囊，无咎无譽」，蓋言謹也。",
          "children": [
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：此一節明六四爻辭。「天地變化」，謂二氣交通，生養萬物，故草木蕃滋。「天地閉，賢人隱」者，謂二氣不相交通，天地否閉，賢人潛隱。天地通則草木蕃，明天地閉，草木不蕃；「天地閉，賢人隱」，明天地通則賢人出，互而相通，此乃括囊无咎，故賢人隱屬天地閉也。「蓋言謹」者，謹謂謹慎，蓋言賢人君子於此之時須謹慎也。"
                }
              ]
            }
          ]
        },
        {
          "type": "句",
          "value": "君子黃中通理，正位居體，美在其中，而暢於四支，發於事業，美之至也。",
          "children": [
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：此一節明六五爻辭也。「黃中通理」者，以黃居中，兼四方之色，奉承臣職，是通曉物理也。「正位居體」者，居中得正，是正位也；處上體之中，是居體也。黃中通理，是「美在其中」。有美在於中，必通暢於外，故云「暢於四支」。四支猶人手足，比于四方物務也。外內俱善，能宣發於事業。所營謂之事，事成謂之業，美莫過之，故云「美之至」也。"
                }
              ]
            }
          ]
        },
        {
          "type": "句",
          "value": "陰疑於陽必戰。",
          "children": [
            {
              "type": "注",
              "text": "辯之不早，疑盛乃動，故必戰。"
            }
          ]
        },
        {
          "type": "句",
          "value": "為其嫌於无陽也，",
          "children": [
            {
              "type": "注",
              "text": "為其嫌於非陽而戰。"
            }
          ]
        },
        {
          "type": "句",
          "value": "故稱龍焉。猶未離其類也。",
          "children": [
            {
              "type": "注",
              "text": "猶未失其陰類，為陽所滅。"
            }
          ]
        },
        {
          "type": "句",
          "value": "故稱血焉。",
          "children": [
            {
              "type": "注",
              "text": "猶與陽戰而相傷，故稱血。"
            }
          ]
        },
        {
          "type": "句",
          "value": "夫玄黃者，天地之雜也，天玄而地黃。",
          "children": [
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：此一節明上六爻辭。「陰疑於陽必戰」者，陰盛為陽所疑，陽乃發動，欲除去此陰，陰既強盛，不肯退避，故必戰也。"
                },
                {
                  "type": "句",
                  "value": "「為其嫌於无陽也，故稱龍焉」者，上六陰盛似陽，為嫌純陰非陽，故稱龍以明之。「猶未離其類也，故稱血焉」者，言上六雖陰盛似陽，然猶未能離其陰類，故為陽所傷而見滅也。"
                },
                {
                  "type": "句",
                  "value": "「夫玄黃者，天地之雜也，天玄而地黃」者，釋「其血玄黃」之義。莊氏云：「上六之爻，兼有天地雜氣，所以上六被傷，其血玄黃也。天色玄，地色黃，故血有天地之色。」今輔嗣注云「猶與陽戰而相傷」，是言陰陽俱傷也。恐莊氏之言，非王之本意，今所不取也。"
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}