{
  "children": [
    {
      "type": "卦",
      "fh": "䷇",
      "name": "比",
      "down": "坤",
      "up": "坎",
      "lines": [
        {
          "type": "卦名",
          "value": "䷇　比卦　坤下坎上"
        },
        {
          "type": "句",
          "value": "比，吉，原筮，元永貞，无咎。不寧方來，後夫凶。",
          "children": [
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：「比吉」者，謂能相親比而得其吉。「原筮，元永貞，无咎」者，欲相親比，必能原窮其情，筮決其意，唯有元大永長貞正，乃得无咎。「元永貞」者，謂兩相親比，皆須永貞。「不寧方來」者，此是寧樂之時，若能與人親比，則不寧之方，皆悉歸來。「後夫凶」者，夫，語辭也。親比貴速，若及早而來，人皆親己，故在先者吉，若在後而至者，人或疏己，親比不成，故後夫凶。或以夫為丈夫，謂後來之人也。 "
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "type": "彖",
      "lines": [
        {
          "type": "句",
          "value": "《彖》曰：比，吉也。比，輔也，下順從也。原筮，元永貞，无咎，以剛中也。",
          "children": [
            {
              "type": "注",
              "text": "處比之時，將原筮以求无咎，其唯元永貞乎？夫群黨相比，而不以元永貞，則凶邪之道也。若不遇其主，則雖永貞而猶未足免於咎也。使永貞而无咎者，其唯九五乎？ "
            }
          ]
        },
        {
          "type": "句",
          "value": "不寧方來，上下應也。",
          "children": [
            {
              "type": "注",
              "text": "上下无陽以分其民，五獨處尊，莫不歸之。上下應之，既親且安，安則不安者託焉，故不寧方所以來，上下應故也。夫无者求有，有者不求所與；危者求安，安者不求所保。火有其炎，寒者附之。故己苟安焉，則不寧方來矣。 "
            }
          ]
        },
        {
          "type": "句",
          "value": "後夫凶，其道窮也。",
          "children": [
            {
              "type": "注",
              "text": "將合和親而獨在後，親成則誅，是以凶也。"
            },
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：「比，吉也」者，釋親比為善，言相親比而得吉也。「比，輔也」者，釋比所以得吉，由比者人來相輔助也。「下順從」者，在下之人，順從於上，是相輔助也，謂眾陰順從九五也。自此已上，釋比名為吉之義。「原筮，元永貞，无咎，以剛中」者，釋「原筮，元永貞，无咎」之義，所以得如此者，以九五剛而處中，故使比者皆得「原筮，元永貞，无咎」也。"
                },
                {
                  "type": "句",
                  "value": "「 不寧方來，上下應 」者釋「不寧方來」之義，以九五處中，故上下群陰皆來應之。於此之時，陰往比陽，群陰未得其所，皆未寧也。"
                },
                {
                  "type": "句",
                  "value": "「後夫凶，其道窮」者，釋「後夫凶」。他悉親比，己獨後來，比道窮困，无人與親，故其凶也。此謂上六也。"
                },
                {
                  "type": "句",
                  "value": "注「處比」至「九五乎」。　正義曰：「將原筮以求无咎，其唯元永貞乎」者，原謂原窮比者根本，筮謂筮決求比之情，以求久長无咎。「其唯元永貞乎」，元，大也；永，長也。為己有大長貞正，乃能原筮相親比之情得久長而无咎，謂彼此相親比也。「若不遇其主，則雖永貞而猶未足免於咎」者，若不逢遇明主，則彼此相求，比者雖各懷永貞，而猶未足免離於咎。雖有永貞，而无明主照察，不被上知，相親涉於朋黨，故不免咎也。「使永貞而无咎者，其唯九五乎」者，使比者得免咎，保永貞，久而无咎，其唯九五乎？以九五為比之主，剛而處中，能識比者之情意，故使比者得保永貞，无凶咎也。"
                },
                {
                  "type": "句",
                  "value": "注「將合」至「以凶也」。　正義曰：「親成則誅」者，彼此相比，皆速來為親；親道已成，己獨在後而來，眾則嫌其離，貳所以被誅而凶也。"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "type": "大象",
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：地上有水，比。先王以建萬國，親諸侯。",
          "children": [
            {
              "type": "注",
              "text": "萬國以比建，諸侯以比親。"
            },
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：「建萬國親諸侯」，非諸侯已下之所為，故特云「先王」也。「建萬國」謂割土而封建之。「親諸侯」謂爵賞恩澤而親友之。萬國據其境域，故曰建也。諸侯謂其君身，故云親也。地上有水，猶域中有萬國，使之各相親比，猶地上有水，流通相潤及物，故云「地上有水，比」也。"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 1,
      "lines": [
        {
          "type": "句",
          "value": "初六，有孚比之，无咎。有孚盈缶，終來，有它吉。",
          "children": [
            {
              "type": "注",
              "text": "處比之始，為比之首者也。夫以不信為比之首，則禍莫大焉，故必「有孚盈缶」，然後乃得免比之咎，故曰「有孚比之，无咎」也。處比之首，應不在一，心无私吝，則莫不比之。著信立誠，盈溢乎質素之器，則物終來无衰竭也。親乎天下，著信盈缶，應者豈一道而來？故必「有他吉」也。 "
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 1,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：比之初六，有它吉也。",
          "children": [
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：「有孚比之无咎」者，處比之始，為比之首，若无誠信，禍莫大焉。必有誠信而相親比，終始如一，為之誠信，乃得无咎。「有孚盈缶，終來，有他吉」者，身處比之首，應不在一，心无私吝，莫不比之。有此孚信，盈溢質素之缶，以此待物，物皆歸向，從始至終，尋常恒來，非唯一人而已，更有它人並來而得吉，故云「終來有它吉」也。此假外象喻人事也。"
                },
                {
                  "type": "句",
                  "value": "注：應不在一，心无私吝。正義曰：「應不在一」者，初六无應，是「應不在一」，故「心无私吝」也。若心有偏應，即私有愛吝也，以「應不在一」，故「心无私吝」也。"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 2,
      "lines": [
        {
          "type": "句",
          "value": "六二，比之自內，貞吉。",
          "children": [
            {
              "type": "注",
              "text": "處比之時，居中得位，而繫應在五，不能來它，故得其自內貞吉而已。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 2,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：比之自內，不自失也。",
          "children": [
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：「比之自內，貞吉」者，居中得位，係應在五，不能使它悉來，唯親比之道，自在其內，獨與五應，但貞吉而已，不如初六有它吉也。《象》曰「不自失」者，釋「比之自內」之義，不自失其所應之偶，故云「比之自內，不自失」也。"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 3,
      "lines": [
        {
          "type": "句",
          "value": "六三，比之匪人。",
          "children": [
            {
              "type": "注",
              "text": "四自外比，二為五貞，近不相得，遠則无應，所與比者，皆非己親，故曰「比之匪人」。 "
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 3,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：比之匪人，不亦傷乎！",
          "children": [
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：「比之匪人不亦傷乎」者，言六三所比，皆非己親之人。四自外比，二為五應，近不相得，遠又无應，是所欲親比，皆非其親，是以悲傷也。"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 4,
      "lines": [
        {
          "type": "句",
          "value": "六四，外比之，貞吉。",
          "children": [
            {
              "type": "注",
              "text": "外比於五，履得其位，比不失賢，處不失位，故貞吉也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 4,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：外比於賢，以從上也。",
          "children": [
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：六四上比於五，故外比也。居得其位，比不失賢，所以貞吉。凡下體為內，上體為外，六四比五，故云外比也。《象》曰「外比於賢以從上」也者，九五居中得位，故稱賢也。五在四上，四往比之，是以從上也。"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 5,
      "lines": [
        {
          "type": "句",
          "value": "九五，顯比。王用三驅，失前禽。邑人不誡，吉。",
          "children": [
            {
              "type": "注",
              "text": "為比之主而有應在二，顯比者也。比而顯之，則所親者狹矣。夫无私於物，唯賢是與，則去之與來，皆无失也。夫三驅之禮，禽逆來趣己則舍之，背己而走則射之，愛於來而惡於去也，故其所施，常失前禽也。以顯比而居王位，用三驅之道者也，故曰「王用三驅，失前禽也」。用其中正，征討有常，伐不加邑，動必討叛，邑人无虞，故「不誡」也。雖不得乎大人之吉，是顯比之吉也。此可以為上之使，非為上之道也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 5,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：顯比之吉，位正中也。舍逆取順，失前禽也。邑人不誡，上使中也。",
          "children": [
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：五應於二，顯明比道，不能普徧相親，是比道狹也。「王用三驅，失前禽」者，此假田獵之道，以喻顯比之事。凡三驅之禮，禽向己者則舍之，背己者則射之，是失於前禽也。顯比之道，與己相應者則親之，與己不相應者則疏之，與三驅田獵，愛來惡去相似，故云「王用三驅，失前禽」也。言顯比之道，似於此也。「邑人不誡吉」者，雖不能廣普親比於自己相親之處，不妄加討罰，所以己邑之人，不須防誡而有吉也。至於邑人不誡而為吉，非是大人弘闊之道，不可為大人之身，但可為大人之使。"
                },
                {
                  "type": "句",
                  "value": "《象》曰：「顯比之吉，位正中」者，所以顯比得吉者，以所居之位正而且中，故云顯比之吉。「舍逆取順失前禽也」者，禽逆來向己者，則舍之而不害，禽順去背己而走者，則射而取之，是失前禽也。「邑人不誡上使中」者，釋「邑人不誡」之義，所以己邑之人，不須防誡，止由在上九五之使得其中正之人，伐不加邑，動必討叛，不橫加无罪，止由在上使中也。中謂九五也。此九五雖不得為王者之身，堪為王者之使，以居中位，故云「上使中」也。"
                },
                {
                  "type": "句",
                  "value": "注：為比至之道。正義曰：「去之與來皆无失」者，若比道弘闊，不偏私於物，唯賢是親，則背己去者與來向己者，皆悉親附，无所失也。言去亦不失，來亦不失。夫三驅之禮者，先儒皆云「三度驅禽而射之也」。三度則已，今亦從之。去則射之。褚氏諸儒皆以為三面著人驅禽，必知三面者，禽唯有背己、向己、趣己，故左右及於後皆有驅之。「愛於來而惡於去」者，來則舍之，是愛於來也；去則射之，是惡於去也。「故其所施常失前禽」者，言獨比所應，則所比為失。如三驅所施，愛來憎去，則失在前禽也。「用其中正，征討有常，伐不加邑，動必討叛」者，此九五居中得正，故云「用其中正」也。心既中正，不妄喜怒，故征伐有常也。所伐之事，不加親己之邑；興師動眾，必欲討其叛逆。二以其顯比，親者伐所不加也，叛者必欲征伐也。云「雖不得乎大人之吉，是顯比之吉」者，以《象》云「顯比之吉」，其比狹也。若大人之吉，則比道弘通也。「可以為上之使，非為上之道」者，九五居上之位，若為行如此，身雖為王，止可為上使之人，非是為王之道，故云「非為上之道」。"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 6,
      "lines": [
        {
          "type": "句",
          "value": "上六，比之无首，凶。",
          "children": [
            {
              "type": "注",
              "text": "无首，後也。處卦之終，是後夫也。親道已成，无所與終，為時所棄，宜其凶也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 6,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：比之无首，无所終也。",
          "children": [
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：「无首凶」者，謂无能為頭首。它人皆比，己獨在後，是親比於人无能為頭首也。它人皆比，親道已成，己獨在後，眾人所棄，宜其凶也。《象》曰：「无所終」者，釋「比之无首」，既不能為比之初首，被人所棄，故无能與之共終也。"
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}