{
  "children": [
    {
      "type": "书名",
      "lines": [
        {
          "type": "句",
          "value": "《彖》曰：小畜，柔得位而上下應之，曰小畜。",
          "children": [
            {
              "type": "注",
              "text": "謂六四也，成卦之義在此爻也。體无二陰以分其應,，故上下應之也。既得其位，而上下應之，三不能陵，小畜之義也。"
            }
          ]
        },
        {
          "type": "句",
          "value": "健而巽，剛中而志行，乃亨。密雲不雨，尚往也；自我西郊，施未行也。",
          "children": [
            {
              "type": "注",
              "text": "小畜之勢，足作密雲，乃自我西郊，未足以為雨也。何由知未能為雨？夫能為雨者，陽上薄陰，陰能固之，然後烝而為雨。今不能制初九之復道，固九二之牽復，九三更以不能復為劣也。下方尚往，施豈得行？故密雲而不能為雨，尚往故也。何以明之？去陰能固之，然後乃雨乎。上九獨能固九三之路，故九三不可以進而輿說輻也。能固其路而安於上，故得既雨既處。若四、三皆能若上九之善畜，則能雨明矣。故舉一卦而論之，能為小畜密雲而已。陰苟不足以固陽，則雖復至盛，密雲自我西郊，故不能雨也。雨之未下，即施之未行也。《彖》全論一卦之體，故曰「密雲不雨」。《象》各言一爻之德，故曰「既雨既處」也。"
            },
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：「柔得位而上下應之，曰小畜」者，柔得位謂六四也。以陰居陰，故稱得位。此卦唯有一陰，上下諸陽皆來應之，故曰小畜。此釋小畜卦名也。言此卦之畜，六四唯畜其下九三，初九、九二猶不能擁畜，而云「上下應之」者，若細別而言，小畜之義，唯當畜止在下。三陽猶不能畜盡，但畜九三而已。若大判而言之，上下五陽總應六四，故云「上下應之」。其四雖應何妨，總不能畜止剛健也。"
                },
                {
                  "type": "句",
                  "value": "「健而巽，剛中而志行，乃亨」者，內既剛健而外逢柔順，剛發於中，不被摧抑，而志意得行。以此言之，故剛健之志，乃得亨通，此釋亨也。「密雲不雨，尚往」者，所以密雲不雨者，不能畜止諸陽，初九、九二，猶得上進，陰陽氣通，所以不雨，釋密雲不雨也。"
                },
                {
                  "type": "句",
                  "value": "「自我西郊施未行」者，釋「自我西郊」之義。所以密雲不雨，從我西郊而積聚者，猶所施潤澤，未得流行周徧，故不覆國都，但遠聚西郊也。然雲在國都而不雨，亦是施未行也。必云在西郊者，若在國都，雨雖未落，猶有覆蔭之施，不得云「施未行」，今言在西郊，去施遠也。"
                },
                {
                  "type": "句",
                  "value": "注「小畜」至「既處」。　正義曰：「九三更以不能復為劣」者，初九既得復道，九二可牽以獲復，皆得剛健上通，則是陰不能固陽，而九三劣弱，又不能自復，則是陽不薄陰，是以皆不雨也。且小畜之義，貴於上往，而九三不能自復，更為劣弱，故言「九三更不能復為劣」也。「能固其路而安於上」者，謂上九能閉固九三之道路，不被九三所陵，得安於上，所以「既雨既處」也，故舉一卦而論之。「能為小畜密雲而已」者，此明卦之與爻，其義別也。但卦總二象，明上體不能閉固下體，所以密雲不能為雨。爻則止明一爻之事，上九能固九三，所以上九而有雨也。所以卦與爻其義異也。諸卦多然。若《比卦》云「比吉」，上六則云「比之无首凶」也；《復卦》云「復亨」，上六云「迷復凶」也。此皆卦之與爻，義相違反，它皆倣此。"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "type": "大象",
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：風行天上，小畜。君子以懿文德。",
          "children": [
            {
              "type": "注",
              "text": "未能行其施者，故可以懿文德而已。"
            },
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：「君子以懿文德」者，懿，美也。以於其時施末得行，喻君子之人但脩美文德，待時而發。風為號令，若「風行天下」，則施附於物，不得云「施未行」也。今風在天上，去物既遠，无所施及，故曰「風行天上」。凡大象，君子所取之義，或取二卦之象而法之者，若「地中有水，師，君子以容民畜眾」，取卦象包容之義；若《履卦‧象》云「上天下澤，履，君子以辯上下」，取上下尊卑之義。如此之類，皆取二象，君子法以為行也。或直取卦名，因其卦義所有，君子法之，須合卦義行事者。若《訟卦》云「君子以作事謀始」，防其所訟之源，不取「天與水違行」之象；若《小畜》「君子以懿文德」，不取「風行天上」之象。餘皆倣此。"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 1,
      "lines": [
        {
          "type": "句",
          "value": "初九，復自道，何其咎？吉。",
          "children": [
            {
              "type": "注",
              "text": "處乾之始，以升巽初，四為己應，不距己者也。以陽升陰，復自其道，順而无違，何所犯咎，得義之吉。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 1,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：復自道，其義吉也。",
          "children": [
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：處乾之始以升巽，初四為己應，以陽升陰，反復於上，自用己道，四則順而无違，於己无咎，故云「復自道，何其咎？吉」。"
                }
              ]
            }
          ]
        },
        {
          "type": "句",
          "value": "《象》曰「其義吉」者，以陽升陰，以剛應柔，其義於理吉也。"
        }
      ]
    },
    {
      "type": "爻",
      "index": 2,
      "lines": [
        {
          "type": "句",
          "value": "九二，牽復，吉。",
          "children": [
            {
              "type": "注",
              "text": "處乾之中，以升巽五，五非畜極，非固己者也。雖不能若陰之不違，可牽以獲復，是以吉也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 2,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：牽復在中，亦不自失也。",
          "children": [
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：「牽復吉」者，牽謂牽連，復謂反復，二欲往五，五非止畜之極，不閉固於己，可自牽連反復於上而得吉也。"
                },
                {
                  "type": "句",
                  "value": "《象》曰：「牽復在中，亦不自失也」者，既彊牽連，而復在下卦之中，以其得中，不被閉固，亦於己不自有失，解「牽復吉」也。"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 3,
      "lines": [
        {
          "type": "句",
          "value": "九三，輿說輻。夫妻反目。",
          "children": [
            {
              "type": "注",
              "text": "上為畜盛，不可牽征，以斯而進，故必說輻也。己為陽極，上為陰長，畜於陰長，不能自復，方之「夫妻反目」之義也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 3,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：夫妻反目，不能正室也。",
          "children": [
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：九三欲復而進，上九固而止之，不可以行，故車輿說其輻。「夫妻反目」者，上九體巽為長女之陰，今九三之陽被長女閉固，不能自復，夫妻乖戾，故反目相視。"
                },
                {
                  "type": "句",
                  "value": "《象》曰「不能正室」者，釋「夫妻反目」之義。以九三之夫不能正上九之室，故反目也。此假象以喻人事也。"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 4,
      "lines": [
        {
          "type": "句",
          "value": "六四，有孚，血去惕出，无咎。",
          "children": [
            {
              "type": "注",
              "text": "夫言血者，陽犯陰也。四乘於三，近不相得，三務於進，而己隔之，將懼侵克者也。上亦惡三而能制焉，志與上合，共同斯誠，三雖逼己，而不能犯，故得血去懼除，保无咎也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 4,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：有孚惕出，上合志也。",
          "children": [
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：「有孚，血去惕出，无咎」者，六四居九三之上，乘陵於三，三既務進，而己固之，懼三害己，故有血也。畏三侵陵，故惕懼也。但上九亦憎惡九三，六四與上九同志，共惡於三，三不能害己，故得其血去除，其惕出散，信能血去懼除，乃得无咎。"
                },
                {
                  "type": "句",
                  "value": "《象》曰「有孚惕出，上合志也」者，釋惕出之意。所以惕出者，由己與上九同合其志，共惡於三也。"
                },
                {
                  "type": "句",
                  "value": "注「夫言」至「无咎也」。　正義曰：「夫言血者陽犯陰也」者，謂此卦言血，陽犯陰也。夫者，發語之端，非是總凡之辭。故《需》六四云「需於血」，注云：「凡稱血者，陰陽相傷也」。則稱血者，非唯陽犯陰也。"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "type": "爻",
      "index": 5,
      "lines": [
        {
          "type": "句",
          "value": "九五，有孚攣如，富以其鄰。",
          "children": [
            {
              "type": "注",
              "text": "處得尊位，不疑於二，來而不距。二牽己攣，不為專固，有孚攣如之謂也。以陽居陽，處實者也。居盛處實而不專固，富以其鄰者也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 5,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：有孚攣如，不獨富也。",
          "children": [
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：「有孚攣如」者，五居尊位，不疑於二，來而不距。二既牽挽而來，己又攀攣而迎接，志意合同，不有專固相逼，是有信而相牽攣也。如，語辭，非義類。"
                }
              ]
            }
          ]
        },
        {
          "type": "句",
          "value": "「富以其鄰」者，五是陽爻，即必富實。心不專固，故能用富以與其鄰。鄰謂二也。"
        },
        {
          "type": "句",
          "value": "《象》曰「不獨富也」者，釋攣如之義。所以攀攣於二者，以其不獨自專固於富，欲分與二也。"
        }
      ]
    },
    {
      "type": "爻",
      "index": 6,
      "lines": [
        {
          "type": "句",
          "value": "上九，既雨既處，尚德載，婦貞厲，月幾望，君子征凶。",
          "children": [
            {
              "type": "注",
              "text": "處小畜之極，能畜者也。陽不獲亨，故既雨也。剛不能侵，故既處也。體巽處上，剛不敢犯，尚德者也。為陰之長，能畜剛健，德積載者也。婦制其夫，臣制其君，雖貞近危，故曰婦貞厲也。陰之盈盛莫盛於此，故曰月幾望也。滿而又進，必失其道，陰疑於陽，必見戰伐，雖復君子，以征必凶，故曰君子征凶也。"
            }
          ]
        }
      ]
    },
    {
      "type": "小象",
      "index": 6,
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：既雨既處，德積載也。君子征凶，有所疑也。",
          "children": [
            {
              "type": "注",
              "text": "夫處下可以征而无咎者，唯泰也則然。坤本體下，又順而弱，不能敵剛，故可以全其類，征而吉也。自此以往，則其進各有難矣。夫巽雖不能若艮之善畜，猶不肯為坤之順從也，故可得少進，不可盡陵也。是以初九、九二，其復則可，至於九三，則輿說輻也。夫大畜者，畜之極也。畜而不已，畜極則通，是以其畜之盛在於四、五，至于上九，道乃大行。小畜積極而後乃能畜，是以四、五可以進，而上九說征之輻。"
            },
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：「既雨既處」者，九三欲進，己能固之，陰陽不通，故已得其雨也。既處者，三不能侵，不憂危害，故已得其處也。"
                },
                {
                  "type": "句",
                  "value": "「尚德載」者，體巽處上，剛不敢犯，為陰之長，能畜止剛健，慕尚此德之積聚而運載也，故云「尚德載」也。言慕尚此道德之積載也。"
                }
              ]
            }
          ]
        },
        {
          "type": "句",
          "value": "「婦貞厲」者，上九制九三，是婦制其夫，臣制其君，雖復貞正，而近危厲也。"
        },
        {
          "type": "句",
          "value": "「月幾望」者，婦人之制夫，猶如月在望時盛極以敵日也。幾，辭也，已從上釋，故於此不復言也。"
        },
        {
          "type": "句",
          "value": "「君子征凶」者，陰疑於陽，必見戰伐，雖復君子之行而亦凶也。"
        },
        {
          "type": "句",
          "value": "《象》曰「既雨既處，德積載」者，釋「既雨既處」之義。言所以得「既雨既處」者，以上九道德積聚，可以運載，使人慕尚，故云「既雨既處」也。「君子征凶有所疑」者，釋「君子征凶」之義，言所以征凶者，陰氣盛滿，被陽有所疑忌，必見戰伐，故征凶也。"
        },
        {
          "type": "句",
          "value": "注「處小畜」至「征凶」。　正義曰：「處小畜之極，能畜者也」者，已處小畜盛極，是閉畜者也。「陽不獲亨，故既雨也」者，陽若亨通則不雨也。所以卦繇辭云：「小畜，亨，密雲不雨。」今九三之陽，被上九所固，不獲亨通，故既雨也。"
        },
        {
          "type": "句",
          "value": "注「夫處」至「征之輻」。　正義曰：「夫巽雖不能若艮之善畜」者，謂雖不能如大畜艮卦在上，善畜下之乾也。巽雖不能如艮之善畜，故其畜小也。「猶不肯為坤之順從」者，謂猶不肯如泰卦，坤在於上順從乾也。「故可得少進」者，謂初九、九二得前進也。「不可盡陵」者，九三欲陵上九，被上九所固，是不可得「盡陵」也。「畜而不已，畜極則通，是以其畜之盛在于四五，至于上九，道乃大行」者，此論大畜義也。大畜畜而不已，謂之「大畜」。四爻、五爻是畜之盛極，而不休已，畜極則通。四、五畜道既極，至於上九，无可所畜，故上九道乃大行，无所畜也。「小畜積極而後乃能畜」者，小畜之道既微，積其終極，至於上九，乃能畜也，謂畜九三也。「是以四、五可以進」者，四雖畜初，五雖畜二，畜道既弱，故初二可以進。「上九說征之輻」者，上九畜之積極，故能說此九三征行之輻。案：九三但有說輻，无征之文。而王氏言上九「說征之輻」者，輿之有輻，可以征行。九三爻有征義，今輿輻既說，則是說征之輻，因上九征凶之文，征則行也。文雖不言，於義必有言輻者。鄭《注》云「謂輿下縛木，與軸相連，鈎心之木」是也。《子夏傳》云：「輻，車劇也。」"
        },
        {
          "type": "句",
          "value": " "
        }
      ]
    }
  ]
}