{
  "name": "乾",
  "down": "乾",
  "up": "乾",
  "guaci": {
    "jijie": [
      {
        "type": "句",
        "value": "乾，元享利貞。",
        "children": [
          {
            "type": "集解",
            "list": [
              {
                "text": "周氏曰：元始也。於時配春，言萬物始生，得其元始之序。發育長養。亨，通也，於時配夏以通暢合其嘉美之道。利者義也，於時配秋，秋以成實得其利物之宜。貞者正也，於時配冬，冬以物之終納幹正之道。",
                "book": "［史徵《周易口訣義》］"
              },
              {
                "text": "　魏徵曰：始萬物為元，遂萬物為亨，益萬物為利，不私萬物為貞。",
                "book": "［李衡義海撮要］"
              }
            ]
          }
        ]
      }
    ],
    "wangzhu": [
      {
        "type": "句",
        "value": "乾，元亨利貞。 初九，潛龍勿用。",
        "children": [
          {
            "type": "注",
            "text": "文言備矣。"
          }
        ]
      },
      {
        "type": "句",
        "value": "九二，見龍在田，利見大人。",
        "children": [
          {
            "type": "注",
            "text": "出潛離隱，故曰「見龍」；處於地上，故曰「在田」。德施周普，居中不偏，雖非君位，君之德也。初則不彰，三則乾乾，四則或躍，上則過亢。利見大人，唯二、五焉。"
          }
        ]
      },
      {
        "type": "句",
        "value": "九三，君子終日乾乾，夕惕若厲，无咎。",
        "children": [
          {
            "type": "注",
            "text": "處下體之極，居上體之下，在不中之位，履重剛之險。上不在天，未可以安其尊也。下不在田，未可以寧其居也。純修下道，則居上之德廢；純修上道，則處下之禮曠。故終日乾乾，至於夕惕猶若厲也。居上不驕，在下不憂，因時而惕，不失其幾，雖危而勞，可以无咎。處下卦之極，愈於上九之亢，故竭知力而後免於咎也。乾三以處下卦之上，故免亢龍之悔。坤三以處下卦之上，故免龍戰之災。"
          }
        ]
      },
      {
        "type": "句",
        "value": "九四，或躍在淵，无咎。",
        "children": [
          {
            "type": "注",
            "text": "去下體之極，居上體之下，乾道革之時也。上不在天，下不在田，中不在人，履重剛之險，而无定位所處，斯誠進退无常之時也。近乎尊位，欲進其道，迫乎在下，非躍所及。欲靜其居，居非所安，持疑猶豫，未敢決志。用心存公，進不在私，疑以為慮，不謬於果，故无咎也。"
          }
        ]
      },
      {
        "type": "句",
        "value": "九五，飛龍在天，利見大人。",
        "children": [
          {
            "type": "注",
            "text": "不行不躍而在乎天，非飛而何？故曰飛龍也。龍德在天，則大人之路亨也。夫位以德興，德以位敘，以至德而處盛位，萬物之覩，不亦宜乎！"
          }
        ]
      },
      {
        "type": "句",
        "value": "上九，亢龍有悔。"
      },
      {
        "type": "句",
        "value": "用九，見群龍无首，吉。",
        "children": [
          {
            "type": "注",
            "text": "九，天之德也。能用天德，乃見群龍之義焉。夫以剛健而居人之首，則物之所不與也。以柔順而為不正，則佞邪之道也。故乾吉在无首，坤利在永貞。"
          }
        ]
      }
    ],
    "ycz": [
      {
        "type": "句",
        "value": "乾：元亨利貞。",
        "children": [
          {
            "type": "注",
            "text": "上古聖人始畫八卦，三才之道備矣。因而重之，以盡天下之變，故六畫而成卦。重乾為《乾》。乾，天也。天者天之形體，乾者天之性情。乾，健也，健而无息之謂乾。夫天，專言之則道也，天且弗違是也；分而言之，則以形體謂之天，以主宰謂之帝，以功用謂之鬼神，以妙用謂之神，以性情謂之乾。乾者萬物之始，故為天，為陽，為父，為君。元亨利貞謂之四德。元者萬物之始，亨者萬物之長，利者萬物之遂，貞者萬物之成。惟乾坤有此四德，在他卦則隨事而變焉。故元專為善大，利主於正固，亨貞之體，各稱其事。四德之義，廣矣大矣。"
          }
        ]
      }
    ],
    "zx": [
      {
        "type": "句",
        "value": "乾，元亨利貞。",
        "children": [
          {
            "type": "注",
            "text": "（乾，渠焉反。）六畫者，伏羲所畫之卦也。「—」者，奇也，陽之數也。乾者，健也，陽之性也。本注乾字，三畫卦之名也。下者，內卦也；上者，外卦也。經文乾字，六畫卦之名也。伏羲仰觀俯察，見陰陽有奇偶之數，故畫一奇以象陽，畫一偶以象陰。見一陰一陽有各生一陰一陽之象，故自下而上，再倍而三，以成八卦。見陽之性健，而其成形之大者為天，故三奇之卦，名之曰乾，而擬之於天也。三畫已具，八卦已成，則又三倍其畫，以成六畫，而於八卦之上，各加八卦，以成六十四卦也。此卦六畫皆奇，上下皆乾，則陽之純而健之至也。故乾之名，天之象，皆不易焉。元亨利貞，文王所繫之辭，以斷一卦之吉凶，所謂《彖辭》者也。元，大也。亨，通也。利，宜也。貞，正而固也。文王以為乾道大通而至正，故於筮得此卦，而六爻皆不變者，言其占當得大通，而必利在正固，然後可以保其終也。此聖人所以作《易》，教人卜筮，而可以開物成務之精意。餘卦放此。"
          }
        ]
      }
    ],
    "zhengyi": [
      {
        "type": "句",
        "value": "乾，元亨利貞。",
        "children": [
          {
            "type": "疏",
            "lines": [
              {
                "type": "句",
                "value": "疏　正義曰：乾者，此卦之名。謂之卦者，《易緯》云：「卦者掛也，言縣掛物象，以示於人，故謂之卦。」但二畫之體，雖象陰陽之氣，未成萬物之象，未得成卦，必三畫以象三才，寫天、地、雷、風、水、火、山、澤之象，乃謂之卦也。故《繫辭》云「八卦成列，象在其中矣」是也。但初有三畫，雖有萬物之象，於萬物變通之理，猶有未盡，故更重之而有六畫，備萬物之形象，窮天下之能事，故六畫成卦也。此乾卦本以象天，天乃積諸陽氣而成天，故此卦六爻皆陽畫成卦也。此既象天，何不謂之天，而謂之乾者？天者定體之名，乾者體用之稱。故《說卦》云「乾，健也」。言天之體，以健為用。聖人作《易》本以教人，欲以法天之用，不法天之體，故名乾，不名天也。天以健為用者，運行不息，應化无窮，此天之自然之理，故聖人當法此自然之象而施人事，亦當應物成務，云為不已，終日乾乾，无時懈倦，所以應天象以教人事。於物象言之，則純陽也，天也。於人事言之，則君也，父也。以其居尊，故在諸卦之首，為《易》理之初。但聖人名卦，體例不同，或則以物象而為卦名者，若否、泰、剝、頤、鼎之屬是也；或以象之所用而為卦名者，即乾、坤之屬是也。如此之類多矣。雖取物象，乃以人事而為卦名者，即家人、歸妹、謙、履之屬是也。所以如此不同者，但物有萬象，人有萬事，若執一事，不可包萬物之象；若限局一象，不可總萬有之事，故名有隱顯，辭有踳駁，不可一例求之，不可一類取之。故《繫辭》云：「上下无常，剛柔相易，不可為典要。」韓康伯注云「不可立定準」是也。元亨利貞者，是乾之四德也。《子夏傳》云：「元，始也。亨，通也。利，和也。貞，正也。」言此卦之德，有純陽之性，自然能以陽氣始生萬物而得元始亨通，能使物性和諧，各有其利，又能使物堅固貞正得終。此卦自然令物有此四種使得其所，故謂之四德。言聖人亦當法此卦而行善道，以長萬物，物得生存而為元也。又當以嘉美之事，會合萬物，令使開通而為亨也。又當以義協和萬物，使物各得其理而為利也。又當以貞固幹事，使物各得其正而為貞也。是以聖人法乾而行此四德，故曰「元亨利貞」。其委曲條例，備在《文言》。"
              }
            ]
          }
        ]
      }
    ]
  },
  "tuan": {
    "jijie": {
      "type": "彖",
      "lines": [
        {
          "type": "句",
          "value": "《彖》曰：",
          "children": [
            {
              "type": "集解",
              "list": [
                {
                  "text": "王弼曰：彖者何也？統論一卦之體，明其所繇之主。",
                  "book": "［疏］"
                },
                {
                  "text": "　褚氏曰：彖，斷也，斷定一卦之義，所以名為彖也。 　莊氏同。　莊氏又曰：夫子為彖，凡有一十二體，發首則歎美卦者則此。乾彖云「大哉乾元」，坤卦彖云「至哉坤元」，以乾坤德大，故先歎美之，乃後詳說其義。或有先疊文解義而後歎者，則豫卦歎云「豫之時義大矣哉」之類是也。或有先釋卦名之義，後以卦名結之者，則同人彖云「柔得位得中而應乎乾曰同人」，大有彖云「柔得尊位，大中而上下應之曰大有」之例（類）是也。或有特疊卦名而稱其卦者，則同人彖云「同人曰：同人於野，亨」。",
                  "book": "［并同］"
                }
              ]
            }
          ]
        },
        {
          "type": "句",
          "value": "大哉乾元，",
          "children": [
            {
              "type": "集解",
              "list": [
                {
                  "text": " 莊氏曰：「大哉乾元，萬物資始，乃統天」者此三句總釋乾與元也。乾是卦名，元是乾德之首，故以元德配乾釋之。陽氣昊大，乾體廣遠，又以元大始生萬物，故曰大哉乾元。",
                  "book": "［疏］"
                }
              ]
            }
          ]
        },
        {
          "type": "句",
          "value": "萬物資始，",
          "children": [
            {
              "type": "集解",
              "list": [
                {
                  "text": "鄭康成曰：資取也。",
                  "book": "［釋文］"
                },
                {
                  "text": "　莊氏曰：萬物資始者釋其乾元稱大之義，以萬象之物皆資取乾元而各得始生，不失其宜，所以稱大也。",
                  "book": "［疏］"
                }
              ]
            }
          ]
        },
        {
          "type": "句",
          "value": "乃統天。",
          "children": [
            {
              "type": "集解",
              "list": [
                {
                  "text": "鄭康成曰：統，本也。",
                  "book": "［釋文］"
                },
                {
                  "text": "　莊氏曰：乃統天者，以其至健而為物始，以此乃能統領於天。天是有形之物，以其至健能總統有形，是乾元之德也。",
                  "book": "［疏］"
                }
              ]
            }
          ]
        },
        {
          "type": "句",
          "value": "雲行雨施，品物流形。",
          "children": [
            {
              "type": "集解",
              "list": [
                {
                  "text": " 莊氏曰：此二句釋亨之德也，言乾能用大之德，使雲氣流行，雨澤施布，故品類之物，流布成形，各得亨通，无所壅蔽，是其亨也。",
                  "book": "［疏］"
                }
              ]
            }
          ]
        },
        {
          "type": "句",
          "value": "大明終始，六位時成，",
          "children": [
            {
              "type": "集解",
              "list": [
                {
                  "text": "莊氏曰：此二句總結乾卦之德也，以乾之為德大，明曉乎萬物終始之道，始則潛伏，終則飛躍，可潛則潛，可飛則飛，是明達乎終始之道，故六爻之位，依時而成，若其不明終始之道，應潛而飛，應飛而潛，應生而殺，應殺而生，六位不以時而成也。",
                  "book": "［疏］"
                }
              ]
            }
          ]
        },
        {
          "type": "句",
          "value": "時乘六龍以御天。",
          "children": [
            {
              "type": "集解",
              "list": [
                {
                  "text": " 孟喜曰：天子駕六。",
                  "book": "［詩疏］"
                },
                {
                  "text": "　莊氏曰：此二句申明乾元乃統天之義，言乾之為德，以依時乘駕六爻之陽氣，以控御於天體，六龍即六位之龍也，以所居上下言之，謂之六位也。陽氣升降，謂之六龍也。上文以至健元始總明乾德，故云乃統天也。此名乘駕六龍，各分其事，故云以御天也。",
                  "book": "［疏］"
                }
              ]
            }
          ]
        },
        {
          "type": "句",
          "value": "乾道變化，各正性命。",
          "children": [
            {
              "type": "集解",
              "list": [
                {
                  "text": " 莊氏曰：此二句更申明乾元資始之義，道體無形，自然使物開通，謂之為道。言乾卦之德，自然通物，故云乾道也。變謂後來改前，以漸移改謂之變也。化謂一有一無，忽然而改，謂之為化。言乾之為道，使物漸變者，使物卒化者，各能正定物之性命。性者天生之質，若剛柔遲速之別。命者人所稟受，若貴賤夭壽之屬是也。",
                  "book": "［疏］"
                }
              ]
            }
          ]
        },
        {
          "type": "句",
          "value": "保合太和，乃利貞。"
        },
        {
          "type": "句",
          "value": "首出四物，萬國咸寧。",
          "children": [
            {
              "type": "括号",
              "text": "（郭按：「首出四物」或作「首出庶物」）"
            }
          ]
        }
      ]
    },
    "wangzhu": {
      "type": "彖",
      "lines": [
        {
          "type": "句",
          "value": "彖曰：大哉乾元，萬物資始，乃統天。雲行雨施，品物流形。大明終始，六位時成，時乘六龍以御天。乾道變化，各正性命。",
          "children": [
            {
              "type": "注",
              "text": "天也者，形之名也。健也者，用形者也。夫形也者，物之累也。有天之形而能永保无虧，為物之首，統之者豈非至健哉！大明乎終始之道，故六位不失其時而成，升降无常，隨時而用，處則乘潛龍，出則乘飛龍，故曰「時乘六龍」也。乘變化御大器，靜專動直，不失太和，豈非正性命之情者邪！"
            }
          ]
        },
        {
          "type": "句",
          "value": "保合大和，乃利貞。",
          "children": [
            {
              "type": "注",
              "text": "不和而剛暴。"
            }
          ]
        },
        {
          "type": "句",
          "value": "首出庶物，萬國咸寧。",
          "children": [
            {
              "type": "注",
              "text": "萬國所以寧，各以有君也。"
            }
          ]
        }
      ]
    },
    "ycz": {
      "type": "彖",
      "lines": [
        {
          "type": "句",
          "value": "《彖》曰：大哉乾元！萬物資始乃統天。"
        },
        {
          "type": "句",
          "value": "雲行雨施，品物流形。"
        },
        {
          "type": "句",
          "value": "大明終始，六位時成，時乘六龍以禦天。"
        },
        {
          "type": "句",
          "value": "乾道變化，各正性命，保合太和，乃利貞。"
        },
        {
          "type": "句",
          "value": "首出庶物，萬國咸寧。",
          "children": [
            {
              "type": "注",
              "text": "卦下之辭為彖。夫子從而釋之，通謂之彖。彖者，言一卦之義。故知者觀其彖辭，則思過半矣。大哉乾元，讚乾元始萬物之道大也。四德之元，猶五常之仁，偏言則一事，專言則包四者。萬物資始乃統天，言元也。乾元統言天之道也。天道始萬物，物資始於天也。雲行雨施，品物流形，言亨也。天道運行，生育萬物也。大明天道之終始，則見卦之六位，各以時成。卦之初終，乃天道終始。乘此六爻之時，乃天運也。以禦天，謂以當天運。乾道變化，生育萬物，洪纖高下，各以其類，各正性命也。天所賦為命，物所受為性。保合太和乃利貞，保謂常存，合謂常和，保合太和，是以利且貞也。天地之道，常久而不已者，保合太和也。天為萬物之祖，王為萬邦之宗。乾道首出庶物而萬彙亨，君道尊臨天位而四海從。王者體天之道，則萬國咸寧也。"
            }
          ]
        }
      ]
    },
    "zhengyi": {
      "type": "彖",
      "lines": [
        {
          "type": "句",
          "value": "《彖》曰：大哉乾元！萬物資始，乃統天。雲行雨施，品物流形，大明終始，六位時成，時乘六龍，以御天。乾道變化，各正性命。",
          "children": [
            {
              "type": "注",
              "text": "天也者，形之名也。健也者，用形者也。夫形也者，物之累也。有天之形而能永保无虧，為物之首，統之者豈非至健哉！大明乎終始之道，故六位不失其時而成，升降无常，隨時而用，處則乘潛龍，出則乘飛龍，故曰「時乘六龍」也。乘變化御大器，靜專動直，不失太和，豈非正性命之情者邪！"
            }
          ]
        },
        {
          "type": "句",
          "value": "保合大和，乃利貞。",
          "children": [
            {
              "type": "注",
              "text": "不和而剛暴。"
            }
          ]
        },
        {
          "type": "句",
          "value": "首出庶物，萬國咸寧。",
          "children": [
            {
              "type": "注",
              "text": "萬國所以寧，各以有君也。"
            },
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：夫子所作《彖》辭，統論一卦之義，或說其卦之德，或說其卦之義，或說其卦之名，故《略例》云：「彖者何也？統論一卦之體，明其所由之主。」案：褚氏、莊氏並云：「彖，斷也，斷定一卦之義，所以名為彖也。」但此《彖》釋乾與元亨利貞之德。但諸儒所說此《彖》分解四德，意各不同。今案：莊氏之說，於理稍密，依而用之。"
                },
                {
                  "type": "句",
                  "value": "「大哉乾元，萬物資始，乃統天」者，此三句總釋乾與元也。乾是卦名，元是乾德之首，故以元德配乾釋之。「大哉乾元」者，陽氣昊大，乾體廣遠，又以元大始生萬物，故曰「大哉乾元」。「萬物資始」者，釋其乾元，稱大之義，以萬象之物，皆資取乾元，而各得始生，不失其宜，所以稱大也。「乃統天」者，以其至健而為物始，以此乃能統領於天，天是有形之物，以其至健，能總統有形，是乾元之德也。「雲行雨施，品物流形」者，此二句釋亨之德也，言乾能用天之德，使雲氣流行，雨澤施布，故品類之物，流布成形*，各得亨通，无所壅蔽，是其亨也。「大明終始，六位時成」者，此二句總結乾卦之德也。以乾之為德，大明曉乎萬物終始之道，始則潛伏，終則飛躍，可潛則潛，可飛則飛，是明達乎始終之道，故六爻之位，依時而成。若其不明終始之道，應潛而飛，應飛而潛，應生而殺，應殺而生，六位不以時而成也。「時乘六龍，以御天」者，此二句申明乾元乃統天之義，言乾之為德，以依時乘駕六爻之陽氣，以控御於天體。六龍，即六位之龍也。以所居上下言之，謂之六位也；陽氣升降，謂之六龍也。上文以至健元始總明乾德，故云「乃統天」也。此名乘駕六龍，各分其事，故云「以御天」也。「乾道變化，各正性命」者，此二句更申明乾元資始之義。道體无形，自然使物開通，謂之為道。言乾卦之德，自然通物，故云乾道也。變謂後來改前，以漸移改，謂之變也。化謂一有一无，忽然而改，謂之為化。言乾之為道，使物漸變者，使物卒化者，各能正定物之性命。性者天生之質，若剛柔遲速之別；命者人所稟受，若貴賤夭壽之屬是也。"
                }
              ]
            }
          ]
        },
        {
          "type": "句",
          "value": "*形：原文做｢行｣，有誤。"
        },
        {
          "type": "句",
          "value": " ｢保合大和，乃利貞｣者，此二句釋利貞也。純陽剛暴，若无和順，則物不得利，又失其正。以能保安合會大和之道，乃能利貞於萬物，言萬物得利而貞正也。"
        },
        {
          "type": "句",
          "value": "｢首出庶物，萬國咸寧｣者自上已來，皆論乾德自然養萬物之道。此二句論聖人上法乾德，生養萬物，言聖人為君在眾物之上，最尊高於物，似頭首出於眾物之上，各置君長以領萬國，故萬國皆得寧也。人君位實尊高，故於此云首出於庶物者也。志須卑下，故前經云「无首，吉」也。但前文說乾用天德，其事既詳，故此文聖人以人事象乾，於文略也。以此言之，聖人亦當令萬物資始，統領於天位，而雲行雨施，布散恩澤，使兆庶眾物，各流布其形，又大明乎盛衰終始之道，使天地四時貴賤高下，各以時而成。又任用群賢，以奉行聖化，使物各正性命。此聖人所以象乾而立化。"
        },
        {
          "type": "句",
          "value": "注「天也者至者邪｣：正義曰：夫形也者，物之累也。凡有形之物，以形為累，是含生之屬，各憂性命。而天地雖復有形，常能永保无虧，為物之首，豈非統用之者至極健哉！若非至健，何能使天形无累？見其无累，則知至健也。「乘變化而御大器」者，乘變化，則乘潛龍，飛龍之屬是也。而御大器，大器謂天也。乘此潛龍、飛龍而控御天體，所以運動不息，故云「而御大器」也。「靜專動直，不失大和」者，謂乾之為體，其靜住之時，則專一不轉移也，其運動之時，正直不傾邪也。故《上繫辭》云：「夫乾，其靜也專，其動也直，是以大生焉。」韓康伯注云：「專，專一也。直，剛正也。」「不失大和」，則下文「保合大和」是也。「豈非正性命之情者邪」，以乾能正定物之性命，故云「豈非正性命之情者邪」，謂物之性命各有情，非天之情也。天本无情，何情之有？而物之性命，各有情也。所稟生者謂之性，隨時念慮謂之情，无識无情，今據有識而言，故稱曰情也。夫子為《彖》之體，斷明一卦之義，體例不同。莊氏以為凡有一十二體，今則略舉大綱，不可事事繁說。莊氏云「《彖》者發首則歎美卦」者，則此《乾．彖》云「大哉乾元」，《坤卦．彖》云「至哉坤元」。以乾、坤德大，故先歎美之，乃後詳說其義。或有先疊文解義而後歎者，則《豫卦．彖》云：「豫之時義大矣哉」之類是也。或有先釋卦名之義，後以卦名結之者，則《同人．彖》云「柔得位得中而應乎乾，曰同人」，《大有．彖》云「柔得尊位大中而上下應之曰大有｣之例是也。或有特疊卦名而稱其卦者，則同人彖云：「同人曰：同人于野，亨。」注云：「同人于野，亨，利涉大川，非二之所能也。是乾之所行，故特曰同人曰。」此等之屬，為文不同，唯同人之《彖》特稱「同人曰」，注又別釋。其餘諸卦之《彖》，或詳或略，或先或後，故上下參差，體例不同，或難其解，或易略解。若一一比竝，曲生節例，非聖人之本趣，恐學者之徒勞，心不曉也。今皆略而不言，必有其義，於卦下而具說。"
        }
      ]
    }
  },
  "yao": [
    {
      "jijie": {
        "type": "爻",
        "index": 1,
        "lines": [
          {
            "type": "句",
            "value": "初九，潛龍勿用。",
            "children": [
              {
                "type": "集解",
                "list": [
                  {
                    "text": "鄭康成曰：《周易》以變者為占，故稱九稱六。",
                    "book": "［孔穎達疏］"
                  },
                  {
                    "text": "　陸績曰：陽在初稱初九，去初之二稱九二，則初復七。陰在初稱初六，去初之二稱六二，則初復八矣。",
                    "book": "［朱震漢上傳］"
                  },
                  {
                    "text": "　莊氏曰：下言初則上有末義，故大過《彖》曰「棟橈，本末弱」，是上有末義。六言上則初當言下，故《小象》曰「潛龍勿用，陽在下也」。則是初有下義。",
                    "book": "［疏］"
                  },
                  {
                    "text": "　張氏曰：陽數有七有九，陰數有八有六，但七為少陽，八為少陰，質而不變為爻之本體，九為老陽，六為老陰，文而從變，故為爻之別名，且七既為陽爻，其畫已長，今有九之老陽，不可復畫為陽，所以重體避少陽七數，故稱九也。八為陰數而畫陰爻，今六為老陰不可復畫陰爻，故交其體，避八而稱六。　張氏又曰：以道未可行故稱勿用以誡之。",
                    "book": "［并同］"
                  }
                ]
              }
            ]
          }
        ]
      },
      "ycz": {
        "type": "爻",
        "index": 1,
        "lines": [
          {
            "type": "句",
            "value": "初九，潛龍勿用。",
            "children": [
              {
                "type": "注",
                "text": "下爻為初。九，陽數之盛，故以名陽爻。理无形也，故假象以顯義。乾以龍為象。龍之為物，靈變不測，故以象乾道變化，陽氣消息，聖人進退。初九在一卦之下，為始物之端，陽氣方萌。聖人側微，若龍之潛隱，未可自用，當晦養以俟時。"
              }
            ]
          }
        ]
      },
      "zx": {
        "type": "爻",
        "index": 1,
        "lines": [
          {
            "type": "句",
            "value": "初九，潛龍勿用。",
            "children": [
              {
                "type": "注",
                "text": "（潛，捷言反。）初九者，卦下陽爻之名。凡畫卦者，自下而上，故以下爻為初。陽數九為老，七為少，老變而少不變，故謂陽爻為九。潛龍勿用，周公所繫之辭，以斷一爻之吉凶，所謂「爻辭」者也。潛，藏也。龍，陽物也。初陽在下，未可施用，故其象為潛龍。其占曰勿用。凡遇乾而此爻變者，當觀此象，而玩其占也。餘爻放此。"
              }
            ]
          }
        ]
      },
      "zhengyi": {
        "type": "爻",
        "index": 1,
        "lines": [
          {
            "type": "句",
            "value": "初九曰：「潛龍勿用。」何謂也？子曰：「龍德而隱者也。不易乎世。",
            "children": [
              {
                "type": "注",
                "text": "不為世俗所移易也。"
              }
            ]
          },
          {
            "type": "句",
            "value": "不成乎名，遯世无悶，不見是而无悶，樂則行之，憂則違之，確乎其不可拔，潛龍也。",
            "children": [
              {
                "type": "疏",
                "lines": [
                  {
                    "type": "句",
                    "value": "疏　正義曰：此第二節釋初九爻辭也。「初九曰：潛龍勿用，何謂也」者，此夫子疊經初九爻辭，故言「初九曰」。方釋其義，假設問辭，故言「潛龍勿用何謂也」。「子曰：龍德而隱者也」，此夫子以人事釋「潛龍」之義，聖人有龍德隱居者也。「不易乎世」者，不移易其心在於世俗，雖逢險難，不易本志也。「不成乎名」者，言自隱默，不成就於令名，使人知也。「遯世无悶」者，謂逃遯避世，雖逢无道，心無所悶。「不見是而无悶」者，言舉世皆非，雖不見善，而心亦无悶。上云「遯世无悶」，心處僻陋，不見是而无悶，此因見世俗行惡，是亦无悶，故再起「无悶」之文。「樂則行之，憂則違之」者，心以為樂，已則行之，心以為憂，已則違之。「確乎其不可拔」者，身雖逐物推移，隱潛避世，心志守道，確乎堅實其不可拔，此是潛龍之義也。"
                  }
                ]
              }
            ]
          }
        ]
      }
    },
    {
      "jijie": {
        "type": "爻",
        "index": 2,
        "lines": [
          {
            "type": "句",
            "value": "九二，見龍在田，利見大人。",
            "children": [
              {
                "type": "集解",
                "list": [
                  {
                    "text": "孟喜京房說易有周人五號：帝天稱，一也。王美稱，二也。天子爵號，三也。大君者興盛行異，四也。大人者聖人德備，五也。",
                    "book": "［禮記疏］"
                  },
                  {
                    "text": "　鄭康成曰：九二利見九五之大人。　褚氏張氏同。",
                    "book": "［并疏］"
                  },
                  {
                    "text": "　王肅曰：大人，聖人在位之目。",
                    "book": "［釋文］"
                  },
                  {
                    "text": "　向秀曰：聖人在位謂之大人。",
                    "book": "［史記索隱］"
                  },
                  {
                    "text": "　先儒云：若夫子教於洙泗，利益天下，有人君之德，故稱大人。",
                    "book": "［疏］"
                  },
                  {
                    "text": "　又云：重卦之時，重於上下兩體，故初與四相應，二與五相應，三與上相應矣。上下兩體，論天地人各別，但易含萬象，為例非一，及其六位，則一二為地道，三四為人道，五上為天道，二在一上，是九二處其地上，所由食之處唯在地上，所以稱田也。　又云：言田之耕稼利益及於萬物盈滿，有益於人，猶若聖人益及於萬物，故稱田也。　又云：九二當太蔟之月。",
                    "book": "［并同］"
                  }
                ]
              }
            ]
          }
        ]
      },
      "ycz": {
        "type": "爻",
        "index": 2,
        "lines": [
          {
            "type": "句",
            "value": "九二，見龍在田，利見大人。",
            "children": [
              {
                "type": "注",
                "text": "田，地上也。出見於地上，其德已著。以聖人言之，舜之田漁時也。利見大德之君，以行其道。君亦利見大德之臣，以共成其功。天下利見大德之人，以被其澤。大德之君，九五也。乾坤純體，不分剛柔，而以同德相應。"
              }
            ]
          }
        ]
      },
      "zx": {
        "type": "爻",
        "index": 2,
        "lines": [
          {
            "type": "句",
            "value": "九二，見龍在田，利見大人。",
            "children": [
              {
                "type": "注",
                "text": "（「見龍」之見，賢遍反。卦內「見龍」並同。）二，謂自下而上，第二爻也。後放此。九二剛健中正，出潛離隱，澤及於物，物所利見，故其象為見龍在田，其占為利見大人。九二雖未得位，而大人之德已著，常人不足以當之，故值此爻之變者，但為利見此人而已。蓋亦謂在下之大人也。此以爻與占者相為主賓，自為一例。若有見龍之德，則為利見九五在上之大人矣。"
              }
            ]
          }
        ]
      },
      "zhengyi": {
        "type": "爻",
        "index": 2,
        "lines": [
          {
            "type": "句",
            "value": "九二曰：「見龍在田，利見大人。」何謂也？子曰：「龍德而正中者也。庸言之信，庸行之謹，閑邪存其誠，善世而不伐，德博而化。《易》曰：｢見龍在田，利見大人。｣君德也。",
            "children": [
              {
                "type": "疏",
                "lines": [
                  {
                    "type": "句",
                    "value": "疏　正義曰：此釋九二爻辭。「子曰：龍德而正中」者，九二居中不偏，然不如九五居尊得位，故但云「龍德而正中者也」。「庸言之信，庸行之謹」者，庸謂中庸，庸，常也。從始至末，常言之信實，常行之謹慎。「閑邪存其誠」者，言防閑邪惡，當自存其誠實也。「善世而不伐」者，謂為善於世，而不自伐其功。「德博而化」者，言德能廣博，而變化於世俗。初爻則全隱遯避世，二爻則漸見德行以化於俗也。若舜漁於雷澤，陶於河濱，以器不窳，民漸化之是也。「《易》曰：見龍在田，利見大人。」君德者，以其異於諸爻，故特稱「《易》曰」。「見龍在田」，未是君位，但云「君德」也。"
                  }
                ]
              }
            ]
          }
        ]
      }
    },
    {
      "jijie": {
        "type": "爻",
        "index": 3,
        "lines": [
          {
            "type": "句",
            "value": "九三，君子終日乾乾，夕惕若厲，无咎。",
            "children": [
              {
                "type": "释文",
                "text": "「无」易內皆作此字，《說文》云：「奇字無也。」　［按］《說文》引夕惕若厲，又引作夕惕若夤。"
              },
              {
                "type": "集解",
                "list": [
                  {
                    "text": "鄭康成曰：惕，懼也。",
                    "book": "［釋文］"
                  }
                ]
              }
            ]
          }
        ]
      },
      "ycz": {
        "type": "爻",
        "index": 3,
        "lines": [
          {
            "type": "句",
            "value": "九三，君子終日乾乾，夕惕若，厲，无咎。",
            "children": [
              {
                "type": "注",
                "text": "三雖人位，已在下體之上，未離於下而尊顯者也。舜之玄德升，聞時也。日夕不懈而兢惕，則雖處危地而无咎。在下之人而君德已著，天下將歸之，其危懼可知。雖言聖人事，苟不設戒，則何以為教？作《易》之義也。"
              }
            ]
          }
        ]
      },
      "zx": {
        "type": "爻",
        "index": 3,
        "lines": [
          {
            "type": "句",
            "value": "九三，君子終日乾乾，夕惕若厲，无咎。",
            "children": [
              {
                "type": "注",
                "text": "九，陽爻。三，陽位。重剛不中，居下之上，乃危地也。然性體剛健，有能乾乾惕厲之象，故其占如此。君子，指占者而言。言能憂懼如是，則雖處危地而无咎也。"
              }
            ]
          }
        ]
      },
      "zhengyi": {
        "type": "爻",
        "index": 3,
        "lines": [
          {
            "type": "句",
            "value": "九三曰：「君子終日乾乾，夕惕若厲，无咎」，何謂也？子曰：「君子進德修業。忠信所以進德也。修辭立其誠，所以居業也。知至至之，可與幾也。知終終之，可與存義也。",
            "children": [
              {
                "type": "注",
                "text": "處一體之極，是至也。居一卦之盡，是終也。處事之至而不犯咎，知至者也。故可與成務矣。處終而能全其終，知終者也。夫進物之速者，義不若利，存物之終者，利不及義。故靡不有初，鮮克有終。夫可與存義者，其唯知終者乎？"
              }
            ]
          },
          {
            "type": "句",
            "value": "是故居上位而不驕，在下位而不憂。",
            "children": [
              {
                "type": "注",
                "text": "居下體之上，在上體之下，明夫終敝，故不驕也。知夫至至，故不憂也。"
              }
            ]
          },
          {
            "type": "句",
            "value": "故乾乾因其時而惕，雖危无咎矣。",
            "children": [
              {
                "type": "注",
                "text": "惕，怵惕之謂也。處事之極，失時則廢，懈怠則曠，故因其時而惕，雖危无咎。"
              },
              {
                "type": "疏",
                "lines": [
                  {
                    "type": "句",
                    "value": "疏　正義曰：此釋九三爻辭也。「子曰：君子進德修業」者，德謂德行，業謂功業。九三所以「終日乾乾」者，欲進益道德，修營功業，故終日乾乾，匪懈也。進德則知至，將進也；修業則知終，存義也。「忠信所以進德」者，復解進德之事，推忠於人，以信待物，人則親而尊之，其德日進，是進德也。「修辭立其誠，所以居業」者，辭謂文教，誠謂誠實也。外則修理文教，內則立其誠實，內外相成，則有功業可居，故云居業也。上云進德，下復云進德；上云修業，下變云居業者，以其間有修辭之文，故避其修文而云居業。且功業宜云居也。「知至至之，可與幾」者，九三處一體之極，方至上卦之下，是至也。既居上卦之下，而不犯凶咎，是知至也。既能知是將至，則是識幾知理，可與共論幾事。幾者，去无入有，有理而未形之時。此九三既知時節將至，知理欲到，可與共營幾也。「知終終之，可與存義」者，居一體之盡，而全其終竟，是知終也。既能知此終竟，是終盡之時，可與保存其義。義者宜也，保全其位，不有失喪，於事得宜。九三既能知其自全，故可存義。然九三唯是一爻，或使之欲進，知幾也，或使之欲退，存義也。一進一退，其意不同，以九三處進退之時，若可進則進，可退則退，兩意並行。「是故居上位而不驕」者，謂居下體之上位而不驕也，以其知終，故不敢懷驕慢。「在下位而不憂」者，處上卦之下，故稱下位，以其知事將至，務幾欲進，故不可憂也。「故乾乾因其時而惕，雖危无咎」者，九三以此之故，恒乾乾也。因其已終、已至之時，而心懷惕懼，雖危不寧，以其知終、知至，故无咎。　"
                  },
                  {
                    "type": "句",
                    "value": "注「處一體」至「知終者乎」。　正義曰：處一體之極，是至也」者，莊氏云：「極即至也。三在下卦之上，是至極。」褚氏云：「一體之極是至者，是下卦巳極，將至上卦之下，至謂至上卦也。」下云「在下位而不憂」。注云「知夫至至，故不憂」，此以人事言之。既云下位，明知在上卦之下，欲至上卦，故不憂，是知將至上卦。若莊氏之說，直云下卦上極是至極，儻无上卦之體，何可至也？何須與幾也？是知至者，據上卦為文。莊說非也。「處事之至而不犯咎」，是「知至」者，謂三近上卦，事之將至，能以禮知屈，而不觸犯上卦之咎，則是知事之將至。「故可與成務」者，務謂事務。既識事之先幾，可與以成其事務。與猶許也，言可許之事，不謂此人共彼相與也。「進物之速者，義不若利」者，利則隨幾而發，見利則行也。義者依分而動，不妄求進。故進物速疾，義不如利，由義靜而利動故也。「存物之終者，利不及義」者，保全已成之物，不妄興動，故利不及義也。「故靡不有初，鮮克有終」者，見利則行，不顧在後，是靡不有初；不能守成其業，是鮮克有終。"
                  },
                  {
                    "type": "句",
                    "value": "注「明夫」至「不憂」也。　正義曰：「明夫終敝，故不驕」者，解知終也。「知夫至至，故不憂」者，解知至也。前經知至在前，知終在後，此經先解知終，後解知至者，隨文便而言之也。　注「處事」至「无咎」。　正義曰：「處事之極，失時而廢」者，謂三在下卦之上體，是處事之極至也。若失時不進，則幾務廢闕，所以乾乾須進也。「懈怠則曠」者，既處事極，極則終也，當保守己終之業；若懈怠驕逸，則功業空曠，所以乾乾也。「失時則廢」，解知至也。「懈怠則曠」，解知終也。"
                  }
                ]
              }
            ]
          }
        ]
      }
    },
    {
      "jijie": {
        "type": "爻",
        "index": 4,
        "lines": [
          {
            "type": "句",
            "value": "九四，或躍在淵，无咎。"
          }
        ]
      },
      "ycz": {
        "type": "爻",
        "index": 4,
        "lines": [
          {
            "type": "句",
            "value": "九四，或躍在淵，无咎。",
            "children": [
              {
                "type": "注",
                "text": "淵，龍之所安也。或，疑辭，謂非必也。躍不躍，惟及時以就安耳。聖人之動，无不時也。舜之歷試，時也。"
              }
            ]
          }
        ]
      },
      "zx": {
        "type": "爻",
        "index": 4,
        "lines": [
          {
            "type": "句",
            "value": "九四，或躍在淵，无咎。",
            "children": [
              {
                "type": "注",
                "text": "（躍，羊灼反。）或者，疑而未定之辭。躍者，無所緣而絕於地，特未飛爾。淵者，上空下洞，深昧不測之所。龍之在是，若下於田，或躍而起，則向乎天矣。九陽四陰，居上之下，改革之際，進退未定之時也。故其象如此，其占能隨時進退，則无咎也。"
              }
            ]
          }
        ]
      },
      "zhengyi": {
        "type": "爻",
        "index": 4,
        "lines": [
          {
            "type": "句",
            "value": "九四曰：「或躍在淵，无咎。」何謂也？子曰：「上下无常，非為邪也。進退无恒，非離群也。君子進德修業，欲及時也，故无咎。」",
            "children": [
              {
                "type": "疏",
                "lines": [
                  {
                    "type": "句",
                    "value": "疏　正義曰：此明九四爻辭也。「子曰：上下无常，非為邪」者，上而欲躍，下而欲退，是无常也。意在於公，非是為邪也。「進退无恒，非離群」者，何氏云：「所以進退无恒者，時使之然，非苟欲離群也。」何氏又云：「言上下者，據位也。進退者，據爻也。」所謂「非離群」者，言雖進退无恒，猶依群眾而行，和光俯仰，並同於眾，非是卓絕獨離群也。「君子進德修業，欲及時」者，進德則欲上、欲進也。修業則欲下、欲退也。進者棄位欲躍，是進德之謂也。退者仍退在淵，是修業之謂也。其意與九三同，但九四欲前進多於九三，故云欲及時也。九三則不云及時，但可與言幾而巳。"
                  }
                ]
              }
            ]
          }
        ]
      }
    },
    {
      "jijie": {
        "type": "爻",
        "index": 5,
        "lines": [
          {
            "type": "句",
            "value": "九五，飛龍在天，利見大人。"
          }
        ]
      },
      "ycz": {
        "type": "爻",
        "index": 5,
        "lines": [
          {
            "type": "句",
            "value": "九五，飛龍在天，利見大人。",
            "children": [
              {
                "type": "注",
                "text": "進位乎天位也。聖人既得天位，則利見在下大德之人，與共成天下之事。天下固利見夫大德之君也。"
              }
            ]
          }
        ]
      },
      "zx": {
        "type": "爻",
        "index": 5,
        "lines": [
          {
            "type": "句",
            "value": "九五，飛龍在天，利見大人。",
            "children": [
              {
                "type": "注",
                "text": "剛健中正以居尊位，如以聖人之德，居聖人之位。故其象如此，而占法與九二同，特所利見者在上之大人耳。若有其位，則為利見九二在下之大人也。"
              }
            ]
          }
        ]
      },
      "zhengyi": {
        "type": "爻",
        "index": 5,
        "lines": [
          {
            "type": "句",
            "value": "九五曰：「飛龍在天，利見大人。」何謂也？子曰：「同聲相應，同氣相求。水流濕，火就燥，雲從龍，風從虎，聖人作而萬物覩，本乎天者親上，本乎地者親下，則各從其類也。」",
            "children": [
              {
                "type": "疏",
                "lines": [
                  {
                    "type": "句",
                    "value": "疏　正義曰：此明九五爻之義，同聲相應已下至各從其類也。「飛龍在天」者，言天能廣感眾物，眾物應之，所以利見大人。因大人與眾物感應，故廣陳眾物相感應，以明聖人之作而萬物瞻覩以結之也。「同聲相應」者，若彈宮而宮應，彈角而角動是也。「同氣相求」者，若天欲雨而礎柱潤是也。此二者聲氣相感也。「水流濕，火就燥」者，此二者以形象相感，水流於地，先就濕處；火焚其薪，先就燥處。此同氣水火，皆无識而相感，先明自然之物，故發初言之也。「雲從龍，風從虎」者，龍是水畜，雲是水氣。故龍吟則景雲出，是雲從龍也。虎是威猛之獸，風是震動之氣，此亦是同類相感。故虎嘯則谷風生，是風從虎也。此二句明有識之物感无識，故以次言之，漸就有識而言也。「聖人作而萬物覩」者，此二句正釋「飛龍在天，利見大人」之義。聖人作則飛龍在天也，萬物覩則利見大人也。陳上數事之名，本明於此，是有識感有識也。此亦同類相感，聖人有生養之德，萬物有生養之情，故相感應也。「本乎天者親上，本乎地者親下」者，在上雖陳感應，唯明數事而巳。此則廣解天地之間共相感應之義。莊氏云：「天地絪縕，和合二氣，共生萬物。」然萬物之體，有感於天氣偏多者，有感於地氣偏多者，故《周禮．大宗伯》有「天產」、「地產」《大司徒》云：動物、植物，本受氣於天者，是動物含靈之屬，天體運動，含靈之物亦運動，是親附於上也。本受氣於地者，是植物无識之屬，地體凝滯，植物亦不移動，是親附於下也。「則各從其類者」，言天地之間，共相感應，各從其氣類。此類因聖人感萬物以同類，故以同類言之。其造化之性，陶甄之器，非唯同類相感，亦有異類相感者。若磁石引針，琥珀拾芥，蠶吐絲而商弦絕，銅山崩而洛鐘應，其類煩多，難一一言也。皆實理自然，不知其所以然也。感者動也，應者報也。皆先者為感，後者為應，非唯近事則相感，亦有遠事遙相感者。若周時獲麟，乃為漢高之應；漢時黃星，後為曹公之兆。感應之事，應非片言可悉，今意在釋理，故略舉大綱而巳。"
                  }
                ]
              }
            ]
          }
        ]
      }
    },
    {
      "jijie": {
        "type": "爻",
        "index": 6,
        "lines": [
          {
            "type": "句",
            "value": "上九，亢龍有悔。"
          },
          {
            "type": "句",
            "value": "［按］《說文》亢作忼。",
            "children": [
              {
                "type": "集解",
                "list": [
                  {
                    "text": "《子夏傳》曰：亢，極也。",
                    "book": "［釋文］"
                  },
                  {
                    "text": "　鄭康成曰：堯之末年，四凶在朝，是以有悔，未大凶也。",
                    "book": "［疏］"
                  },
                  {
                    "text": "　先儒云：但九五之位，亦有大聖而居者，亦有非大聖而居者，非大聖而居者不能免其憂悔。",
                    "book": "［口訣義］"
                  }
                ]
              }
            ]
          }
        ]
      },
      "ycz": {
        "type": "爻",
        "index": 6,
        "lines": [
          {
            "type": "句",
            "value": "上九，亢龍，有悔。",
            "children": [
              {
                "type": "注",
                "text": "九五者，位之極中正者。得時之極，過此則亢矣。上九至於亢極，故有悔也。有過則有悔。唯聖人知進退存亡而无過，則不至於悔也。"
              }
            ]
          }
        ]
      },
      "zx": {
        "type": "爻",
        "index": 6,
        "lines": [
          {
            "type": "句",
            "value": "上九，亢龍有悔。",
            "children": [
              {
                "type": "注",
                "text": "（亢，苦浪反。）上者，最上一爻之名。亢者，過於上而不能下之意也。陽極於上，動必有悔，故其象占如此。"
              }
            ]
          }
        ]
      },
      "zhengyi": {
        "type": "爻",
        "index": 6,
        "lines": [
          {
            "type": "句",
            "value": "上九曰：「亢龍有悔。」何謂也？子曰：「貴而无位，高而无民。",
            "children": [
              {
                "type": "注",
                "text": "下无陰也。"
              }
            ]
          },
          {
            "type": "句",
            "value": "賢人在下位而无輔，",
            "children": [
              {
                "type": "注",
                "text": "賢人雖在下而當位，不為之助。"
              }
            ]
          },
          {
            "type": "句",
            "value": "是以動而有悔也。",
            "children": [
              {
                "type": "注",
                "text": "處上卦之極而不當位，故盡陳其闕也。獨立而動物莫之與矣。《乾．文言》首不論乾而先說元，下乃曰乾，何也？夫乾者統行四事者也。君子以自強不息，行此四者，故首不論乾而下曰「乾，元亨利貞」。餘爻皆說龍，至於九三獨以君子為目，何也？夫易者象也。象之所生，生於義也。有斯義，然後明之以其物，故以龍敘乾，以馬敘坤，隨其事義而取象焉。是故初九、九二，龍德皆應其義，故可論龍以明之也。至於九三「乾乾夕惕」，非龍德也，明以君子當其象矣。統而舉之，乾體皆龍，別而敘之，各隨其義。"
              },
              {
                "type": "疏",
                "lines": [
                  {
                    "type": "句",
                    "value": "疏　正義曰：此明上九爻辭也。「子曰貴而无位」者，以上九非位而上九居之，是无位也。「高而无民」者，六爻皆无陰，是无民也。贒人在下位而无輔者，贒人雖在下位，不為之輔助也，是以動而有悔者。聖人設誡居此之時，不可動作也。　 注：處上至其義。　正義曰：「夫乾者統行四事者也，君子以自強不息，行此四者」，注意以乾為四德之主，《文言》之首，應先說乾而先說四德者，故自發問而釋之，以乾體當分无功，唯統行此四德之事。行此四德，乃是乾之功。故《文言》先說君子以自強不息行此四德者，故先言之，發首不論乾也。但能四德既備，乾功自成，故下始云乾元亨利貞。"
                  }
                ]
              }
            ]
          },
          {
            "type": "句",
            "value": "潛龍勿用，下也。見龍在田，時舍也。終日乾乾，行事也。或躍在淵，自試也。飛龍在天，上治也。亢龍有悔，窮之災也。乾元用九，天下治也。",
            "children": [
              {
                "type": "注",
                "text": "此一章全以人事明之也。九，陽也。陽，剛直之物也。夫能全用剛直，放遠善柔，非天下至理，未之能也。故乾元用九，則天下治也。夫識物之動，則其所以然之理，皆可知也。龍之為德，不為妄者也。潛而勿用，何乎？必窮處於下也。見而在田，必以時之通舍也。以爻為人，以位為時，人不妄動，則時皆可知也。文王明夷，則主可知矣。仲尼旅人，則國可知矣。"
              },
              {
                "type": "疏",
                "lines": [
                  {
                    "type": "句",
                    "value": "疏　正義曰：此一節是《文言》第三節，說六爻人事所治之義。「潛龍勿用，下也」者，言聖人於此潛龍之時，在卑下也。「見龍在田，時舍」者，舍謂通舍。九二以見龍在田，是時之通舍也。「終日乾乾，行事」者，言行此知至、知終之事也。「或躍在淵，自試」者，言聖人逼近五位，不敢果決而進，唯漸漸自試，意欲前進，遲疑不定，故云自試也。「飛龍在天，上治」者，言聖人居上位而治理也。「亢龍有悔，窮之災」者，言位窮而致災，災則悔也，非為大禍災也。「乾元用九，天下治」者，《易經》上稱「用九」，「用九」之文，摠是乾德。又乾字不可獨言，故舉元德以配乾也。言此乾元用九德而天下治。九五止是一爻，觀見事狹，但云上治。乾元摠包六爻，觀見事闊，故云「天下治」也。　注「此一章全以人事」至「可知」也。　正義曰：此一章全以人事明之者，下云「陽氣潛藏」，又云「乃位乎天德」，又云「乃見天則」，此一章但云「天下治」，是皆以人事說之也。「夫能全用剛直，放遠善柔，非天下至理，未之能也」者，以乾元用九，六爻皆陽，是全用剛直。放遠善柔，謂放棄善柔之人。善能柔諂，貌恭心恨（當作狠），使人不知其惡，識之為難。此用九純陽者，是全用剛直，更无餘陰。柔善之人，堯尚病之，故云：「非天下之至理，未之能也」。「夫識物之動，則其所以然之理，皆可知」者，此欲明在下龍潛見之義。故張氏云：「識物之動，謂龍之動也。則其所以然之理，皆可知者，謂識龍之所以潛、所以見，然此之理皆可知也。」「龍之為德，不為妄」者，言龍靈異於他獸，不妄舉動，可潛則潛，可見利見，是不虛妄也。「見而在田，必以時之通舍」者，經唯云時舍也。注云「必以時之通舍」者，則輔嗣以通解舍，舍是通義也。初九潛藏不見，九二既見而在田，是時之通舍之義也。「以爻為人，以位為時」者，爻居其位，猶若人遇其時，故「文王明夷，則主可知矣」。主則時也，謂當時无道，故明傷也。「仲尼旅人，則國可知矣」，國亦時也，若見仲尼羈旅於人，則知國君无道，令其羈旅出外。引文王、仲尼者，明龍潛、龍見之義。"
                  }
                ]
              }
            ]
          },
          {
            "type": "句",
            "value": "潛龍勿用，陽氣潛藏。見龍在田，天下文明。終日乾乾，與時偕行。"
          },
          {
            "type": "句",
            "value": "與天時俱不息。"
          },
          {
            "type": "句",
            "value": "或躍在淵，乾道乃革。飛龍在天，乃位乎天德。亢龍有悔，與時偕極。"
          },
          {
            "type": "句",
            "value": "與時運俱終極。"
          },
          {
            "type": "句",
            "value": "乾元用九，乃見天則。",
            "children": [
              {
                "type": "注",
                "text": "此一章全說天氣以明之也。九，剛直之物，唯乾體能用之，用純剛以觀天，天則可見矣。"
              },
              {
                "type": "疏",
                "lines": [
                  {
                    "type": "句",
                    "value": "疏　正義曰：此一節是《文言》第四節，明六爻天氣之義。「天下文明」者，陽氣在田，始生萬物，故天下有文章而光明也。「與時偕行」者，此以天道釋爻象也。所以九三乾乾不息，終日自戒者，同於天時，生物不息，言與時偕行也。偕，俱也。諸儒以為建辰之月，萬物生長，不有止息，與天時而俱行。若以不息言之，是建寅之月，三陽用事，三當生物之初，生物不息。同於天時，生物不息，故言「與時偕行」也。"
                  },
                  {
                    "type": "句",
                    "value": "「乾道乃革」者，去下體，入上體，故云乃革也。「乃位乎天德」者，位當天德之位，言九五陽居於天，照臨廣大，故云天德也。"
                  }
                ]
              }
            ]
          },
          {
            "type": "句",
            "value": "「乃見天則」者，陽者剛亢之物，能用此純剛，唯天乃然，故云乃見天則。"
          },
          {
            "type": "句",
            "value": "乾元者，始而亨者也。利貞者，性情也。",
            "children": [
              {
                "type": "注",
                "text": "不為乾元，何能通物之始；不性其情，何能久行其正？是故始而亨者，必乾元也。利而正者，必性情也。"
              }
            ]
          },
          {
            "type": "句",
            "value": "乾始能以美利利天下，不言所利，大矣哉！大哉乾乎，剛健中正，純粹精也！六爻發揮，旁通情也。時乘六龍，以禦天也。雲行雨施，天下平也。",
            "children": [
              {
                "type": "疏",
                "lines": [
                  {
                    "type": "句",
                    "value": "疏　正義曰：「此一節是第五節，復明上初章及乾四德之義也。乾元者，始而亨者也，以乾非是當分有德，以元、亨、利、貞為德。元是四德之首，故夫子恒以元配乾而言之，欲見乾元相將之義也。以有乾之元德，故能為物之始而亨通也。此解元亨二德也。「利貞者，性情也」者，所以能利益於物而得正者，由性制於情也。"
                  },
                  {
                    "type": "句",
                    "value": "「乾始能以美利利天下，不言所利，大矣哉」者，此復說始而亨，利貞之義。乾始，謂乾能始生萬物，解元也。「能以美利利天下」，解利也。謂能以生長美善之道，利益天下也。不復說亨貞者，前文亨既連始，貞又連利，舉始舉利，則通包亨貞也。「不言所利，大矣哉」者，若《坤卦》云「利牝馬之貞」，及「利建侯」，「利涉大川」，皆言所利之事。此直云利貞，不言所利之事，欲見无不利也。非唯止一事而已，故云「不言所利大矣哉」，其實此利為无所不利，此貞亦无所不貞，是乾德大也，「大哉乾乎，剛健中正，純粹精」者，此正論乾德，不兼通元也。故直云「大哉乾乎，剛健中正，謂純陽剛健，其性剛強，其行勁健。中謂二與五也，正謂五與二也，故云「剛健中正」。六爻俱陽，是純粹也。純粹不雜，是精靈，故云「純粹精也」。「六爻發揮，旁通情」者，發謂發越也，揮謂揮散也，言六爻發越揮散，旁通萬物之情也。「時乘六龍，以御天」者，重取《乾．彖》之文，以讚美此乾之義。「雲行雨施，天下平」者，言天下普得其利而均平不偏陂。　注：不為至性情也　　正義曰：乾之元氣，其德廣大，故能徧通諸物之始。若餘卦元德，雖能始生萬物，德不周普，故云「不為乾元，何能通物之始」？其實坤元亦能通諸物之始，以此《文言》論乾元之德，故注連言乾元也。「不性其情，何能久行其正」者，性者天生之質，正而不邪；情者性之欲也。言若不能以性制情，使其情如性，則不能久行其正。其六爻發揮之義。案：《略例》。云：「爻者，言乎變者也。」故合散屈伸，與體相乖，形躁好靜，質柔愛剛，體與情反，質與願違。是爻者所以明情，故六爻發散，旁通萬物之情。輔嗣之意，以初為无用之地，上為盡末之境。其居位者唯二、三、四、五，故《繫辭》唯論此四爻。初、上雖无正位，統而論之，爻亦始末之位，故《乾．彖》云「六位時成」。二、四為陰位，陰居為得位，陽居為失位；三、五為陽位，陽居為得位，陰居為失位。《略例》云：「陽之所求者陰也，陰之所求者陽也」。一與四，二與五，三與上，若一陰一陽為有應，若俱陰俱陽為无應。此其六爻之大略，其義具於《繫辭》，於此略言之。"
                  }
                ]
              }
            ]
          },
          {
            "type": "句",
            "value": "君子以成德為行，日可見之行也。潛之為言也，隱而未見，行而未成，是以君子弗用也。",
            "children": [
              {
                "type": "疏",
                "lines": [
                  {
                    "type": "句",
                    "value": "疏　正義曰：此一節是《文言》第六節，更復明六爻之義。此節明初九爻辭。周氏云：「上第六節乾元者始而亨者也，是廣明乾與四德之義，此君子以成德為行，亦是第六節，明六爻之義，摠屬第六節，不更為第七節。」義或當然也。「君子以成德為行」者，明初九潛龍之義，故先開此語也。言君子之人，當以成就道德為行，令其德行彰顯，使人日可見其德行之事，此君子之常也，不應潛隱。所以今日潛者，以時未可見，故須潛也。「潛之為言也，隱而未見，行而未成」，此夫子解潛龍之義。此經中潛龍之言，是德之幽隱而未宣見，所行之行未可成就。「是以君子弗用」者，德既幽隱，行又未成，是君子於時不用，以逢眾陰，未可用也。周氏云：「德出於己，在身內之物，故云成；行被於人，在外之事，故云為行。」下又即云「行而未成」，是行亦稱成。周氏之說，恐義非也。「成德為行」者，言君子成就道德以為其行。其成就道德，未必文相對。"
                  }
                ]
              }
            ]
          },
          {
            "type": "句",
            "value": "君子學以聚之，問以辯之。",
            "children": [
              {
                "type": "注",
                "text": "以君德而處下體，資納於物者也。"
              }
            ]
          },
          {
            "type": "句",
            "value": "寬以居之，仁以行之。《易》曰「見龍在田，利見大人」，君德也。",
            "children": [
              {
                "type": "疏",
                "lines": [
                  {
                    "type": "句",
                    "value": "疏　正義曰：此復明九二之德。「君子學以聚之」者，九二從微而進，未在君位，故且習學以畜其德。「問以辯之」者，學有未了，更詳問其事，以辨決於疑也。"
                  },
                  {
                    "type": "句",
                    "value": "「寬以居之」者，當用寬裕之道，居處其位也。「仁以行之」者，以仁恩之心，行之被物。《易》曰「見龍在田，利見大人」，君德者，既陳其德於上，然後引《易》本文以結之。《易》之所云是君德，寬以居之，仁以行之是也。但有君德，未是君位。"
                  }
                ]
              }
            ]
          },
          {
            "type": "句",
            "value": "九三，重剛而不中，上不在天，下不在田。故乾乾，因其時而惕，雖危无咎矣。",
            "children": [
              {
                "type": "疏",
                "lines": [
                  {
                    "type": "句",
                    "value": "疏　正義曰：此明九三爻辭。上之初九、九二皆豫陳其德於上，不發首云初九、九二，此九三、九四，則發首先言九三、九四；其九五全不引《易》文，上九則發首云「亢之為言」也。上下不為例者，夫子意在釋經，義便則言，以潛見須言其始，故豫張本於上。三、四俱言「重剛不中」，恐其義同，故並先云爻位并重剛不中之事。九五前章已備，故不復引《易》，但云大人也。上九亦前章備顯，故此直言亢之為言也。案：初九云「潛之為言」，上爻云「亢之為言」，獨二爻云「言」者，褚氏以初九居无位之地，故稱言也；其餘四爻是有位，故不云言，義或然也。重剛者，上下俱陽，故重剛也。不中者，不在二、五之位，故不中也。上不在天，謂非五位；下不在田，謂非二位也。「故乾乾因其時而惕，雖危无咎矣」者，居危之地，以乾乾夕惕，戒懼不息，得无咎也。"
                  }
                ]
              }
            ]
          },
          {
            "type": "句",
            "value": "九四，重剛而不中，上不在天，下不在田，中不在人，故或之。或之者，疑之也，故无咎。",
            "children": [
              {
                "type": "疏",
                "lines": [
                  {
                    "type": "句",
                    "value": "疏　正義曰：此明九四爻辭也。其「重剛不中，上不在天，下不在田」，並與九三同也。「中不在人」者，三之與四，俱為人道。但人道之中，人下近於地，上遠於天，九三近二，是下近於地，正是人道，故九三不云「中不在人」。九四則上近於天，下遠於地，非人所處，故特云「中不在人」。「故或之」者，以其上下无定，故心或之也。「或之者，疑之也」者，此夫子釋經或字。經稱或是疑惑之辭，欲進欲退，猶豫不定，故疑之也。九三中雖在人，但位卑近下，向上為難，故危惕，其憂深也。九四則陽德漸盛，去五彌近，前進稍易，故但疑惑，憂則淺也。"
                  }
                ]
              }
            ]
          },
          {
            "type": "句",
            "value": "夫大人者，與天地合其德，與日月合其明，與四時合其序，與鬼神合其吉凶。先天而天弗違，後天而奉天時。天且弗違，而況於人乎？況於鬼神乎？",
            "children": [
              {
                "type": "疏",
                "lines": [
                  {
                    "type": "句",
                    "value": "疏　正義曰：此明九五爻辭。但上節明大人與萬物相感，此論大人之德，无所不合，廣言所合之事。「與天地合其德」者，莊氏云：「謂覆載也」。「與日月合其明」者，謂照臨也。「與四時合其序」者，若賞以春夏，刑以秋冬之類也。「與鬼神合其吉凶」者，若福善禍淫也。「先天而天弗違」者，若在天時之先行事，天乃在後不違，是天合大人也。「後天而奉天時」者，若在天時之後行事，能奉順上天，是大人合天也。「天且弗違，而況於人乎，況於鬼神乎」者，夫子以天且不違，遂明大人之德，言尊而遠者尚不違，況小而近者可有違乎？況於人乎？況於鬼神乎？"
                  }
                ]
              }
            ]
          },
          {
            "type": "句",
            "value": "亢之為言也，知進而不知退，知存而不知亡，知得而不知喪。其唯聖人乎！知進退存亡，而不失其正者，其唯聖人乎！",
            "children": [
              {
                "type": "疏",
                "lines": [
                  {
                    "type": "句",
                    "value": "疏　正義曰：此明上九之義也。「知進而不知退，知存而不知亡，知得而不知喪」者，言此上九所以亢極有悔者，正由有此三事。若能三事備知，雖居上位，不至於亢也。此設誡辭。莊氏云：「進退據心，存亡據身，得喪據位。」「其唯聖人乎，知進退存亡」者，言唯聖人乃能「知進退存亡」也。何不云得喪者，得喪輕於存亡，舉重略輕也。「而不失其正者，其唯聖人乎」者，聖人非但止知進退存亡，又能不失其正道，其唯聖人乎！此經再稱「其唯聖人乎」者，上稱聖人為「知進退存亡」發文，下稱「其唯聖人乎」者，為「不失其正」發文，言聖人非但知進退存亡，又能不失其正，故再發「聖人」之文也。"
                  }
                ]
              }
            ]
          },
          {
            "type": "句",
            "value": "《周易注疏》卷第一"
          }
        ]
      }
    }
  ],
  "daxiang": {
    "jijie": {
      "type": "大象",
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：天行健，",
          "children": [
            {
              "type": "集解",
              "list": [
                {
                  "text": "劉表曰：詳其名也。",
                  "book": "［疏］"
                },
                {
                  "text": "　先儒云：象辭或有實象，或有假象。",
                  "book": "［同］"
                }
              ]
            }
          ]
        },
        {
          "type": "句",
          "value": "君子以自強不息。"
        },
        {
          "type": "句",
          "value": "潛龍勿用，陽在下也。"
        },
        {
          "type": "句",
          "value": "見龍在田，德施普也。"
        },
        {
          "type": "句",
          "value": "終日乾乾，反復道也。",
          "children": [
            {
              "type": "释文",
              "text": "復本亦作覆。 "
            }
          ]
        },
        {
          "type": "句",
          "value": "或躍在淵，進无咎也。"
        },
        {
          "type": "句",
          "value": "飛龍在天，大人造也。",
          "children": [
            {
              "type": "释文",
              "text": "造，鄭：徂早反。王肅：七到反。劉歆父子作聚。"
            },
            {
              "type": "集解",
              "list": [
                {
                  "text": "鄭康成曰：造為也。　王肅曰：造，就也，至也。",
                  "book": "［并釋文］"
                },
                {
                  "text": "　姚信曰：造，至也。　陸績同。",
                  "book": "［并疏］"
                }
              ]
            }
          ]
        },
        {
          "type": "句",
          "value": "亢龍有悔，盈不可久也。"
        },
        {
          "type": "句",
          "value": "用九，天德不可為首也。"
        }
      ]
    },
    "wangzhu": {
      "type": "大象",
      "lines": [
        {
          "type": "句",
          "value": "象曰：天行健，君子以自強不息。 潛龍勿用，陽在下也。 見龍在田，德施普也。 終日乾乾，反復道也。",
          "children": [
            {
              "type": "注",
              "text": "以上言之則不驕，以下言之則不憂，反覆皆道也。"
            }
          ]
        },
        {
          "type": "句",
          "value": "或躍在淵，進，无咎也。 飛龍在天，大人造也。 亢龍有悔，盈不可久也。 用九，天德，不可為首也。"
        }
      ]
    },
    "ycz": {
      "type": "大象",
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：天行健，君子以自彊不息。",
          "children": [
            {
              "type": "注",
              "text": "卦下象解一卦之象，爻下象解一爻之象。諸卦皆取象以為法。乾道覆育之象至大，非聖人莫能體，欲人皆可取法也，故取其行健而已，至健固足以見天道也。君子以自彊不息，法天行之健也。"
            }
          ]
        },
        {
          "type": "句",
          "value": "潛龍勿用，陽在下也。",
          "children": [
            {
              "type": "注",
              "text": "陽氣在下，君子處微，未可用也。"
            }
          ]
        },
        {
          "type": "句",
          "value": "見龍在田，德施普也。",
          "children": [
            {
              "type": "注",
              "text": "見於地上，德化及物，其施已普也。"
            }
          ]
        },
        {
          "type": "句",
          "value": "終日乾乾，反復道也。",
          "children": [
            {
              "type": "注",
              "text": "進退動息，必以道也。"
            }
          ]
        },
        {
          "type": "句",
          "value": "或躍在淵，進无咎也。",
          "children": [
            {
              "type": "注",
              "text": "量可而進，適其時則无咎也。"
            }
          ]
        },
        {
          "type": "句",
          "value": "飛龍在天，大人造也。",
          "children": [
            {
              "type": "注",
              "text": "大人之為，聖人之事也。"
            }
          ]
        },
        {
          "type": "句",
          "value": "亢龍有悔，盈不可久也。",
          "children": [
            {
              "type": "注",
              "text": "盈則變，有悔也。"
            }
          ]
        },
        {
          "type": "句",
          "value": "用九，天德不可為首也。",
          "children": [
            {
              "type": "注",
              "text": "用九，天德也。天德陽剛，復用剛而好先，則過矣。"
            }
          ]
        }
      ]
    },
    "zhengyi": {
      "type": "大象",
      "lines": [
        {
          "type": "句",
          "value": "《象》曰：天行建，君子以自強不息。",
          "children": [
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：此《大象》也。《十翼》之中第三翼，總象一卦，故謂之「大象」。釋為物之體，自然各有形象，聖人設卦以寫萬物之象。今夫子釋此卦之所象，故言「《象》曰」。天有純剛，故有健用。今畫純陽之卦以比擬之，故謂之《象》。《象》在《彖》後者，《彖》詳而《象》略也。是以過半之義，思在《彖》而不在《象》，有由而然也。「天行健」者，行者，運動之稱，健者強壯之名，乾是眾健之訓。今《大象》不取餘健為釋，偏說天者，萬物壯健，皆有衰怠，唯天運動日過一度，蓋運轉混沒，未曾休息，故云「天行健」。健是乾之訓也。順者坤之訓也。《坤》則云「地勢坤」。此不言「天行乾」而言「健」者，劉表云：「詳其名也。」然則天是體名，乾是用名，健是其訓，三者並見，最為詳悉，所以尊乾異於他卦。凡六十四卦，說象不同：或摠舉象之所由，不論象之實體，又摠包六爻，不顯上體下體，則乾、坤二卦是也。或直舉上下二體者，若「雲雷，屯」，也。「天地交，泰」也，「天地不交，否」也。「雷電，噬嗑」也，「雷風，恒」也，「雷雨作，解」也，「風雷，益」也，「雷電皆至，豐」也，「洊雷，震」也，「隨風，巽」也，「習坎，坎」也，「明兩作，離」也，「兼山，艮」也，「麗澤，兌」也。凡此一十四卦，皆摠舉兩體而結義也。取兩體俱成，或有直舉兩體上下相對者，「天與水違行，訟」也，「上天下澤，履」也，「天與火，同人」也，「上火下澤，睽」也，凡此四卦，或取兩體相違，或取兩體相合，或取兩體上下相承而為卦也，故兩體相對而俱言也。雖上下二體，共成一卦，或直指上體而為文者，若「雲上於天，需」也，「風行天上，小畜」也，「火在天上，大有」也，「雷出地奮，豫」也，「風行地上，觀」也，「山附於地，剝」也，「澤滅木，大過」也，「雷在天上，大壯」也，「明出地上，晉」也，「風自火出，家人」也，「澤上於天，夬」也，「澤上於地，萃」也。「風行水上，渙」也，「水在火上，既濟」也，「火在水上，未濟」也。凡此十五卦，皆先舉上象而連於下，亦意取上象以立卦名也。亦有雖意在上象，而先舉下象，以出上象者，「地上有水，比」也，「澤上有地，臨」也，「山上有澤，咸」也，「山上有火，旅」也，「木上有水，井」也，「木上有火，鼎」也，「山上有木，漸」也，「澤上有雷，歸妹」也，「山上有水，蹇」也，「澤上有水，節」也，「澤上有風，中孚」也，「山上有雷，小過」也。凡此十二卦，皆先舉下象以出上象，亦意取上象共下象而成卦也。或先舉上象而出下象，義取下象以成卦義者，「山下出泉，蒙」也，「地中有水，師」也，「山下有風，蠱」也，「山下有火，賁」也，「天下雷行，无妄」也，「山下有雷，頤」也，「天下有山，遯」也，「山下有澤，損」也，「天下有風，姤」也，「地中有山，謙」也，「澤中有雷，隨」也，「地中生木，升也」，「澤中有火，革」也。凡此十三卦，皆先舉上體，後明下體也。其上體是天，天與山則稱「下」也。若上體是地，地與澤則稱中也。或有雖先舉下象，稱在上象之下者，若「雷在地中，復」也，「天在山中，大畜」也，「明入地中，明夷」也，「澤无水，困」也。是先舉下象而稱在上象之下，亦義取下象以立卦也。所論之例者，皆大判而言之，其間委曲，各於卦下別更詳之。先儒所云此等象辭，或有實象，或有假像。實象者，若「地上有水，比」也，「地中生木，升」也，皆非虛，故言實也。假像者，若「天在山中」，「風自火出」，如此之類，實无此象，假而為義，故謂之假也。雖有實象、假像，皆以義示人，摠謂之象也。「天行健」者，謂天體之行，晝夜不息，周而復始，无時虧退，故云「天行健」。此謂天之自然之象。「君子以自彊不息」，此以人事法天所行，言君子之人，用此卦象，自彊勉力，不有止息。言君子者，謂君臨上位，子受下民，通天子諸侯，兼公卿大夫有地者。凡言「君子」，義皆然也。但位尊者象卦之義多也，位卑者象卦之義少也。但須量力而行，各法其卦也，所以諸卦並稱「君子」。若卦體之義，唯施於天子，不兼包在下者，則言「先王」也。若《比卦》稱「先王以建萬國」，《豫卦》稱「先王以作樂崇德」，《觀卦》稱「先王以省方觀民設教」，《噬嗑》稱「先王以明罰敕法」，《復卦》稱「先王以至日閉關」，《无妄》稱「先王以茂對時育萬物」，《渙卦》稱「先王以享於帝立廟」，《泰卦》稱「后以財成天地之道」，《姤卦》稱「后以施命誥四方」。稱「后」兼諸侯也，自外卦並稱「君子」。"
                }
              ]
            }
          ]
        },
        {
          "type": "句",
          "value": "潛龍勿用，陽在下也。見龍在田，德施普也。終日乾乾，反復道也。",
          "children": [
            {
              "type": "注",
              "text": "以上言之則不驕，以下言之則不憂，反覆皆道也。"
            }
          ]
        },
        {
          "type": "句",
          "value": "或躍在淵，進无咎也。飛龍在天，大人造也。亢龍有悔，盈不可久也，",
          "children": [
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：自此以下至「盈不可久」，是夫子釋六爻之《象》辭，謂之《小象》。以初九陽潛地中，故云「陽在下也」。經言「龍」而《象》言「陽」者，明經之稱龍，則陽氣也。此一爻之象，專明天之自然之氣也。「見龍在田，德施普」者，此以人事言之，用龍德在田，似聖人己出在世，道德恩施，能普徧也。比「初九勿用」，是其周普也。若比九五，則猶狹也。「終日乾乾，反復道」者，此亦以人事言之。君子「終日乾乾」，自彊不息，故反之與覆，皆合其道。反謂進反在上也，處下卦之上，能不驕逸，是反能合道也。覆謂從上倒覆而下，居上卦之下，能不憂懼，是覆能合道也。"
                },
                {
                  "type": "句",
                  "value": "「或躍在淵，進无咎」者，此亦人事言之。進則跳躍在上，退在潛處在淵，猶聖人疑或，而在於貴位也。心所欲進，意在於公，非是為私，故「進无咎」也。「飛龍在天，大人造」者，此亦人事言之。「飛龍在天」，猶聖人之在王位。造，為也。唯大人能為之而成就也。姚信、陸績之屬，皆以「造」為造至之造。今案：《象》辭皆上下為韻，則姚信之義，其讀非也。「亢龍有悔，盈不可久」者，此亦人事言之。九五是盈也，盈而不已則至上九，地致亢極，有悔恨也。故云「盈不可久也」。但此六爻《象》辭，第一爻言「陽在下」，是舉自然之象，明其餘五爻皆有自然之象，舉初以見未。五爻並論人事，則知初爻亦有人事，互文相通也。"
                }
              ]
            }
          ]
        },
        {
          "type": "句",
          "value": "用九，天德不可為首也。",
          "children": [
            {
              "type": "疏",
              "lines": [
                {
                  "type": "句",
                  "value": "疏　正義曰：此一節釋經之「用九」之《象》辭。經稱「用九」，故《象》更疊云「用九」。云「天德不可為首」者，此夫子釋辭也。九是天之德也，天德剛健，當以柔和接待於下，不可更懷尊剛為物之首，故云「天德不可為首也」。"
                }
              ]
            }
          ]
        }
      ]
    }
  },
  "xiaoxiang": [
    {},
    {},
    {},
    {},
    {},
    {}
  ]
}